{
  "last_updated": "2025-10-28T00:48:52.563537",
  "papers": [
    {
      "title": "A Knowledge-Graph Translation Layer for Mission-Aware Multi-Agent Path Planning in Spatiotemporal Dynamics",
      "authors": [
        "Edward Holmberg",
        "Elias Ioup",
        "Mahdi Abdelguerfi"
      ],
      "abstract": "The coordination of autonomous agents in dynamic environments is hampered by\nthe semantic gap between high-level mission objectives and low-level planner\ninputs. To address this, we introduce a framework centered on a Knowledge Graph\n(KG) that functions as an intelligent translation layer. The KG's two-plane\narchitecture compiles declarative facts into per-agent, mission-aware\n``worldviews\" and physics-aware traversal rules, decoupling mission semantics\nfrom a domain-agnostic planner. This allows complex, coordinated paths to be\nmodified simply by changing facts in the KG. A case study involving Autonomous\nUnderwater Vehicles (AUVs) in the Gulf of Mexico visually demonstrates the\nend-to-end process and quantitatively proves that different declarative\npolicies produce distinct, high-performing outcomes. This work establishes the\nKG not merely as a data repository, but as a powerful, stateful orchestrator\nfor creating adaptive and explainable autonomous systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.21695v1",
      "published": "2025-10-24T17:55:55+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21695v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "On Thin Ice: Towards Explainable Conservation Monitoring via Attribution and Perturbations",
      "authors": [
        "Jiayi Zhou",
        "Günel Aghakishiyeva",
        "Saagar Arya",
        "Julian Dale",
        "James David Poling",
        "Holly R. Houliston",
        "Jamie N. Womble",
        "Gregory D. Larsen",
        "David W. Johnston",
        "Brinnae Bent"
      ],
      "abstract": "Computer vision can accelerate ecological research and conservation\nmonitoring, yet adoption in ecology lags in part because of a lack of trust in\nblack-box neural-network-based models. We seek to address this challenge by\napplying post-hoc explanations to provide evidence for predictions and document\nlimitations that are important to field deployment. Using aerial imagery from\nGlacier Bay National Park, we train a Faster R-CNN to detect pinnipeds (harbor\nseals) and generate explanations via gradient-based class activation mapping\n(HiResCAM, LayerCAM), local interpretable model-agnostic explanations (LIME),\nand perturbation-based explanations. We assess explanations along three axes\nrelevant to field use: (i) localization fidelity: whether high-attribution\nregions coincide with the animal rather than background context; (ii)\nfaithfulness: whether deletion/insertion tests produce changes in detector\nconfidence; and (iii) diagnostic utility: whether explanations reveal\nsystematic failure modes. Explanations concentrate on seal torsos and contours\nrather than surrounding ice/rock, and removal of the seals reduces detection\nconfidence, providing model-evidence for true positives. The analysis also\nuncovers recurrent error sources, including confusion between seals and black\nice and rocks. We translate these findings into actionable next steps for model\ndevelopment, including more targeted data curation and augmentation. By pairing\nobject detection with post-hoc explainability, we can move beyond \"black-box\"\npredictions toward auditable, decision-supporting tools for conservation\nmonitoring.",
      "pdf_url": "http://arxiv.org/pdf/2510.21689v1",
      "published": "2025-10-24T17:46:24+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21689v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "A Multimodal Benchmark for Framing of Oil & Gas Advertising and Potential Greenwashing Detection",
      "authors": [
        "Gaku Morio",
        "Harri Rowlands",
        "Dominik Stammbach",
        "Christopher D. Manning",
        "Peter Henderson"
      ],
      "abstract": "Companies spend large amounts of money on public relations campaigns to\nproject a positive brand image. However, sometimes there is a mismatch between\nwhat they say and what they do. Oil & gas companies, for example, are accused\nof \"greenwashing\" with imagery of climate-friendly initiatives. Understanding\nthe framing, and changes in framing, at scale can help better understand the\ngoals and nature of public relations campaigns. To address this, we introduce a\nbenchmark dataset of expert-annotated video ads obtained from Facebook and\nYouTube. The dataset provides annotations for 13 framing types for more than 50\ncompanies or advocacy groups across 20 countries. Our dataset is especially\ndesigned for the evaluation of vision-language models (VLMs), distinguishing it\nfrom past text-only framing datasets. Baseline experiments show some promising\nresults, while leaving room for improvement for future work: GPT-4.1 can detect\nenvironmental messages with 79% F1 score, while our best model only achieves\n46% F1 score on identifying framing around green innovation. We also identify\nchallenges that VLMs must address, such as implicit framing, handling videos of\nvarious lengths, or implicit cultural backgrounds. Our dataset contributes to\nresearch in multimodal analysis of strategic communication in the energy\nsector.",
      "pdf_url": "http://arxiv.org/pdf/2510.21679v1",
      "published": "2025-10-24T17:34:28+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21679v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "CMOMgen: Complex Multi-Ontology Alignment via Pattern-Guided In-Context Learning",
      "authors": [
        "Marta Contreiras Silva",
        "Daniel Faria",
        "Catia Pesquita"
      ],
      "abstract": "Constructing comprehensive knowledge graphs requires the use of multiple\nontologies in order to fully contextualize data into a domain. Ontology\nmatching finds equivalences between concepts interconnecting ontologies and\ncreating a cohesive semantic layer. While the simple pairwise state of the art\nis well established, simple equivalence mappings cannot provide full semantic\nintegration of related but disjoint ontologies. Complex multi-ontology matching\n(CMOM) aligns one source entity to composite logical expressions of multiple\ntarget entities, establishing more nuanced equivalences and provenance along\nthe ontological hierarchy.\n  We present CMOMgen, the first end-to-end CMOM strategy that generates\ncomplete and semantically sound mappings, without establishing any restrictions\non the number of target ontologies or entities. Retrieval-Augmented Generation\nselects relevant classes to compose the mapping and filters matching reference\nmappings to serve as examples, enhancing In-Context Learning. The strategy was\nevaluated in three biomedical tasks with partial reference alignments. CMOMgen\noutperforms baselines in class selection, demonstrating the impact of having a\ndedicated strategy. Our strategy also achieves a minimum of 63% in F1-score,\noutperforming all baselines and ablated versions in two out of three tasks and\nplacing second in the third. Furthermore, a manual evaluation of non-reference\nmappings showed that 46% of the mappings achieve the maximum score, further\nsubstantiating its ability to construct semantically sound mappings.",
      "pdf_url": "http://arxiv.org/pdf/2510.21656v1",
      "published": "2025-10-24T17:12:22+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21656v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Group Inertial Poser: Multi-Person Pose and Global Translation from Sparse Inertial Sensors and Ultra-Wideband Ranging",
      "authors": [
        "Ying Xue",
        "Jiaxi Jiang",
        "Rayan Armani",
        "Dominik Hollidt",
        "Yi-Chi Liao",
        "Christian Holz"
      ],
      "abstract": "Tracking human full-body motion using sparse wearable inertial measurement\nunits (IMUs) overcomes the limitations of occlusion and instrumentation of the\nenvironment inherent in vision-based approaches. However, purely IMU-based\ntracking compromises translation estimates and accurate relative positioning\nbetween individuals, as inertial cues are inherently self-referential and\nprovide no direct spatial reference for others. In this paper, we present a\nnovel approach for robustly estimating body poses and global translation for\nmultiple individuals by leveraging the distances between sparse wearable\nsensors - both on each individual and across multiple individuals. Our method\nGroup Inertial Poser estimates these absolute distances between pairs of\nsensors from ultra-wideband ranging (UWB) and fuses them with inertial\nobservations as input into structured state-space models to integrate temporal\nmotion patterns for precise 3D pose estimation. Our novel two-step optimization\nfurther leverages the estimated distances for accurately tracking people's\nglobal trajectories through the world. We also introduce GIP-DB, the first\nIMU+UWB dataset for two-person tracking, which comprises 200 minutes of motion\nrecordings from 14 participants. In our evaluation, Group Inertial Poser\noutperforms previous state-of-the-art methods in accuracy and robustness across\nsynthetic and real-world data, showing the promise of IMU+UWB-based multi-human\nmotion capture in the wild. Code, models, dataset:\nhttps://github.com/eth-siplab/GroupInertialPoser",
      "pdf_url": "http://arxiv.org/pdf/2510.21654v1",
      "published": "2025-10-24T17:11:50+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21654v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.GR",
        "cs.HC",
        "68T07, 68T45, 68U01",
        "I.2; I.3; I.4; I.5"
      ]
    },
    {
      "title": "AstaBench: Rigorous Benchmarking of AI Agents with a Scientific Research Suite",
      "authors": [
        "Jonathan Bragg",
        "Mike D'Arcy",
        "Nishant Balepur",
        "Dan Bareket",
        "Bhavana Dalvi",
        "Sergey Feldman",
        "Dany Haddad",
        "Jena D. Hwang",
        "Peter Jansen",
        "Varsha Kishore",
        "Bodhisattwa Prasad Majumder",
        "Aakanksha Naik",
        "Sigal Rahamimov",
        "Kyle Richardson",
        "Amanpreet Singh",
        "Harshit Surana",
        "Aryeh Tiktinsky",
        "Rosni Vasu",
        "Guy Wiener",
        "Chloe Anastasiades",
        "Stefan Candra",
        "Jason Dunkelberger",
        "Dan Emery",
        "Rob Evans",
        "Malachi Hamada",
        "Regan Huff",
        "Rodney Kinney",
        "Matt Latzke",
        "Jaron Lochner",
        "Ruben Lozano-Aguilera",
        "Cecile Nguyen",
        "Smita Rao",
        "Amber Tanaka",
        "Brooke Vlahos",
        "Peter Clark",
        "Doug Downey",
        "Yoav Goldberg",
        "Ashish Sabharwal",
        "Daniel S. Weld"
      ],
      "abstract": "AI agents hold the potential to revolutionize scientific productivity by\nautomating literature reviews, replicating experiments, analyzing data, and\neven proposing new directions of inquiry; indeed, there are now many such\nagents, ranging from general-purpose \"deep research\" systems to specialized\nscience-specific agents, such as AI Scientist and AIGS. Rigorous evaluation of\nthese agents is critical for progress. Yet existing benchmarks fall short on\nseveral fronts: they (1) fail to provide holistic, product-informed measures of\nreal-world use cases such as science research; (2) lack reproducible agent\ntools necessary for a controlled comparison of core agentic capabilities; (3)\ndo not account for confounding variables such as model cost and tool access;\n(4) do not provide standardized interfaces for quick agent prototyping and\nevaluation; and (5) lack comprehensive baseline agents necessary to identify\ntrue advances. In response, we define principles and tooling for more\nrigorously benchmarking agents. Using these, we present AstaBench, a suite that\nprovides the first holistic measure of agentic ability to perform scientific\nresearch, comprising 2400+ problems spanning the entire scientific discovery\nprocess and multiple scientific domains, and including many problems inspired\nby actual user requests to deployed Asta agents. Our suite comes with the first\nscientific research environment with production-grade search tools that enable\ncontrolled, reproducible evaluation, better accounting for confounders.\nAlongside, we provide a comprehensive suite of nine science-optimized classes\nof Asta agents and numerous baselines. Our extensive evaluation of 57 agents\nacross 22 agent classes reveals several interesting findings, most importantly\nthat despite meaningful progress on certain individual aspects, AI remains far\nfrom solving the challenge of science research assistance.",
      "pdf_url": "http://arxiv.org/pdf/2510.21652v1",
      "published": "2025-10-24T17:10:26+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21652v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "A Dynamic Knowledge Distillation Method Based on the Gompertz Curve",
      "authors": [
        "Han Yang",
        "Guangjun Qin"
      ],
      "abstract": "This paper introduces a novel dynamic knowledge distillation framework,\nGompertz-CNN, which integrates the Gompertz growth model into the training\nprocess to address the limitations of traditional knowledge distillation.\nConventional methods often fail to capture the evolving cognitive capacity of\nstudent models, leading to suboptimal knowledge transfer. To overcome this, we\npropose a stage-aware distillation strategy that dynamically adjusts the weight\nof distillation loss based on the Gompertz curve, reflecting the student's\nlearning progression: slow initial growth, rapid mid-phase improvement, and\nlate-stage saturation. Our framework incorporates Wasserstein distance to\nmeasure feature-level discrepancies and gradient matching to align backward\npropagation behaviors between teacher and student models. These components are\nunified under a multi-loss objective, where the Gompertz curve modulates the\ninfluence of distillation losses over time. Extensive experiments on CIFAR-10\nand CIFAR-100 using various teacher-student architectures (e.g., ResNet50 and\nMobileNet_v2) demonstrate that Gompertz-CNN consistently outperforms\ntraditional distillation methods, achieving up to 8% and 4% accuracy gains on\nCIFAR-10 and CIFAR-100, respectively.",
      "pdf_url": "http://arxiv.org/pdf/2510.21649v1",
      "published": "2025-10-24T17:07:27+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21649v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "DEEDEE: Fast and Scalable Out-of-Distribution Dynamics Detection",
      "authors": [
        "Tala Aljaafari",
        "Varun Kanade",
        "Philip Torr",
        "Christian Schroeder de Witt"
      ],
      "abstract": "Deploying reinforcement learning (RL) in safety-critical settings is\nconstrained by brittleness under distribution shift. We study\nout-of-distribution (OOD) detection for RL time series and introduce DEEDEE, a\ntwo-statistic detector that revisits representation-heavy pipelines with a\nminimal alternative. DEEDEE uses only an episodewise mean and an RBF kernel\nsimilarity to a training summary, capturing complementary global and local\ndeviations. Despite its simplicity, DEEDEE matches or surpasses contemporary\ndetectors across standard RL OOD suites, delivering a 600-fold reduction in\ncompute (FLOPs / wall-time) and an average 5% absolute accuracy gain over\nstrong baselines. Conceptually, our results indicate that diverse anomaly types\noften imprint on RL trajectories through a small set of low-order statistics,\nsuggesting a compact foundation for OOD detection in complex environments.",
      "pdf_url": "http://arxiv.org/pdf/2510.21638v1",
      "published": "2025-10-24T16:51:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21638v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Few-Shot Knowledge Distillation of LLMs With Counterfactual Explanations",
      "authors": [
        "Faisal Hamman",
        "Pasan Dissanayake",
        "Yanjun Fu",
        "Sanghamitra Dutta"
      ],
      "abstract": "Knowledge distillation is a promising approach to transfer capabilities from\ncomplex teacher models to smaller, resource-efficient student models that can\nbe deployed easily, particularly in task-aware scenarios. However, existing\nmethods of task-aware distillation typically require substantial quantities of\ndata which may be unavailable or expensive to obtain in many practical\nscenarios. In this paper, we address this challenge by introducing a novel\nstrategy called Counterfactual-explanation-infused Distillation CoD for\nfew-shot task-aware knowledge distillation by systematically infusing\ncounterfactual explanations. Counterfactual explanations (CFEs) refer to inputs\nthat can flip the output prediction of the teacher model with minimum\nperturbation. Our strategy CoD leverages these CFEs to precisely map the\nteacher's decision boundary with significantly fewer samples. We provide\ntheoretical guarantees for motivating the role of CFEs in distillation, from\nboth statistical and geometric perspectives. We mathematically show that CFEs\ncan improve parameter estimation by providing more informative examples near\nthe teacher's decision boundary. We also derive geometric insights on how CFEs\neffectively act as knowledge probes, helping the students mimic the teacher's\ndecision boundaries more effectively than standard data. We perform experiments\nacross various datasets and LLMs to show that CoD outperforms standard\ndistillation approaches in few-shot regimes (as low as 8-512 samples). Notably,\nCoD only uses half of the original samples used by the baselines, paired with\ntheir corresponding CFEs and still improves performance.",
      "pdf_url": "http://arxiv.org/pdf/2510.21631v1",
      "published": "2025-10-24T16:36:34+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21631v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL",
        "cs.CY",
        "stat.ML"
      ]
    },
    {
      "title": "The Universal Landscape of Human Reasoning",
      "authors": [
        "Qiguang Chen",
        "Jinhao Liu",
        "Libo Qin",
        "Yimeng Zhang",
        "Yihao Liang",
        "Shangxu Ren",
        "Chengyu Luan",
        "Dengyun Peng",
        "Hanjing Li",
        "Jiannan Guan",
        "Zheng Yan",
        "Jiaqi Wang",
        "Mengkang Hu",
        "Yantao Du",
        "Zhi Chen",
        "Xie Chen",
        "Wanxiang Che"
      ],
      "abstract": "Understanding how information is dynamically accumulated and transformed in\nhuman reasoning has long challenged cognitive psychology, philosophy, and\nartificial intelligence. Existing accounts, from classical logic to\nprobabilistic models, illuminate aspects of output or individual modelling, but\ndo not offer a unified, quantitative description of general human reasoning\ndynamics. To solve this, we introduce Information Flow Tracking (IF-Track),\nthat uses large language models (LLMs) as probabilistic encoder to quantify\ninformation entropy and gain at each reasoning step. Through fine-grained\nanalyses across diverse tasks, our method is the first successfully models the\nuniversal landscape of human reasoning behaviors within a single metric space.\nWe show that IF-Track captures essential reasoning features, identifies\nsystematic error patterns, and characterizes individual differences. Applied to\ndiscussion of advanced psychological theory, we first reconcile single- versus\ndual-process theories in IF-Track and discover the alignment of artificial and\nhuman cognition and how LLMs reshaping human reasoning process. This approach\nestablishes a quantitative bridge between theory and measurement, offering\nmechanistic insights into the architecture of reasoning.",
      "pdf_url": "http://arxiv.org/pdf/2510.21623v1",
      "published": "2025-10-24T16:26:36+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21623v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "DeepAgent: A General Reasoning Agent with Scalable Toolsets",
      "authors": [
        "Xiaoxi Li",
        "Wenxiang Jiao",
        "Jiarui Jin",
        "Guanting Dong",
        "Jiajie Jin",
        "Yinuo Wang",
        "Hao Wang",
        "Yutao Zhu",
        "Ji-Rong Wen",
        "Yuan Lu",
        "Zhicheng Dou"
      ],
      "abstract": "Large reasoning models have demonstrated strong problem-solving abilities,\nyet real-world tasks often require external tools and long-horizon\ninteractions. Existing agent frameworks typically follow predefined workflows,\nwhich limit autonomous and global task completion. In this paper, we introduce\nDeepAgent, an end-to-end deep reasoning agent that performs autonomous\nthinking, tool discovery, and action execution within a single, coherent\nreasoning process. To address the challenges of long-horizon interactions,\nparticularly the context length explosion from multiple tool calls and the\naccumulation of interaction history, we introduce an autonomous memory folding\nmechanism that compresses past interactions into structured episodic, working,\nand tool memories, reducing error accumulation while preserving critical\ninformation. To teach general-purpose tool use efficiently and stably, we\ndevelop an end-to-end reinforcement learning strategy, namely ToolPO, that\nleverages LLM-simulated APIs and applies tool-call advantage attribution to\nassign fine-grained credit to the tool invocation tokens. Extensive experiments\non eight benchmarks, including general tool-use tasks (ToolBench, API-Bank,\nTMDB, Spotify, ToolHop) and downstream applications (ALFWorld, WebShop, GAIA,\nHLE), demonstrate that DeepAgent consistently outperforms baselines across both\nlabeled-tool and open-set tool retrieval scenarios. This work takes a step\ntoward more general and capable agents for real-world applications. The code\nand demo are available at https://github.com/RUC-NLPIR/DeepAgent.",
      "pdf_url": "http://arxiv.org/pdf/2510.21618v1",
      "published": "2025-10-24T16:24:01+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21618v1",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.IR",
        "cs.LG"
      ]
    },
    {
      "title": "Huxley-Gödel Machine: Human-Level Coding Agent Development by an Approximation of the Optimal Self-Improving Machine",
      "authors": [
        "Wenyi Wang",
        "Piotr Piękos",
        "Li Nanbo",
        "Firas Laakom",
        "Yimeng Chen",
        "Mateusz Ostaszewski",
        "Mingchen Zhuge",
        "Jürgen Schmidhuber"
      ],
      "abstract": "Recent studies operationalize self-improvement through coding agents that\nedit their own codebases. They grow a tree of self-modifications through\nexpansion strategies that favor higher software engineering benchmark\nperformance, assuming that this implies more promising subsequent\nself-modifications. However, we identify a mismatch between the agent's\nself-improvement potential (metaproductivity) and its coding benchmark\nperformance, namely the Metaproductivity-Performance Mismatch. Inspired by\nHuxley's concept of clade, we propose a metric ($\\mathrm{CMP}$) that aggregates\nthe benchmark performances of the descendants of an agent as an indicator of\nits potential for self-improvement. We show that, in our self-improving coding\nagent development setting, access to the true $\\mathrm{CMP}$ is sufficient to\nsimulate how the G\\\"odel Machine would behave under certain assumptions. We\nintroduce the Huxley-G\\\"odel Machine (HGM), which, by estimating $\\mathrm{CMP}$\nand using it as guidance, searches the tree of self-modifications. On SWE-bench\nVerified and Polyglot, HGM outperforms prior self-improving coding agent\ndevelopment methods while using less wall-clock time. Last but not least, HGM\ndemonstrates strong transfer to other coding datasets and large language\nmodels. The agent optimized by HGM on SWE-bench Verified with GPT-5-mini and\nevaluated on SWE-bench Lite with GPT-5 achieves human-level performance,\nmatching the best officially checked results of human-engineered coding agents.\nOur code is available at https://github.com/metauto-ai/HGM.",
      "pdf_url": "http://arxiv.org/pdf/2510.21614v1",
      "published": "2025-10-24T16:19:41+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21614v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Generative Correlation Manifolds: Generating Synthetic Data with Preserved Higher-Order Correlations",
      "authors": [
        "Jens E. d'Hondt",
        "Wieger R. Punter",
        "Odysseas Papapetrou"
      ],
      "abstract": "The increasing need for data privacy and the demand for robust machine\nlearning models have fueled the development of synthetic data generation\ntechniques. However, current methods often succeed in replicating simple\nsummary statistics but fail to preserve both the pairwise and higher-order\ncorrelation structure of the data that define the complex, multi-variable\ninteractions inherent in real-world systems. This limitation can lead to\nsynthetic data that is superficially realistic but fails when used for\nsophisticated modeling tasks. In this white paper, we introduce Generative\nCorrelation Manifolds (GCM), a computationally efficient method for generating\nsynthetic data. The technique uses Cholesky decomposition of a target\ncorrelation matrix to produce datasets that, by mathematical proof, preserve\nthe entire correlation structure -- from simple pairwise relationships to\nhigher-order interactions -- of the source dataset. We argue that this method\nprovides a new approach to synthetic data generation with potential\napplications in privacy-preserving data sharing, robust model training, and\nsimulation.",
      "pdf_url": "http://arxiv.org/pdf/2510.21610v1",
      "published": "2025-10-24T16:15:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21610v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Sample By Step, Optimize By Chunk: Chunk-Level GRPO For Text-to-Image Generation",
      "authors": [
        "Yifu Luo",
        "Penghui Du",
        "Bo Li",
        "Sinan Du",
        "Tiantian Zhang",
        "Yongzhe Chang",
        "Kai Wu",
        "Kun Gai",
        "Xueqian Wang"
      ],
      "abstract": "Group Relative Policy Optimization (GRPO) has shown strong potential for\nflow-matching-based text-to-image (T2I) generation, but it faces two key\nlimitations: inaccurate advantage attribution, and the neglect of temporal\ndynamics of generation. In this work, we argue that shifting the optimization\nparadigm from the step level to the chunk level can effectively alleviate these\nissues. Building on this idea, we propose Chunk-GRPO, the first chunk-level\nGRPO-based approach for T2I generation. The insight is to group consecutive\nsteps into coherent 'chunk's that capture the intrinsic temporal dynamics of\nflow matching, and to optimize policies at the chunk level. In addition, we\nintroduce an optional weighted sampling strategy to further enhance\nperformance. Extensive experiments show that ChunkGRPO achieves superior\nresults in both preference alignment and image quality, highlighting the\npromise of chunk-level optimization for GRPO-based methods.",
      "pdf_url": "http://arxiv.org/pdf/2510.21583v1",
      "published": "2025-10-24T15:50:36+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21583v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "From Polyester Girlfriends to Blind Mice: Creating the First Pragmatics Understanding Benchmarks for Slovene",
      "authors": [
        "Mojca Brglez",
        "Špela Vintar"
      ],
      "abstract": "Large language models are demonstrating increasing capabilities, excelling at\nbenchmarks once considered very difficult. As their capabilities grow, there is\na need for more challenging evaluations that go beyond surface-level linguistic\ncompetence. Namely, language competence involves not only syntax and semantics\nbut also pragmatics, i.e., understanding situational meaning as shaped by\ncontext as well as linguistic and cultural norms. To contribute to this line of\nresearch, we introduce SloPragEval and SloPragMega, the first pragmatics\nunderstanding benchmarks for Slovene that contain altogether 405\nmultiple-choice questions. We discuss the difficulties of translation, describe\nthe campaign to establish a human baseline, and report pilot evaluations with\nLLMs. Our results indicate that current models have greatly improved in\nunderstanding nuanced language but may still fail to infer implied speaker\nmeaning in non-literal utterances, especially those that are culture-specific.\nWe also observe a significant gap between proprietary and open-source models.\nFinally, we argue that benchmarks targeting nuanced language understanding and\nknowledge of the target culture must be designed with care, preferably\nconstructed from native data, and validated with human responses.",
      "pdf_url": "http://arxiv.org/pdf/2510.21575v1",
      "published": "2025-10-24T15:43:42+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21575v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Scalable Vision-Language-Action Model Pretraining for Robotic Manipulation with Real-Life Human Activity Videos",
      "authors": [
        "Qixiu Li",
        "Yu Deng",
        "Yaobo Liang",
        "Lin Luo",
        "Lei Zhou",
        "Chengtang Yao",
        "Lingqi Zeng",
        "Zhiyuan Feng",
        "Huizhi Liang",
        "Sicheng Xu",
        "Yizhong Zhang",
        "Xi Chen",
        "Hao Chen",
        "Lily Sun",
        "Dong Chen",
        "Jiaolong Yang",
        "Baining Guo"
      ],
      "abstract": "This paper presents a novel approach for pretraining robotic manipulation\nVision-Language-Action (VLA) models using a large corpus of unscripted\nreal-life video recordings of human hand activities. Treating human hand as\ndexterous robot end-effector, we show that \"in-the-wild\" egocentric human\nvideos without any annotations can be transformed into data formats fully\naligned with existing robotic V-L-A training data in terms of task granularity\nand labels. This is achieved by the development of a fully-automated holistic\nhuman activity analysis approach for arbitrary human hand videos. This approach\ncan generate atomic-level hand activity segments and their language\ndescriptions, each accompanied with framewise 3D hand motion and camera motion.\nWe process a large volume of egocentric videos and create a hand-VLA training\ndataset containing 1M episodes and 26M frames. This training data covers a wide\nrange of objects and concepts, dexterous manipulation tasks, and environment\nvariations in real life, vastly exceeding the coverage of existing robot data.\nWe design a dexterous hand VLA model architecture and pretrain the model on\nthis dataset. The model exhibits strong zero-shot capabilities on completely\nunseen real-world observations. Additionally, fine-tuning it on a small amount\nof real robot action data significantly improves task success rates and\ngeneralization to novel objects in real robotic experiments. We also\ndemonstrate the appealing scaling behavior of the model's task performance with\nrespect to pretraining data scale. We believe this work lays a solid foundation\nfor scalable VLA pretraining, advancing robots toward truly generalizable\nembodied intelligence.",
      "pdf_url": "http://arxiv.org/pdf/2510.21571v1",
      "published": "2025-10-24T15:39:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21571v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV",
        "cs.LG"
      ]
    },
    {
      "title": "Learning Neural Control Barrier Functions from Expert Demonstrations using Inverse Constraint Learning",
      "authors": [
        "Yuxuan Yang",
        "Hussein Sibai"
      ],
      "abstract": "Safety is a fundamental requirement for autonomous systems operating in\ncritical domains. Control barrier functions (CBFs) have been used to design\nsafety filters that minimally alter nominal controls for such systems to\nmaintain their safety. Learning neural CBFs has been proposed as a data-driven\nalternative for their computationally expensive optimization-based synthesis.\nHowever, it is often the case that the failure set of states that should be\navoided is non-obvious or hard to specify formally, e.g., tailgating in\nautonomous driving, while a set of expert demonstrations that achieve the task\nand avoid the failure set is easier to generate. We use ICL to train a\nconstraint function that classifies the states of the system under\nconsideration to safe, i.e., belong to a controlled forward invariant set that\nis disjoint from the unspecified failure set, and unsafe ones, i.e., belong to\nthe complement of that set. We then use that function to label a new set of\nsimulated trajectories to train our neural CBF. We empirically evaluate our\napproach in four different environments, demonstrating that it outperforms\nexisting baselines and achieves comparable performance to a neural CBF trained\nwith the same data but annotated with ground-truth safety labels.",
      "pdf_url": "http://arxiv.org/pdf/2510.21560v1",
      "published": "2025-10-24T15:20:34+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21560v1",
      "categories": [
        "cs.AI",
        "cs.RO"
      ]
    },
    {
      "title": "Co-Sight: Enhancing LLM-Based Agents via Conflict-Aware Meta-Verification and Trustworthy Reasoning with Structured Facts",
      "authors": [
        "Hongwei Zhang",
        "Ji Lu",
        "Shiqing Jiang",
        "Chenxiang Zhu",
        "Li Xie",
        "Chen Zhong",
        "Haoran Chen",
        "Yurui Zhu",
        "Yongsheng Du",
        "Yanqin Gao",
        "Lingjun Huang",
        "Baoli Wang",
        "Fang Tan",
        "Peng Zou"
      ],
      "abstract": "Long-horizon reasoning in LLM-based agents often fails not from generative\nweakness but from insufficient verification of intermediate reasoning. Co-Sight\naddresses this challenge by turning reasoning into a falsifiable and auditable\nprocess through two complementary mechanisms: Conflict-Aware Meta-Verification\n(CAMV) and Trustworthy Reasoning with Structured Facts (TRSF). CAMV\nreformulates verification as conflict identification and targeted\nfalsification, allocating computation only to disagreement hotspots among\nexpert agents rather than to full reasoning chains. This bounds verification\ncost to the number of inconsistencies and improves efficiency and reliability.\nTRSF continuously organizes, validates, and synchronizes evidence across agents\nthrough a structured facts module. By maintaining verified, traceable, and\nauditable knowledge, it ensures that all reasoning is grounded in consistent,\nsource-verified information and supports transparent verification throughout\nthe reasoning process. Together, TRSF and CAMV form a closed verification loop,\nwhere TRSF supplies structured facts and CAMV selectively falsifies or\nreinforces them, yielding transparent and trustworthy reasoning. Empirically,\nCo-Sight achieves state-of-the-art accuracy on GAIA (84.4%) and Humanity's Last\nExam (35.5%), and strong results on Chinese-SimpleQA (93.8%). Ablation studies\nconfirm that the synergy between structured factual grounding and\nconflict-aware verification drives these improvements. Co-Sight thus offers a\nscalable paradigm for reliable long-horizon reasoning in LLM-based agents. Code\nis available at\nhttps://github.com/ZTE-AICloud/Co-Sight/tree/cosight2.0_benchmarks.",
      "pdf_url": "http://arxiv.org/pdf/2510.21557v1",
      "published": "2025-10-24T15:14:14+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21557v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Human and AI Trust: Trust Attitude Measurement Instrument",
      "authors": [
        "Retno Larasati"
      ],
      "abstract": "With the current progress of Artificial Intelligence (AI) technology and its\nincreasingly broader applications, trust is seen as a required criterion for AI\nusage, acceptance, and deployment. A robust measurement instrument is essential\nto correctly evaluate trust from a human-centered perspective. This paper\ndescribes the development and validation process of a trust measure instrument,\nwhich follows psychometric principles, and consists of a 16-items trust scale.\nThe instrument was built explicitly for research in human-AI interaction to\nmeasure trust attitudes towards AI systems from layperson (non-expert)\nperspective. The use-case we used to develop the scale was in the context of AI\nmedical support systems (specifically cancer/health prediction). The scale\ndevelopment (Measurement Item Development) and validation (Measurement Item\nEvaluation) involved six research stages: item development, item evaluation,\nsurvey administration, test of dimensionality, test of reliability, and test of\nvalidity. The results of the six-stages evaluation show that the proposed trust\nmeasurement instrument is empirically reliable and valid for systematically\nmeasuring and comparing non-experts' trust in AI Medical Support Systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.21535v1",
      "published": "2025-10-24T15:01:06+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21535v1",
      "categories": [
        "cs.HC",
        "cs.AI"
      ]
    },
    {
      "title": "EU-Agent-Bench: Measuring Illegal Behavior of LLM Agents Under EU Law",
      "authors": [
        "Ilija Lichkovski",
        "Alexander Müller",
        "Mariam Ibrahim",
        "Tiwai Mhundwa"
      ],
      "abstract": "Large language models (LLMs) are increasingly deployed as agents in various\ncontexts by providing tools at their disposal. However, LLM agents can exhibit\nunpredictable behaviors, including taking undesirable and/or unsafe actions. In\norder to measure the latent propensity of LLM agents for taking illegal actions\nunder an EU legislative context, we introduce EU-Agent-Bench, a verifiable\nhuman-curated benchmark that evaluates an agent's alignment with EU legal norms\nin situations where benign user inputs could lead to unlawful actions. Our\nbenchmark spans scenarios across several categories, including data protection,\nbias/discrimination, and scientific integrity, with each user request allowing\nfor both compliant and non-compliant execution of the requested actions.\nComparing the model's function calls against a rubric exhaustively supported by\ncitations of the relevant legislature, we evaluate the legal compliance of\nfrontier LLMs, and furthermore investigate the compliance effect of providing\nthe relevant legislative excerpts in the agent's system prompt along with\nexplicit instructions to comply. We release a public preview set for the\nresearch community, while holding out a private test set to prevent data\ncontamination in evaluating upcoming models. We encourage future work extending\nagentic safety benchmarks to different legal jurisdictions and to multi-turn\nand multilingual interactions. We release our code on\n\\href{https://github.com/ilijalichkovski/eu-agent-bench}{this URL}.",
      "pdf_url": "http://arxiv.org/pdf/2510.21524v1",
      "published": "2025-10-24T14:48:10+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21524v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Enhancing Social Robots through Resilient AI",
      "authors": [
        "Domenico Palmisano",
        "Giuseppe Palestra",
        "Berardina Nadja De Carolis"
      ],
      "abstract": "As artificial intelligence continues to advance and becomes more integrated\ninto sensitive areas like healthcare, education, and everyday life, it's\ncrucial for these systems to be both resilient and robust. This paper shows how\nresilience is a fundamental characteristic of social robots, which, through it,\nensure trust in the robot itself-an essential element especially when operating\nin contexts with elderly people, who often have low trust in these systems.\nResilience is therefore the ability to operate under adverse or stressful\nconditions, even when degraded or weakened, while maintaining essential\noperational capabilities.",
      "pdf_url": "http://arxiv.org/pdf/2510.21469v1",
      "published": "2025-10-24T13:55:45+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21469v1",
      "categories": [
        "cs.RO",
        "cs.AI"
      ]
    },
    {
      "title": "Multi-Task Vehicle Routing Solver via Mixture of Specialized Experts under State-Decomposable MDP",
      "authors": [
        "Yuxin Pan",
        "Zhiguang Cao",
        "Chengyang Gu",
        "Liu Liu",
        "Peilin Zhao",
        "Yize Chen",
        "Fangzhen Lin"
      ],
      "abstract": "Existing neural methods for multi-task vehicle routing problems (VRPs)\ntypically learn unified solvers to handle multiple constraints simultaneously.\nHowever, they often underutilize the compositional structure of VRP variants,\neach derivable from a common set of basis VRP variants. This critical oversight\ncauses unified solvers to miss out the potential benefits of basis solvers,\neach specialized for a basis VRP variant. To overcome this limitation, we\npropose a framework that enables unified solvers to perceive the\nshared-component nature across VRP variants by proactively reusing basis\nsolvers, while mitigating the exponential growth of trained neural solvers.\nSpecifically, we introduce a State-Decomposable MDP (SDMDP) that reformulates\nVRPs by expressing the state space as the Cartesian product of basis state\nspaces associated with basis VRP variants. More crucially, this formulation\ninherently yields the optimal basis policy for each basis VRP variant.\nFurthermore, a Latent Space-based SDMDP extension is developed by incorporating\nboth the optimal basis policies and a learnable mixture function to enable the\npolicy reuse in the latent space. Under mild assumptions, this extension\nprovably recovers the optimal unified policy of SDMDP through the mixture\nfunction that computes the state embedding as a mapping from the basis state\nembeddings generated by optimal basis policies. For practical implementation,\nwe introduce the Mixture-of-Specialized-Experts Solver (MoSES), which realizes\nbasis policies through specialized Low-Rank Adaptation (LoRA) experts, and\nimplements the mixture function via an adaptive gating mechanism. Extensive\nexperiments conducted across VRP variants showcase the superiority of MoSES\nover prior methods.",
      "pdf_url": "http://arxiv.org/pdf/2510.21453v1",
      "published": "2025-10-24T13:31:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21453v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "PhysWorld: From Real Videos to World Models of Deformable Objects via Physics-Aware Demonstration Synthesis",
      "authors": [
        "Yu Yang",
        "Zhilu Zhang",
        "Xiang Zhang",
        "Yihan Zeng",
        "Hui Li",
        "Wangmeng Zuo"
      ],
      "abstract": "Interactive world models that simulate object dynamics are crucial for\nrobotics, VR, and AR. However, it remains a significant challenge to learn\nphysics-consistent dynamics models from limited real-world video data,\nespecially for deformable objects with spatially-varying physical properties.\nTo overcome the challenge of data scarcity, we propose PhysWorld, a novel\nframework that utilizes a simulator to synthesize physically plausible and\ndiverse demonstrations to learn efficient world models. Specifically, we first\nconstruct a physics-consistent digital twin within MPM simulator via\nconstitutive model selection and global-to-local optimization of physical\nproperties. Subsequently, we apply part-aware perturbations to the physical\nproperties and generate various motion patterns for the digital twin,\nsynthesizing extensive and diverse demonstrations. Finally, using these\ndemonstrations, we train a lightweight GNN-based world model that is embedded\nwith physical properties. The real video can be used to further refine the\nphysical properties. PhysWorld achieves accurate and fast future predictions\nfor various deformable objects, and also generalizes well to novel\ninteractions. Experiments show that PhysWorld has competitive performance while\nenabling inference speeds 47 times faster than the recent state-of-the-art\nmethod, i.e., PhysTwin.",
      "pdf_url": "http://arxiv.org/pdf/2510.21447v1",
      "published": "2025-10-24T13:25:39+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21447v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.RO"
      ]
    },
    {
      "title": "REMONI: An Autonomous System Integrating Wearables and Multimodal Large Language Models for Enhanced Remote Health Monitoring",
      "authors": [
        "Thanh Cong Ho",
        "Farah Kharrat",
        "Abderrazek Abid",
        "Fakhri Karray"
      ],
      "abstract": "With the widespread adoption of wearable devices in our daily lives, the\ndemand and appeal for remote patient monitoring have significantly increased.\nMost research in this field has concentrated on collecting sensor data,\nvisualizing it, and analyzing it to detect anomalies in specific diseases such\nas diabetes, heart disease and depression. However, this domain has a notable\ngap in the aspect of human-machine interaction. This paper proposes REMONI, an\nautonomous REmote health MONItoring system that integrates multimodal large\nlanguage models (MLLMs), the Internet of Things (IoT), and wearable devices.\nThe system automatically and continuously collects vital signs, accelerometer\ndata from a special wearable (such as a smartwatch), and visual data in patient\nvideo clips collected from cameras. This data is processed by an anomaly\ndetection module, which includes a fall detection model and algorithms to\nidentify and alert caregivers of the patient's emergency conditions. A\ndistinctive feature of our proposed system is the natural language processing\ncomponent, developed with MLLMs capable of detecting and recognizing a\npatient's activity and emotion while responding to healthcare worker's\ninquiries. Additionally, prompt engineering is employed to integrate all\npatient information seamlessly. As a result, doctors and nurses can access\nreal-time vital signs and the patient's current state and mood by interacting\nwith an intelligent agent through a user-friendly web application. Our\nexperiments demonstrate that our system is implementable and scalable for\nreal-life scenarios, potentially reducing the workload of medical professionals\nand healthcare costs. A full-fledged prototype illustrating the functionalities\nof the system has been developed and being tested to demonstrate the robustness\nof its various capabilities.",
      "pdf_url": "http://arxiv.org/pdf/2510.21445v1",
      "published": "2025-10-24T13:23:38+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21445v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CV",
        "cs.LG"
      ]
    },
    {
      "title": "Does Model Size Matter? A Comparison of Small and Large Language Models for Requirements Classification",
      "authors": [
        "Mohammad Amin Zadenoori",
        "Vincenzo De Martino",
        "Jacek Dabrowski",
        "Xavier Franch",
        "Alessio Ferrari"
      ],
      "abstract": "[Context and motivation] Large language models (LLMs) show notable results in\nnatural language processing (NLP) tasks for requirements engineering (RE).\nHowever, their use is compromised by high computational cost, data sharing\nrisks, and dependence on external services. In contrast, small language models\n(SLMs) offer a lightweight, locally deployable alternative. [Question/problem]\nIt remains unclear how well SLMs perform compared to LLMs in RE tasks in terms\nof accuracy. [Results] Our preliminary study compares eight models, including\nthree LLMs and five SLMs, on requirements classification tasks using the\nPROMISE, PROMISE Reclass, and SecReq datasets. Our results show that although\nLLMs achieve an average F1 score of 2% higher than SLMs, this difference is not\nstatistically significant. SLMs almost reach LLMs performance across all\ndatasets and even outperform them in recall on the PROMISE Reclass dataset,\ndespite being up to 300 times smaller. We also found that dataset\ncharacteristics play a more significant role in performance than model size.\n[Contribution] Our study contributes with evidence that SLMs are a valid\nalternative to LLMs for requirements classification, offering advantages in\nprivacy, cost, and local deployability.",
      "pdf_url": "http://arxiv.org/pdf/2510.21443v1",
      "published": "2025-10-24T13:20:30+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21443v1",
      "categories": [
        "cs.SE",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "AutoOpt: A Dataset and a Unified Framework for Automating Optimization Problem Solving",
      "authors": [
        "Ankur Sinha",
        "Shobhit Arora",
        "Dhaval Pujara"
      ],
      "abstract": "This study presents AutoOpt-11k, a unique image dataset of over 11,000\nhandwritten and printed mathematical optimization models corresponding to\nsingle-objective, multi-objective, multi-level, and stochastic optimization\nproblems exhibiting various types of complexities such as non-linearity,\nnon-convexity, non-differentiability, discontinuity, and high-dimensionality.\nThe labels consist of the LaTeX representation for all the images and modeling\nlanguage representation for a subset of images. The dataset is created by 25\nexperts following ethical data creation guidelines and verified in two-phases\nto avoid errors. Further, we develop AutoOpt framework, a machine learning\nbased automated approach for solving optimization problems, where the user just\nneeds to provide an image of the formulation and AutoOpt solves it efficiently\nwithout any further human intervention. AutoOpt framework consists of three\nModules: (i) M1 (Image_to_Text)- a deep learning model performs the\nMathematical Expression Recognition (MER) task to generate the LaTeX code\ncorresponding to the optimization formulation in image; (ii) M2 (Text_to_Text)-\na small-scale fine-tuned LLM generates the PYOMO script (optimization modeling\nlanguage) from LaTeX code; (iii) M3 (Optimization)- a Bilevel Optimization\nbased Decomposition (BOBD) method solves the optimization formulation described\nin the PYOMO script. We use AutoOpt-11k dataset for training and testing of\ndeep learning models employed in AutoOpt. The deep learning model for MER task\n(M1) outperforms ChatGPT, Gemini and Nougat on BLEU score metric. BOBD method\n(M3), which is a hybrid approach, yields better results on complex test\nproblems compared to common approaches, like interior-point algorithm and\ngenetic algorithm.",
      "pdf_url": "http://arxiv.org/pdf/2510.21436v1",
      "published": "2025-10-24T13:14:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21436v1",
      "categories": [
        "cs.AI",
        "I.4"
      ]
    },
    {
      "title": "Advancing Symbolic Integration in Large Language Models: Beyond Conventional Neurosymbolic AI",
      "authors": [
        "Maneeha Rani",
        "Bhupesh Kumar Mishra",
        "Dhavalkumar Thakker"
      ],
      "abstract": "LLMs have demonstrated highly effective learning, human-like response\ngeneration,and decision-making capabilities in high-risk sectors. However,\nthese models remain black boxes because they struggle to ensure transparency in\nresponses. The literature has explored numerous approaches to address\ntransparency challenges in LLMs, including Neurosymbolic AI (NeSy AI). NeSy AI\napproaches were primarily developed for conventional neural networks and are\nnot well-suited to the unique features of LLMs. Consequently, there is a\nlimited systematic understanding of how symbolic AI can be effectively\nintegrated into LLMs. This paper aims to address this gap by first reviewing\nestablished NeSy AI methods and then proposing a novel taxonomy of symbolic\nintegration in LLMs, along with a roadmap to merge symbolic techniques with\nLLMs. The roadmap introduces a new categorisation framework across four\ndimensions by organising existing literature within these categories. These\ninclude symbolic integration across various stages of LLM, coupling mechanisms,\narchitectural paradigms, as well as algorithmic and application-level\nperspectives. The paper thoroughly identifies current benchmarks, cutting-edge\nadvancements, and critical gaps within the field to propose a roadmap for\nfuture research. By highlighting the latest developments and notable gaps in\nthe literature, it offers practical insights for implementing frameworks for\nsymbolic integration into LLMs to enhance transparency.",
      "pdf_url": "http://arxiv.org/pdf/2510.21425v1",
      "published": "2025-10-24T13:05:50+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21425v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Vision Language Models for Dynamic Human Activity Recognition in Healthcare Settings",
      "authors": [
        "Abderrazek Abid",
        "Thanh-Cong Ho",
        "Fakhri Karray"
      ],
      "abstract": "As generative AI continues to evolve, Vision Language Models (VLMs) have\nemerged as promising tools in various healthcare applications. One area that\nremains relatively underexplored is their use in human activity recognition\n(HAR) for remote health monitoring. VLMs offer notable strengths, including\ngreater flexibility and the ability to overcome some of the constraints of\ntraditional deep learning models. However, a key challenge in applying VLMs to\nHAR lies in the difficulty of evaluating their dynamic and often\nnon-deterministic outputs. To address this gap, we introduce a descriptive\ncaption data set and propose comprehensive evaluation methods to evaluate VLMs\nin HAR. Through comparative experiments with state-of-the-art deep learning\nmodels, our findings demonstrate that VLMs achieve comparable performance and,\nin some cases, even surpass conventional approaches in terms of accuracy. This\nwork contributes a strong benchmark and opens new possibilities for the\nintegration of VLMs into intelligent healthcare systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.21424v1",
      "published": "2025-10-24T13:04:13+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21424v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CV",
        "cs.LG"
      ]
    },
    {
      "title": "DreamerV3-XP: Optimizing exploration through uncertainty estimation",
      "authors": [
        "Lukas Bierling",
        "Davide Pasero",
        "Jan-Henrik Bertrand",
        "Kiki Van Gerwen"
      ],
      "abstract": "We introduce DreamerV3-XP, an extension of DreamerV3 that improves\nexploration and learning efficiency. This includes (i) a prioritized replay\nbuffer, scoring trajectories by return, reconstruction loss, and value error\nand (ii) an intrinsic reward based on disagreement over predicted environment\nrewards from an ensemble of world models. DreamerV3-XP is evaluated on a subset\nof Atari100k and DeepMind Control Visual Benchmark tasks, confirming the\noriginal DreamerV3 results and showing that our extensions lead to faster\nlearning and lower dynamics model loss, particularly in sparse-reward settings.",
      "pdf_url": "http://arxiv.org/pdf/2510.21418v1",
      "published": "2025-10-24T12:58:27+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21418v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Large Language Models as Model Organisms for Human Associative Learning",
      "authors": [
        "Camila Kolling",
        "Vy Ai Vo",
        "Mariya Toneva"
      ],
      "abstract": "Associative learning--forming links between co-occurring items--is\nfundamental to human cognition, reshaping internal representations in complex\nways. Testing hypotheses on how representational changes occur in biological\nsystems is challenging, but large language models (LLMs) offer a scalable\nalternative. Building on LLMs' in-context learning, we adapt a cognitive\nneuroscience associative learning paradigm and investigate how representations\nevolve across six models. Our initial findings reveal a non-monotonic pattern\nconsistent with the Non-Monotonic Plasticity Hypothesis, with moderately\nsimilar items differentiating after learning. Leveraging the controllability of\nLLMs, we further show that this differentiation is modulated by the overlap of\nassociated items with the broader vocabulary--a factor we term vocabulary\ninterference, capturing how new associations compete with prior knowledge. We\nfind that higher vocabulary interference amplifies differentiation, suggesting\nthat representational change is influenced by both item similarity and global\ncompetition. Our findings position LLMs not only as powerful tools for studying\nrepresentational dynamics in human-like learning systems, but also as\naccessible and general computational models for generating new hypotheses about\nthe principles underlying memory reorganization in the brain.",
      "pdf_url": "http://arxiv.org/pdf/2510.21408v1",
      "published": "2025-10-24T12:52:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21408v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "REvolution: An Evolutionary Framework for RTL Generation driven by Large Language Models",
      "authors": [
        "Kyungjun Min",
        "Kyumin Cho",
        "Junhwan Jang",
        "Seokhyeong Kang"
      ],
      "abstract": "Large Language Models (LLMs) are used for Register-Transfer Level (RTL) code\ngeneration, but they face two main challenges: functional correctness and\nPower, Performance, and Area (PPA) optimization. Iterative, feedback-based\nmethods partially address these, but they are limited to local search,\nhindering the discovery of a global optimum. This paper introduces REvolution,\na framework that combines Evolutionary Computation (EC) with LLMs for automatic\nRTL generation and optimization. REvolution evolves a population of candidates\nin parallel, each defined by a design strategy, RTL implementation, and\nevaluation feedback. The framework includes a dual-population algorithm that\ndivides candidates into Fail and Success groups for bug fixing and PPA\noptimization, respectively. An adaptive mechanism further improves search\nefficiency by dynamically adjusting the selection probability of each prompt\nstrategy according to its success rate. Experiments on the VerilogEval and\nRTLLM benchmarks show that REvolution increased the initial pass rate of\nvarious LLMs by up to 24.0 percentage points. The DeepSeek-V3 model achieved a\nfinal pass rate of 95.5\\%, comparable to state-of-the-art results, without the\nneed for separate training or domain-specific tools. Additionally, the\ngenerated RTL designs showed significant PPA improvements over reference\ndesigns. This work introduces a new RTL design approach by combining LLMs'\ngenerative capabilities with EC's broad search power, overcoming the\nlocal-search limitations of previous methods.",
      "pdf_url": "http://arxiv.org/pdf/2510.21407v1",
      "published": "2025-10-24T12:50:35+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21407v1",
      "categories": [
        "cs.NE",
        "cs.AI",
        "cs.SE"
      ]
    },
    {
      "title": "Boosting Accuracy and Efficiency of Budget Forcing in LLMs via Reinforcement Learning for Mathematical Reasoning",
      "authors": [
        "Ravindra Aribowo Tarunokusumo",
        "Rafael Fernandes Cunha"
      ],
      "abstract": "Test-time scaling methods have seen a rapid increase in popularity for its\ncomputational efficiency and parameter-independent training to improve\nreasoning performance on Large Language Models. One such method is called\nbudget forcing, a decoding intervention strategy which allocates extra compute\nbudget for thinking and elicits the inherent self-correcting behavior of the\nmodel. However, this relies on supervised fine-tuning (SFT) on long-context\nreasoning traces which causes performance degradation on smaller models due to\nverbose responses. For this reason, we offer a framework integrating\nreinforcement learning (RL) to improve token efficiency and boost the\nperformance of a 1.5B model for mathematical reasoning. We demonstrate this\nusing only 1.5K training samples and found that our SFT+RL model performed\nbetter on the GSM8K dataset with varying compute budgets. Our main findings\nshowed an overall higher accuracy while significantly reducing its token usage\nby over 40% compared to the SFT model, revealing how RL can recover the losses\ndue to long-context training and altogether improving performance in\nmathematical reasoning.",
      "pdf_url": "http://arxiv.org/pdf/2510.21398v1",
      "published": "2025-10-24T12:39:15+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21398v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Assessing the Real-World Utility of Explainable AI for Arousal Diagnostics: An Application-Grounded User Study",
      "authors": [
        "Stefan Kraft",
        "Andreas Theissler",
        "Vera Wienhausen-Wilke",
        "Gjergji Kasneci",
        "Hendrik Lensch"
      ],
      "abstract": "Artificial intelligence (AI) systems increasingly match or surpass human\nexperts in biomedical signal interpretation. However, their effective\nintegration into clinical practice requires more than high predictive accuracy.\nClinicians must discern \\textit{when} and \\textit{why} to trust algorithmic\nrecommendations. This work presents an application-grounded user study with\neight professional sleep medicine practitioners, who score nocturnal arousal\nevents in polysomnographic data under three conditions: (i) manual scoring,\n(ii) black-box (BB) AI assistance, and (iii) transparent white-box (WB) AI\nassistance. Assistance is provided either from the \\textit{start} of scoring or\nas a post-hoc quality-control (\\textit{QC}) review. We systematically evaluate\nhow the type and timing of assistance influence event-level and clinically most\nrelevant count-based performance, time requirements, and user experience. When\nevaluated against the clinical standard used to train the AI, both AI and\nhuman-AI teams significantly outperform unaided experts, with collaboration\nalso reducing inter-rater variability. Notably, transparent AI assistance\napplied as a targeted QC step yields median event-level performance\nimprovements of approximately 30\\% over black-box assistance, and QC timing\nfurther enhances count-based outcomes. While WB and QC approaches increase the\ntime required for scoring, start-time assistance is faster and preferred by\nmost participants. Participants overwhelmingly favor transparency, with seven\nout of eight expressing willingness to adopt the system with minor or no\nmodifications. In summary, strategically timed transparent AI assistance\neffectively balances accuracy and clinical efficiency, providing a promising\npathway toward trustworthy AI integration and user acceptance in clinical\nworkflows.",
      "pdf_url": "http://arxiv.org/pdf/2510.21389v1",
      "published": "2025-10-24T12:23:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21389v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.HC"
      ]
    },
    {
      "title": "Compressing Quaternion Convolutional Neural Networks for Audio Classification",
      "authors": [
        "Arshdeep Singh",
        "Vinayak Abrol",
        "Mark D. Plumbley"
      ],
      "abstract": "Conventional Convolutional Neural Networks (CNNs) in the real domain have\nbeen widely used for audio classification. However, their convolution\noperations process multi-channel inputs independently, limiting the ability to\ncapture correlations among channels. This can lead to suboptimal feature\nlearning, particularly for complex audio patterns such as multi-channel\nspectrogram representations. Quaternion Convolutional Neural Networks (QCNNs)\naddress this limitation by employing quaternion algebra to jointly capture\ninter-channel dependencies, enabling more compact models with fewer learnable\nparameters while better exploiting the multi-dimensional nature of audio\nsignals. However, QCNNs exhibit higher computational complexity due to the\noverhead of quaternion operations, resulting in increased inference latency and\nreduced efficiency compared to conventional CNNs, posing challenges for\ndeployment on resource-constrained platforms. To address this challenge, this\nstudy explores knowledge distillation (KD) and pruning, to reduce the\ncomputational complexity of QCNNs while maintaining performance. Our\nexperiments on audio classification reveal that pruning QCNNs achieves similar\nor superior performance compared to KD while requiring less computational\neffort. Compared to conventional CNNs and Transformer-based architectures,\npruned QCNNs achieve competitive performance with a reduced learnable parameter\ncount and computational complexity. On the AudioSet dataset, pruned QCNNs\nreduce computational cost by 50\\% and parameter count by 80\\%, while\nmaintaining performance comparable to the conventional CNNs. Furthermore,\npruned QCNNs generalize well across multiple audio classification benchmarks,\nincluding GTZAN for music genre recognition, ESC-50 for environmental sound\nclassification and RAVDESS for speech emotion recognition.",
      "pdf_url": "http://arxiv.org/pdf/2510.21388v1",
      "published": "2025-10-24T12:19:19+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21388v1",
      "categories": [
        "eess.AS",
        "cs.AI",
        "cs.SD",
        "eess.SP"
      ]
    },
    {
      "title": "HIKMA: Human-Inspired Knowledge by Machine Agents through a Multi-Agent Framework for Semi-Autonomous Scientific Conferences",
      "authors": [
        "Zain Ul Abideen Tariq",
        "Mahmood Al-Zubaidi",
        "Uzair Shah",
        "Marco Agus",
        "Mowafa Househ"
      ],
      "abstract": "HIKMA Semi-Autonomous Conference is the first experiment in reimagining\nscholarly communication through an end-to-end integration of artificial\nintelligence into the academic publishing and presentation pipeline. This paper\npresents the design, implementation, and evaluation of the HIKMA framework,\nwhich includes AI dataset curation, AI-based manuscript generation, AI-assisted\npeer review, AI-driven revision, AI conference presentation, and AI archival\ndissemination. By combining language models, structured research workflows, and\ndomain safeguards, HIKMA shows how AI can support - not replace traditional\nscholarly practices while maintaining intellectual property protection,\ntransparency, and integrity. The conference functions as a testbed and proof of\nconcept, providing insights into the opportunities and challenges of AI-enabled\nscholarship. It also examines questions about AI authorship, accountability,\nand the role of human-AI collaboration in research.",
      "pdf_url": "http://arxiv.org/pdf/2510.21370v1",
      "published": "2025-10-24T11:52:24+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21370v1",
      "categories": [
        "cs.MA",
        "cs.AI",
        "cs.CL",
        "cs.DL"
      ]
    },
    {
      "title": "Patient-specific AI for generation of 3D dosimetry imaging from two 2D-planar measurements",
      "authors": [
        "Alejandro Lopez-Montes",
        "Robert Seifert",
        "Astrid Delker",
        "Guido Boening",
        "Jiahui Wang",
        "Christoph Clement",
        "Ali Afshar-Oromieh",
        "Axel Rominger",
        "Kuangyu Shi"
      ],
      "abstract": "In this work we explored the use of patient specific reinforced learning to\ngenerate 3D activity maps from two 2D planar images (anterior and posterior).\nThe solution of this problem remains unachievable using conventional\nmethodologies and is of particular interest for dosimetry in nuclear medicine\nwhere approaches for post-therapy distribution of radiopharmaceuticals such as\n177Lu-PSMA are typically done via either expensive and long 3D SPECT\nacquisitions or fast, yet only 2D, planar scintigraphy. Being able to generate\n3D activity maps from planar scintigraphy opens the gate for new dosimetry\napplications removing the need for SPECT and facilitating multi-time point\ndosimetry studies. Our solution comprises the generation of a patient specific\ndataset with possible 3D uptake maps of the radiopharmaceuticals withing the\nanatomy of the individual followed by an AI approach (we explored both the use\nof 3DUnet and diffusion models) able to generate 3D activity maps from 2D\nplanar images. We have validated our method both in simulation and real planar\nacquisitions. We observed enhanced results using patient specific reinforcement\nlearning (~20% reduction on MAE and ~5% increase in SSIM) and better organ\ndelineation and patient anatomy especially when combining diffusion models with\npatient specific training yielding a SSIM=0.89 compared to the ground truth for\nsimulations and 0.73 when compared to a SPECT acquisition performed half an\nhour after the planar. We believe that our methodology can set a change of\nparadigm for nuclear medicine dosimetry allowing for 3D quantification using\nonly planar scintigraphy without the need of expensive and time-consuming SPECT\nleveraging the pre-therapy information of the patients.",
      "pdf_url": "http://arxiv.org/pdf/2510.21362v1",
      "published": "2025-10-24T11:46:51+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21362v1",
      "categories": [
        "physics.med-ph",
        "cs.AI"
      ]
    },
    {
      "title": "Gaze-VLM:Bridging Gaze and VLMs through Attention Regularization for Egocentric Understanding",
      "authors": [
        "Anupam Pani",
        "Yanchao Yang"
      ],
      "abstract": "Eye gaze offers valuable cues about attention, short-term intent, and future\nactions, making it a powerful signal for modeling egocentric behavior. In this\nwork, we propose a gaze-regularized framework that enhances VLMs for two key\negocentric understanding tasks: fine-grained future event prediction and\ncurrent activity understanding. Unlike prior approaches that rely solely on\nvisual inputs or use gaze as an auxiliary input signal , our method uses gaze\nonly during training. We introduce a gaze-regularized attention mechanism that\naligns model focus with human visual gaze. This design is flexible and modular,\nallowing it to generalize across multiple VLM architectures that utilize\nattention. Experimental results show that our approach improves semantic\nprediction scores by up to 11 for future event prediction and around 7 for\ncurrent activity understanding, compared to the corresponding baseline models\ntrained without gaze regularization. These results highlight the value of\ngaze-guided training in improving the accuracy and robustness of egocentric\nVLMs. Overall, this work establishes a foundation for using human gaze to\nenhance the predictive capabilities of VLMs in real-world scenarios like\nassistive robots and human-machine collaboration. Code and additional\ninformation is available at: https://github.com/anupampani/Gaze-VLM",
      "pdf_url": "http://arxiv.org/pdf/2510.21356v1",
      "published": "2025-10-24T11:33:03+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21356v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "CT-CLIP: A Multi-modal Fusion Framework for Robust Apple Leaf Disease Recognition in Complex Environments",
      "authors": [
        "Lemin Liu",
        "Fangchao Hu",
        "Honghua Jiang",
        "Yaru Chen",
        "Limin Liu",
        "Yongliang Qiao"
      ],
      "abstract": "In complex orchard environments, the phenotypic heterogeneity of different\napple leaf diseases, characterized by significant variation among lesions,\nposes a challenge to traditional multi-scale feature fusion methods. These\nmethods only integrate multi-layer features extracted by convolutional neural\nnetworks (CNNs) and fail to adequately account for the relationships between\nlocal and global features. Therefore, this study proposes a multi-branch\nrecognition framework named CNN-Transformer-CLIP (CT-CLIP). The framework\nsynergistically employs a CNN to extract local lesion detail features and a\nVision Transformer to capture global structural relationships. An Adaptive\nFeature Fusion Module (AFFM) then dynamically fuses these features, achieving\noptimal coupling of local and global information and effectively addressing the\ndiversity in lesion morphology and distribution. Additionally, to mitigate\ninterference from complex backgrounds and significantly enhance recognition\naccuracy under few-shot conditions, this study proposes a multimodal image-text\nlearning approach. By leveraging pre-trained CLIP weights, it achieves deep\nalignment between visual features and disease semantic descriptions.\nExperimental results show that CT-CLIP achieves accuracies of 97.38% and 96.12%\non a publicly available apple disease and a self-built dataset, outperforming\nseveral baseline methods. The proposed CT-CLIP demonstrates strong capabilities\nin recognizing agricultural diseases, significantly enhances identification\naccuracy under complex environmental conditions, provides an innovative and\npractical solution for automated disease recognition in agricultural\napplications.",
      "pdf_url": "http://arxiv.org/pdf/2510.21346v1",
      "published": "2025-10-24T11:23:47+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21346v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "$α$-LoRA: Effective Fine-Tuning via Base Model Rescaling",
      "authors": [
        "Aymane El Firdoussi",
        "El Mahdi Chayti",
        "Mohamed El Amine Seddik",
        "Martin Jaggi"
      ],
      "abstract": "Fine-tuning has proven to be highly effective in adapting pre-trained models\nto perform better on new desired tasks with minimal data samples. Among the\nmost widely used approaches are reparameterization methods, which update a\ntarget module by augmenting its frozen weight matrix with an additional\ntrainable weight matrix. The most prominent example is Low Rank Adaption\n(LoRA), which gained significant attention in recent years. In this paper, we\nintroduce a new class of reparameterization methods for transfer learning,\ndesigned to enhance the generalization ability of fine-tuned models. We\nestablish the effectiveness of our approach in a high-dimensional binary\nclassification setting using tools from Random Matrix Theory, and further\nvalidate our theoretical findings through more realistic experiments, such as\nfine-tuning LLMs.",
      "pdf_url": "http://arxiv.org/pdf/2510.21345v1",
      "published": "2025-10-24T11:19:33+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21345v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "World-POI: Global Point-of-Interest Data Enriched from Foursquare and OpenStreetMap as Tabular and Graph Data",
      "authors": [
        "Hossein Amiri",
        "Mohammad Hashemi",
        "Andreas Züfle"
      ],
      "abstract": "Recently, Foursquare released a global dataset with more than 100 million\npoints of interest (POIs), each representing a real-world business on its\nplatform. However, many entries lack complete metadata such as addresses or\ncategories, and some correspond to non-existent or fictional locations. In\ncontrast, OpenStreetMap (OSM) offers a rich, user-contributed POI dataset with\ndetailed and frequently updated metadata, though it does not formally verify\nwhether a POI represents an actual business. In this data paper, we present a\nmethodology that integrates the strengths of both datasets: Foursquare as a\ncomprehensive baseline of commercial POIs and OSM as a source of enriched\nmetadata. The combined dataset totals approximately 1 TB. While this full\nversion is not publicly released, we provide filtered releases with adjustable\nthresholds that reduce storage needs and make the data practical to download\nand use across domains. We also provide step-by-step instructions to reproduce\nthe full 631 GB build. Record linkage is achieved by computing name similarity\nscores and spatial distances between Foursquare and OSM POIs. These measures\nidentify and retain high-confidence matches that correspond to real businesses\nin Foursquare, have representations in OSM, and show strong name similarity.\nFinally, we use this filtered dataset to construct a graph-based representation\nof POIs enriched with attributes from both sources, enabling advanced spatial\nanalyses and a range of downstream applications.",
      "pdf_url": "http://arxiv.org/pdf/2510.21342v1",
      "published": "2025-10-24T11:12:41+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21342v1",
      "categories": [
        "cs.DB",
        "cs.AI",
        "cs.CG",
        "cs.CY",
        "cs.SI"
      ]
    },
    {
      "title": "Magellan: Guided MCTS for Latent Space Exploration and Novelty Generation",
      "authors": [
        "Lufan Chang"
      ],
      "abstract": "Large Language Models (LLMs) often struggle with generating truly innovative\nideas, typically defaulting to high-probability, familiar concepts within their\ntraining data's \"gravity wells.\" While advanced search-based methods like Tree\nof Thoughts (ToT) attempt to mitigate this, they are fundamentally limited by\ntheir reliance on unprincipled, inconsistent self-evaluation heuristics to\nguide exploration. To address this gap, we introduce \\textbf{Magellan}, a novel\nframework that reframes creative generation as a principled, guided exploration\nof an LLM's latent conceptual space. At its core, Magellan employs Monte Carlo\nTree Search (MCTS) governed by a hierarchical guidance system. For long-range\ndirection, a \"semantic compass\" vector, formulated via orthogonal projection,\nsteers the search towards relevant novelty. For local, step-by-step decisions,\na landscape-aware value function replaces flawed self-evaluation with an\nexplicit reward structure that balances intrinsic coherence, extrinsic novelty,\nand narrative progress. Extensive experiments demonstrate that Magellan\nsignificantly outperforms strong baselines, including ReAct and ToT, in\ngenerating scientific ideas with superior plausibility and innovation. Our work\nshows that for creative discovery, a principled, guided search is more\neffective than unconstrained agency, paving the way for LLMs to become more\ncapable partners in innovation.",
      "pdf_url": "http://arxiv.org/pdf/2510.21341v1",
      "published": "2025-10-24T11:09:59+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21341v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "CausalRec: A CausalBoost Attention Model for Sequential Recommendation",
      "authors": [
        "Yunbo Hou",
        "Tianle Yang",
        "Ruijie Li",
        "Li He",
        "Liang Wang",
        "Weiping Li",
        "Bo Zheng",
        "Guojie Song"
      ],
      "abstract": "Recent advances in correlation-based sequential recommendation systems have\ndemonstrated substantial success. Specifically, the attention-based model\noutperforms other RNN-based and Markov chains-based models by capturing both\nshort- and long-term dependencies more effectively. However, solely focusing on\nitem co-occurrences overlooks the underlying motivations behind user behaviors,\nleading to spurious correlations and potentially inaccurate recommendations. To\naddress this limitation, we present a novel framework that integrates causal\nattention for sequential recommendation, CausalRec. It incorporates a causal\ndiscovery block and a CausalBooster. The causal discovery block learns the\ncausal graph in user behavior sequences, and we provide a theory to guarantee\nthe identifiability of the learned causal graph. The CausalBooster utilizes the\ndiscovered causal graph to refine the attention mechanism, prioritizing\nbehaviors with causal significance. Experimental evaluations on real-world\ndatasets indicate that CausalRec outperforms several state-of-the-art methods,\nwith average improvements of 7.21% in Hit Rate (HR) and 8.65% in Normalized\nDiscounted Cumulative Gain (NDCG). To the best of our knowledge, this is the\nfirst model to incorporate causality through the attention mechanism in\nsequential recommendation, demonstrating the value of causality in generating\nmore accurate and reliable recommendations.",
      "pdf_url": "http://arxiv.org/pdf/2510.21333v1",
      "published": "2025-10-24T10:49:50+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21333v1",
      "categories": [
        "cs.IR",
        "cs.AI"
      ]
    },
    {
      "title": "Weak-to-Strong Generalization under Distribution Shifts",
      "authors": [
        "Myeongho Jeon",
        "Jan Sobotka",
        "Suhwan Choi",
        "Maria Brbić"
      ],
      "abstract": "As future superhuman models become increasingly complex, accurately\nsupervising their behavior may exceed human capabilities. Recent works have\ndemonstrated that in such scenarios, weak models can effectively supervise\nstrong models, a phenomenon known as weak-to-strong generalization. However, we\nfind that naive weak-to-strong generalization fails under distribution shifts,\noften leading to worse performance of the strong model than its weak\nsupervisors. To address this, we propose RAVEN, a robust weak-to-strong\ngeneralization framework that dynamically learns the optimal combinations of\nweak models in addition to parameters of the strong model. We demonstrate the\neffectiveness of RAVEN on image classification, text classification, and\npreference alignment tasks. RAVEN outperforms alternative baselines by over 30%\non out-of-distribution tasks while matching or surpassing existing methods on\nin-distribution tasks. Moreover, our results show that RAVEN assigns higher\nweights to more accurate weak models, demonstrating its ability to\nautomatically identify trustworthy supervision.",
      "pdf_url": "http://arxiv.org/pdf/2510.21332v1",
      "published": "2025-10-24T10:46:50+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21332v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "TripTide: A Benchmark for Adaptive Travel Planning under Disruptions",
      "authors": [
        "Priyanshu Karmakar",
        "Soumyabrata Chaudhuri",
        "Shubhojit Mallick",
        "Manish Gupta",
        "Abhik Jana",
        "Shreya Ghosh"
      ],
      "abstract": "Recent efforts like TripCraft and TravelPlanner have advanced the use of\nLarge Language Models ( LLMs) for personalized, constraint aware travel\nitinerary generation. Yet, real travel often faces disruptions. To address\nthis, we present TripTide, the first benchmark evaluating LLM's ability to\nrevise itineraries under realistic disruptions. TripTide models key dimensions\nsuch as disruption severity and traveler tolerance, enabling nuanced assessment\nof LLM adaptability to events like flight cancellations, weather closures, or\noverbooked attractions. We conduct a threefold evaluation. First, we introduce\nautomatic metrics including Preservation of Intent (how well the revised plan\nmaintains feasibility and goals), Responsiveness (promptness and\nappropriateness of disruption handling), and Adaptability (semantic, spatial,\nand sequential divergence between original and revised plans). Second, we apply\nan LLM-as-a-judge approach to automatically assess revision quality. Third, we\nperform manual expert evaluation to verify whether revisions preserve semantic,\nspatial, sequential, and responsive aspects. Our experiments show that LLMs\nmaintain strong sequential consistency and semantic stability, while spatial\ndeviations are larger for shorter trips but decrease with longer ones,\nindicating that extended plans encourage better geographic coherence. However,\ndisruption-handling ability declines as plan length increases, highlighting\nlimits in LLM robustness. TripTide establishes a benchmark for evaluating\nadaptability, personalization, and resilience in LLM-based travel planning\nunder real-world uncertainty.",
      "pdf_url": "http://arxiv.org/pdf/2510.21329v1",
      "published": "2025-10-24T10:39:55+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21329v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "CXRAgent: Director-Orchestrated Multi-Stage Reasoning for Chest X-Ray Interpretation",
      "authors": [
        "Jinhui Lou",
        "Yan Yang",
        "Zhou Yu",
        "Zhenqi Fu",
        "Weidong Han",
        "Qingming Huang",
        "Jun Yu"
      ],
      "abstract": "Chest X-ray (CXR) plays a pivotal role in clinical diagnosis, and a variety\nof task-specific and foundation models have been developed for automatic CXR\ninterpretation. However, these models often struggle to adapt to new diagnostic\ntasks and complex reasoning scenarios. Recently, LLM-based agent models have\nemerged as a promising paradigm for CXR analysis, enhancing model's capability\nthrough tool coordination, multi-step reasoning, and team collaboration, etc.\nHowever, existing agents often rely on a single diagnostic pipeline and lack\nmechanisms for assessing tools' reliability, limiting their adaptability and\ncredibility. To this end, we propose CXRAgent, a director-orchestrated,\nmulti-stage agent for CXR interpretation, where a central director coordinates\nthe following stages: (1) Tool Invocation: The agent strategically orchestrates\na set of CXR-analysis tools, with outputs normalized and verified by the\nEvidence-driven Validator (EDV), which grounds diagnostic outputs with visual\nevidence to support reliable downstream diagnosis; (2) Diagnostic Planning:\nGuided by task requirements and intermediate findings, the agent formulates a\ntargeted diagnostic plan. It then assembles an expert team accordingly,\ndefining member roles and coordinating their interactions to enable adaptive\nand collaborative reasoning; (3) Collaborative Decision-making: The agent\nintegrates insights from the expert team with accumulated contextual memories,\nsynthesizing them into an evidence-backed diagnostic conclusion. Experiments on\nvarious CXR interpretation tasks show that CXRAgent delivers strong\nperformance, providing visual evidence and generalizes well to clinical tasks\nof different complexity. Code and data are valuable at this\n\\href{https://github.com/laojiahuo2003/CXRAgent/}{link}.",
      "pdf_url": "http://arxiv.org/pdf/2510.21324v1",
      "published": "2025-10-24T10:31:30+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21324v1",
      "categories": [
        "cs.AI",
        "cs.MA"
      ]
    },
    {
      "title": "Seemingly Redundant Modules Enhance Robust Odor Learning in Fruit Flies",
      "authors": [
        "Haiyang Li",
        "Liao Yu",
        "Qiang Yu",
        "Yunliang Zang"
      ],
      "abstract": "Biological circuits have evolved to incorporate multiple modules that perform\nsimilar functions. In the fly olfactory circuit, both lateral inhibition (LI)\nand neuronal spike frequency adaptation (SFA) are thought to enhance pattern\nseparation for odor learning. However, it remains unclear whether these\nmechanisms play redundant or distinct roles in this process. In this study, we\npresent a computational model of the fly olfactory circuit to investigate odor\ndiscrimination under varying noise conditions that simulate complex\nenvironments. Our results show that LI primarily enhances odor discrimination\nin low- and medium-noise scenarios, but this benefit diminishes and may reverse\nunder higher-noise conditions. In contrast, SFA consistently improves\ndiscrimination across all noise levels. LI is preferentially engaged in low-\nand medium-noise environments, whereas SFA dominates in high-noise settings.\nWhen combined, these two sparsification mechanisms enable optimal\ndiscrimination performance. This work demonstrates that seemingly redundant\nmodules in biological circuits can, in fact, be essential for achieving optimal\nlearning in complex contexts.",
      "pdf_url": "http://arxiv.org/pdf/2510.21315v1",
      "published": "2025-10-24T10:18:38+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21315v1",
      "categories": [
        "cs.NE",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "A Convergence Analysis of Adaptive Optimizers under Floating-point Quantization",
      "authors": [
        "Xuan Tang",
        "Jichu Li",
        "Difan Zou"
      ],
      "abstract": "The rapid scaling of large language models (LLMs) has made low-precision\ntraining essential for reducing memory, improving efficiency, and enabling\nlarger models and datasets. Existing convergence theories for adaptive\noptimizers, however, assume all components are exact and neglect hardware-aware\nquantization, leaving open the question of why low-precision training remains\neffective. We introduce the first theoretical framework for analyzing the\nconvergence of adaptive optimizers, including Adam and Muon, under\nfloating-point quantization of gradients, weights, and optimizer states (e.g.,\nmoment estimates). Within this framework, we derive convergence rates on smooth\nnon-convex objectives under standard stochastic gradient assumptions,\nexplicitly characterizing how quantization errors from different components\naffect convergence. We show that both algorithms retain rates close to their\nfull-precision counterparts provided mantissa length scales only\nlogarithmically with the number of iterations. Our analysis further reveals\nthat Adam is highly sensitive to weights and second-moment quantization due to\nits reliance on $\\beta_2 \\to 1$, while Muon requires weaker error control and\nis thus potentially more robust. These results narrow the gap between empirical\nsuccess and theoretical understanding of low-precision training methods.\nNumerical experiments on synthetic and real-world data corroborate our theory.",
      "pdf_url": "http://arxiv.org/pdf/2510.21314v1",
      "published": "2025-10-24T10:16:23+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21314v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "Efficient semantic uncertainty quantification in language models via diversity-steered sampling",
      "authors": [
        "Ji Won Park",
        "Kyunghyun Cho"
      ],
      "abstract": "Accurately estimating semantic aleatoric and epistemic uncertainties in large\nlanguage models (LLMs) is particularly challenging in free-form question\nanswering (QA), where obtaining stable estimates often requires many expensive\ngenerations. We introduce a diversity-steered sampler that discourages\nsemantically redundant outputs during decoding, covers both autoregressive and\nmasked diffusion paradigms, and yields substantial sample-efficiency gains. The\nkey idea is to inject a continuous semantic-similarity penalty into the model's\nproposal distribution using a natural language inference (NLI) model lightly\nfinetuned on partial prefixes or intermediate diffusion states. We debias\ndownstream uncertainty estimates with importance reweighting and shrink their\nvariance with control variates. Across four QA benchmarks, our method matches\nor surpasses baselines while covering more semantic clusters with the same\nnumber of samples. Being modular and requiring no gradient access to the base\nLLM, the framework promises to serve as a drop-in enhancement for uncertainty\nestimation in risk-sensitive model deployments.",
      "pdf_url": "http://arxiv.org/pdf/2510.21310v1",
      "published": "2025-10-24T10:06:21+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21310v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Towards Reliable Code-as-Policies: A Neuro-Symbolic Framework for Embodied Task Planning",
      "authors": [
        "Sanghyun Ahn",
        "Wonje Choi",
        "Junyong Lee",
        "Jinwoo Park",
        "Honguk Woo"
      ],
      "abstract": "Recent advances in large language models (LLMs) have enabled the automatic\ngeneration of executable code for task planning and control in embodied agents\nsuch as robots, demonstrating the potential of LLM-based embodied intelligence.\nHowever, these LLM-based code-as-policies approaches often suffer from limited\nenvironmental grounding, particularly in dynamic or partially observable\nsettings, leading to suboptimal task success rates due to incorrect or\nincomplete code generation. In this work, we propose a neuro-symbolic embodied\ntask planning framework that incorporates explicit symbolic verification and\ninteractive validation processes during code generation. In the validation\nphase, the framework generates exploratory code that actively interacts with\nthe environment to acquire missing observations while preserving task-relevant\nstates. This integrated process enhances the grounding of generated code,\nresulting in improved task reliability and success rates in complex\nenvironments. We evaluate our framework on RLBench and in real-world settings\nacross dynamic, partially observable scenarios. Experimental results\ndemonstrate that our framework improves task success rates by 46.2% over\nCode-as-Policies baselines and attains over 86.8% executability of\ntask-relevant actions, thereby enhancing the reliability of task planning in\ndynamic environments.",
      "pdf_url": "http://arxiv.org/pdf/2510.21302v1",
      "published": "2025-10-24T10:01:08+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21302v1",
      "categories": [
        "cs.AI",
        "cs.RO"
      ]
    },
    {
      "title": "Understanding AI Trustworthiness: A Scoping Review of AIES & FAccT Articles",
      "authors": [
        "Siddharth Mehrotra",
        "Jin Huang",
        "Xuelong Fu",
        "Roel Dobbe",
        "Clara I. Sánchez",
        "Maarten de Rijke"
      ],
      "abstract": "Background: Trustworthy AI serves as a foundational pillar for two major AI\nethics conferences: AIES and FAccT. However, current research often adopts\ntechno-centric approaches, focusing primarily on technical attributes such as\nreliability, robustness, and fairness, while overlooking the sociotechnical\ndimensions critical to understanding AI trustworthiness in real-world contexts.\n  Objectives: This scoping review aims to examine how the AIES and FAccT\ncommunities conceptualize, measure, and validate AI trustworthiness,\nidentifying major gaps and opportunities for advancing a holistic understanding\nof trustworthy AI systems.\n  Methods: We conduct a scoping review of AIES and FAccT conference proceedings\nto date, systematically analyzing how trustworthiness is defined,\noperationalized, and applied across different research domains. Our analysis\nfocuses on conceptualization approaches, measurement methods, verification and\nvalidation techniques, application areas, and underlying values.\n  Results: While significant progress has been made in defining technical\nattributes such as transparency, accountability, and robustness, our findings\nreveal critical gaps. Current research often predominantly emphasizes technical\nprecision at the expense of social and ethical considerations. The\nsociotechnical nature of AI systems remains less explored and trustworthiness\nemerges as a contested concept shaped by those with the power to define it.\n  Conclusions: An interdisciplinary approach combining technical rigor with\nsocial, cultural, and institutional considerations is essential for advancing\ntrustworthy AI. We propose actionable measures for the AI ethics community to\nadopt holistic frameworks that genuinely address the complex interplay between\nAI systems and society, ultimately promoting responsible technological\ndevelopment that benefits all stakeholders.",
      "pdf_url": "http://arxiv.org/pdf/2510.21293v1",
      "published": "2025-10-24T09:40:38+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.21293v1",
      "categories": [
        "cs.AI",
        "cs.HC"
      ]
    }
  ]
}