{
  "last_updated": "2025-08-28T00:48:58.390939",
  "papers": [
    {
      "title": "Model Context Protocols in Adaptive Transport Systems: A Survey",
      "authors": [
        "Gaurab Chhetri",
        "Shriyank Somvanshi",
        "Md Monzurul Islam",
        "Shamyo Brotee",
        "Mahmuda Sultana Mimi",
        "Dipti Koirala",
        "Biplov Pandey",
        "Subasish Das"
      ],
      "abstract": "The rapid expansion of interconnected devices, autonomous systems, and AI\napplications has created severe fragmentation in adaptive transport systems,\nwhere diverse protocols and context sources remain isolated. This survey\nprovides the first systematic investigation of the Model Context Protocol (MCP)\nas a unifying paradigm, highlighting its ability to bridge protocol-level\nadaptation with context-aware decision making. Analyzing established\nliterature, we show that existing efforts have implicitly converged toward\nMCP-like architectures, signaling a natural evolution from fragmented solutions\nto standardized integration frameworks. We propose a five-category taxonomy\ncovering adaptive mechanisms, context-aware frameworks, unification models,\nintegration strategies, and MCP-enabled architectures. Our findings reveal\nthree key insights: traditional transport protocols have reached the limits of\nisolated adaptation, MCP's client-server and JSON-RPC structure enables\nsemantic interoperability, and AI-driven transport demands integration\nparadigms uniquely suited to MCP. Finally, we present a research roadmap\npositioning MCP as a foundation for next-generation adaptive, context-aware,\nand intelligent transport infrastructures.",
      "pdf_url": "http://arxiv.org/pdf/2508.19239v1",
      "published": "2025-08-26T17:58:56+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19239v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "StepWiser: Stepwise Generative Judges for Wiser Reasoning",
      "authors": [
        "Wei Xiong",
        "Wenting Zhao",
        "Weizhe Yuan",
        "Olga Golovneva",
        "Tong Zhang",
        "Jason Weston",
        "Sainbayar Sukhbaatar"
      ],
      "abstract": "As models increasingly leverage multi-step reasoning strategies to solve\ncomplex problems, supervising the logical validity of these intermediate steps\nhas become a critical research challenge. Process reward models address this by\nproviding step-by-step feedback, but current approaches have two major\ndrawbacks: they typically function as classifiers without providing\nexplanations, and their reliance on supervised fine-tuning with static datasets\nlimits generalization. Inspired by recent advances, we reframe stepwise reward\nmodeling from a classification task to a reasoning task itself. We thus propose\na generative judge that reasons about the policy model's reasoning steps (i.e.,\nmeta-reasons), outputting thinking tokens before delivering a final verdict.\nOur model, StepWiser, is trained by reinforcement learning using relative\noutcomes of rollouts. We show it provides (i) better judgment accuracy on\nintermediate steps than existing methods; (ii) can be used to improve the\npolicy model at training time; and (iii) improves inference-time search.",
      "pdf_url": "http://arxiv.org/pdf/2508.19229v1",
      "published": "2025-08-26T17:45:05+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19229v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "Generative Interfaces for Language Models",
      "authors": [
        "Jiaqi Chen",
        "Yanzhe Zhang",
        "Yutong Zhang",
        "Yijia Shao",
        "Diyi Yang"
      ],
      "abstract": "Large language models (LLMs) are increasingly seen as assistants, copilots,\nand consultants, capable of supporting a wide range of tasks through natural\nconversation. However, most systems remain constrained by a linear\nrequest-response format that often makes interactions inefficient in\nmulti-turn, information-dense, and exploratory tasks. To address these\nlimitations, we propose Generative Interfaces for Language Models, a paradigm\nin which LLMs respond to user queries by proactively generating user interfaces\n(UIs) that enable more adaptive and interactive engagement. Our framework\nleverages structured interface-specific representations and iterative\nrefinements to translate user queries into task-specific UIs. For systematic\nevaluation, we introduce a multidimensional assessment framework that compares\ngenerative interfaces with traditional chat-based ones across diverse tasks,\ninteraction patterns, and query types, capturing functional, interactive, and\nemotional aspects of user experience. Results show that generative interfaces\nconsistently outperform conversational ones, with humans preferring them in\nover 70% of cases. These findings clarify when and why users favor generative\ninterfaces, paving the way for future advancements in human-AI interaction.",
      "pdf_url": "http://arxiv.org/pdf/2508.19227v1",
      "published": "2025-08-26T17:43:20+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19227v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.HC"
      ]
    },
    {
      "title": "The Subset Sum Matching Problem",
      "authors": [
        "Yufei Wu",
        "Manuel R. Torres",
        "Parisa Zehtabi",
        "Alberto Pozanco Lancho",
        "Michael Cashmore",
        "Daniel Borrajo",
        "Manuela Veloso"
      ],
      "abstract": "This paper presents a new combinatorial optimisation task, the Subset Sum\nMatching Problem (SSMP), which is an abstraction of common financial\napplications such as trades reconciliation. We present three algorithms, two\nsuboptimal and one optimal, to solve this problem. We also generate a benchmark\nto cover different instances of SSMP varying in complexity, and carry out an\nexperimental evaluation to assess the performance of the approaches.",
      "pdf_url": "http://arxiv.org/pdf/2508.19218v1",
      "published": "2025-08-26T17:35:49+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19218v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Interpolating Speaker Identities in Embedding Space for Data Expansion",
      "authors": [
        "Tianchi Liu",
        "Ruijie Tao",
        "Qiongqiong Wang",
        "Yidi Jiang",
        "Hardik B. Sailor",
        "Ke Zhang",
        "Jingru Lin",
        "Haizhou Li"
      ],
      "abstract": "The success of deep learning-based speaker verification systems is largely\nattributed to access to large-scale and diverse speaker identity data. However,\ncollecting data from more identities is expensive, challenging, and often\nlimited by privacy concerns. To address this limitation, we propose INSIDE\n(Interpolating Speaker Identities in Embedding Space), a novel data expansion\nmethod that synthesizes new speaker identities by interpolating between\nexisting speaker embeddings. Specifically, we select pairs of nearby speaker\nembeddings from a pretrained speaker embedding space and compute intermediate\nembeddings using spherical linear interpolation. These interpolated embeddings\nare then fed to a text-to-speech system to generate corresponding speech\nwaveforms. The resulting data is combined with the original dataset to train\ndownstream models. Experiments show that models trained with INSIDE-expanded\ndata outperform those trained only on real data, achieving 3.06\\% to 5.24\\%\nrelative improvements. While INSIDE is primarily designed for speaker\nverification, we also validate its effectiveness on gender classification,\nwhere it yields a 13.44\\% relative improvement. Moreover, INSIDE is compatible\nwith other augmentation techniques and can serve as a flexible, scalable\naddition to existing training pipelines.",
      "pdf_url": "http://arxiv.org/pdf/2508.19210v1",
      "published": "2025-08-26T17:15:42+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19210v1",
      "categories": [
        "eess.AS",
        "cs.AI"
      ]
    },
    {
      "title": "VibeVoice Technical Report",
      "authors": [
        "Zhiliang Peng",
        "Jianwei Yu",
        "Wenhui Wang",
        "Yaoyao Chang",
        "Yutao Sun",
        "Li Dong",
        "Yi Zhu",
        "Weijiang Xu",
        "Hangbo Bao",
        "Zehua Wang",
        "Shaohan Huang",
        "Yan Xia",
        "Furu Wei"
      ],
      "abstract": "This report presents VibeVoice, a novel model designed to synthesize\nlong-form speech with multiple speakers by employing next-token diffusion,\nwhich is a unified method for modeling continuous data by autoregressively\ngenerating latent vectors via diffusion. To enable this, we introduce a novel\ncontinuous speech tokenizer that, when compared to the popular Encodec model,\nimproves data compression by 80 times while maintaining comparable performance.\nThe tokenizer effectively preserves audio fidelity while significantly boosting\ncomputational efficiency for processing long sequences. Thus, VibeVoice can\nsynthesize long-form speech for up to 90 minutes (in a 64K context window\nlength) with a maximum of 4 speakers, capturing the authentic conversational\n``vibe'' and surpassing open-source and proprietary dialogue models.",
      "pdf_url": "http://arxiv.org/pdf/2508.19205v1",
      "published": "2025-08-26T17:09:12+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19205v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.SD",
        "eess.AS"
      ]
    },
    {
      "title": "LSD-3D: Large-Scale 3D Driving Scene Generation with Geometry Grounding",
      "authors": [
        "Julian Ost",
        "Andrea Ramazzina",
        "Amogh Joshi",
        "Maximilian Bömer",
        "Mario Bijelic",
        "Felix Heide"
      ],
      "abstract": "Large-scale scene data is essential for training and testing in robot\nlearning. Neural reconstruction methods have promised the capability of\nreconstructing large physically-grounded outdoor scenes from captured sensor\ndata. However, these methods have baked-in static environments and only allow\nfor limited scene control -- they are functionally constrained in scene and\ntrajectory diversity by the captures from which they are reconstructed. In\ncontrast, generating driving data with recent image or video diffusion models\noffers control, however, at the cost of geometry grounding and causality. In\nthis work, we aim to bridge this gap and present a method that directly\ngenerates large-scale 3D driving scenes with accurate geometry, allowing for\ncausal novel view synthesis with object permanence and explicit 3D geometry\nestimation. The proposed method combines the generation of a proxy geometry and\nenvironment representation with score distillation from learned 2D image\npriors. We find that this approach allows for high controllability, enabling\nthe prompt-guided geometry and high-fidelity texture and structure that can be\nconditioned on map layouts -- producing realistic and geometrically consistent\n3D generations of complex driving scenes.",
      "pdf_url": "http://arxiv.org/pdf/2508.19204v1",
      "published": "2025-08-26T17:04:49+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19204v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.GR"
      ]
    },
    {
      "title": "Understanding Tool-Integrated Reasoning",
      "authors": [
        "Heng Lin",
        "Zhongwen Xu"
      ],
      "abstract": "We study why Tool-Integrated Reasoning (TIR) makes Large Language Models\n(LLMs) more capable. While LLMs integrated with tools like Python code\ninterpreters show great promise, a principled theory explaining why this\nparadigm is effective has been missing. This work provides the first formal\nproof that TIR fundamentally expands an LLM's capabilities. We demonstrate that\ntools enable a strict expansion of the model's empirical and feasible support,\nbreaking the capability ceiling of pure-text models by unlocking\nproblem-solving strategies that are otherwise impossible or intractably\nverbose. To guide model behavior without compromising training stability and\nperformance, we also introduce Advantage Shaping Policy Optimization (ASPO), a\nnovel algorithm that directly modifies the advantage function to guide the\npolicy behavior. We conduct comprehensive experiments on challenging\nmathematical benchmarks, leveraging a Python interpreter as the external tool.\nOur results show that the TIR model decisively outperforms its pure-text\ncounterpart on the pass@k metric. Crucially, this advantage is not confined to\ncomputationally-intensive problems but extends to those requiring significant\nabstract insight. We further identify the emergent cognitive patterns that\nillustrate how models learn to think with tools. Finally, we report improved\ntool usage behavior with early code invocation and much more interactive turns\nwith ASPO. Overall, our work provides the first principled explanation for\nTIR's success, shifting the focus from the mere fact that tools work to why and\nhow they enable more powerful reasoning.",
      "pdf_url": "http://arxiv.org/pdf/2508.19201v1",
      "published": "2025-08-26T17:03:46+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19201v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "The Ramon Llull's Thinking Machine for Automated Ideation",
      "authors": [
        "Xinran Zhao",
        "Boyuan Zheng",
        "Chenglei Si",
        "Haofei Yu",
        "Ken Liu",
        "Runlong Zhou",
        "Ruochen Li",
        "Tong Chen",
        "Xiang Li",
        "Yiming Zhang",
        "Tongshuang Wu"
      ],
      "abstract": "This paper revisits Ramon Llull's Ars combinatoria - a medieval framework for\ngenerating knowledge through symbolic recombination - as a conceptual\nfoundation for building a modern Llull's thinking machine for research\nideation. Our approach defines three compositional axes: Theme (e.g.,\nefficiency, adaptivity), Domain (e.g., question answering, machine\ntranslation), and Method (e.g., adversarial training, linear attention). These\nelements represent high-level abstractions common in scientific work -\nmotivations, problem settings, and technical approaches - and serve as building\nblocks for LLM-driven exploration. We mine elements from human experts or\nconference papers and show that prompting LLMs with curated combinations\nproduces research ideas that are diverse, relevant, and grounded in current\nliterature. This modern thinking machine offers a lightweight, interpretable\ntool for augmenting scientific creativity and suggests a path toward\ncollaborative ideation between humans and AI.",
      "pdf_url": "http://arxiv.org/pdf/2508.19200v1",
      "published": "2025-08-26T17:03:43+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19200v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "Emotions as Ambiguity-aware Ordinal Representations",
      "authors": [
        "Jingyao Wu",
        "Matthew Barthet",
        "David Melhart",
        "Georgios N. Yannakakis"
      ],
      "abstract": "Emotions are inherently ambiguous and dynamic phenomena, yet existing\ncontinuous emotion recognition approaches either ignore their ambiguity or\ntreat ambiguity as an independent and static variable over time. Motivated by\nthis gap in the literature, in this paper we introduce ambiguity-aware ordinal\nemotion representations, a novel framework that captures both the ambiguity\npresent in emotion annotation and the inherent temporal dynamics of emotional\ntraces. Specifically, we propose approaches that model emotion ambiguity\nthrough its rate of change. We evaluate our framework on two affective corpora\n-- RECOLA and GameVibe -- testing our proposed approaches on both bounded\n(arousal, valence) and unbounded (engagement) continuous traces. Our results\ndemonstrate that ordinal representations outperform conventional\nambiguity-aware models on unbounded labels, achieving the highest Concordance\nCorrelation Coefficient (CCC) and Signed Differential Agreement (SDA) scores,\nhighlighting their effectiveness in modeling the traces' dynamics. For bounded\ntraces, ordinal representations excel in SDA, revealing their superior ability\nto capture relative changes of annotated emotion traces.",
      "pdf_url": "http://arxiv.org/pdf/2508.19193v2",
      "published": "2025-08-26T16:55:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19193v2",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Real-Time Model Checking for Closed-Loop Robot Reactive Planning",
      "authors": [
        "Christopher Chandler",
        "Bernd Porr",
        "Giulia Lafratta",
        "Alice Miller"
      ],
      "abstract": "We present a new application of model checking which achieves real-time\nmulti-step planning and obstacle avoidance on a real autonomous robot. We have\ndeveloped a small, purpose-built model checking algorithm which generates plans\nin situ based on \"core\" knowledge and attention as found in biological agents.\nThis is achieved in real-time using no pre-computed data on a low-powered\ndevice. Our approach is based on chaining temporary control systems which are\nspawned to counteract disturbances in the local environment that disrupt an\nautonomous agent from its preferred action (or resting state). A novel\ndiscretization of 2D LiDAR data sensitive to bounded variations in the local\nenvironment is used. Multi-step planning using model checking by forward\ndepth-first search is applied to cul-de-sac and playground scenarios. Both\nempirical results and informal proofs of two fundamental properties of our\napproach demonstrate that model checking can be used to create efficient\nmulti-step plans for local obstacle avoidance, improving on the performance of\na reactive agent which can only plan one step. Our approach is an instructional\ncase study for the development of safe, reliable and explainable planning in\nthe context of autonomous vehicles.",
      "pdf_url": "http://arxiv.org/pdf/2508.19186v1",
      "published": "2025-08-26T16:49:30+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19186v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.FL",
        "I.2.9; I.2; D.2.4"
      ]
    },
    {
      "title": "From Tabula Rasa to Emergent Abilities: Discovering Robot Skills via Real-World Unsupervised Quality-Diversity",
      "authors": [
        "Luca Grillotti",
        "Lisa Coiffard",
        "Oscar Pang",
        "Maxence Faldor",
        "Antoine Cully"
      ],
      "abstract": "Autonomous skill discovery aims to enable robots to acquire diverse behaviors\nwithout explicit supervision. Learning such behaviors directly on physical\nhardware remains challenging due to safety and data efficiency constraints.\nExisting methods, including Quality-Diversity Actor-Critic (QDAC), require\nmanually defined skill spaces and carefully tuned heuristics, limiting\nreal-world applicability. We propose Unsupervised Real-world Skill Acquisition\n(URSA), an extension of QDAC that enables robots to autonomously discover and\nmaster diverse, high-performing skills directly in the real world. We\ndemonstrate that URSA successfully discovers diverse locomotion skills on a\nUnitree A1 quadruped in both simulation and the real world. Our approach\nsupports both heuristic-driven skill discovery and fully unsupervised settings.\nWe also show that the learned skill repertoire can be reused for downstream\ntasks such as real-world damage adaptation, where URSA outperforms all\nbaselines in 5 out of 9 simulated and 3 out of 5 real-world damage scenarios.\nOur results establish a new framework for real-world robot learning that\nenables continuous skill discovery with limited human intervention,\nrepresenting a significant step toward more autonomous and adaptable robotic\nsystems. Demonstration videos are available at\nhttps://adaptive-intelligent-robotics.github.io/URSA.",
      "pdf_url": "http://arxiv.org/pdf/2508.19172v2",
      "published": "2025-08-26T16:20:41+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19172v2",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "MATRIX: Multi-Agent simulaTion fRamework for safe Interactions and conteXtual clinical conversational evaluation",
      "authors": [
        "Ernest Lim",
        "Yajie Vera He",
        "Jared Joselowitz",
        "Kate Preston",
        "Mohita Chowdhury",
        "Louis Williams",
        "Aisling Higham",
        "Katrina Mason",
        "Mariane Melo",
        "Tom Lawton",
        "Yan Jia",
        "Ibrahim Habli"
      ],
      "abstract": "Despite the growing use of large language models (LLMs) in clinical dialogue\nsystems, existing evaluations focus on task completion or fluency, offering\nlittle insight into the behavioral and risk management requirements essential\nfor safety-critical systems. This paper presents MATRIX (Multi-Agent simulaTion\nfRamework for safe Interactions and conteXtual clinical conversational\nevaluation), a structured, extensible framework for safety-oriented evaluation\nof clinical dialogue agents.\n  MATRIX integrates three components: (1) a safety-aligned taxonomy of clinical\nscenarios, expected system behaviors and failure modes derived through\nstructured safety engineering methods; (2) BehvJudge, an LLM-based evaluator\nfor detecting safety-relevant dialogue failures, validated against expert\nclinician annotations; and (3) PatBot, a simulated patient agent capable of\nproducing diverse, scenario-conditioned responses, evaluated for realism and\nbehavioral fidelity with human factors expertise, and a patient-preference\nstudy.\n  Across three experiments, we show that MATRIX enables systematic, scalable\nsafety evaluation. BehvJudge with Gemini 2.5-Pro achieves expert-level hazard\ndetection (F1 0.96, sensitivity 0.999), outperforming clinicians in a blinded\nassessment of 240 dialogues. We also conducted one of the first realism\nanalyses of LLM-based patient simulation, showing that PatBot reliably\nsimulates realistic patient behavior in quantitative and qualitative\nevaluations. Using MATRIX, we demonstrate its effectiveness in benchmarking\nfive LLM agents across 2,100 simulated dialogues spanning 14 hazard scenarios\nand 10 clinical domains.\n  MATRIX is the first framework to unify structured safety engineering with\nscalable, validated conversational AI evaluation, enabling regulator-aligned\nsafety auditing. We release all evaluation tools, prompts, structured\nscenarios, and datasets.",
      "pdf_url": "http://arxiv.org/pdf/2508.19163v1",
      "published": "2025-08-26T16:12:12+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19163v1",
      "categories": [
        "cs.AI",
        "cs.HC",
        "cs.MA",
        "68T50, 68T42, 92C50, 68Q60",
        "I.2.0; J.3"
      ]
    },
    {
      "title": "Few-Shot Connectivity-Aware Text Line Segmentation in Historical Documents",
      "authors": [
        "Rafael Sterzinger",
        "Tingyu Lin",
        "Robert Sablatnig"
      ],
      "abstract": "A foundational task for the digital analysis of documents is text line\nsegmentation. However, automating this process with deep learning models is\nchallenging because it requires large, annotated datasets that are often\nunavailable for historical documents. Additionally, the annotation process is a\nlabor- and cost-intensive task that requires expert knowledge, which makes\nfew-shot learning a promising direction for reducing data requirements. In this\nwork, we demonstrate that small and simple architectures, coupled with a\ntopology-aware loss function, are more accurate and data-efficient than more\ncomplex alternatives. We pair a lightweight UNet++ with a connectivity-aware\nloss, initially developed for neuron morphology, which explicitly penalizes\nstructural errors like line fragmentation and unintended line merges. To\nincrease our limited data, we train on small patches extracted from a mere\nthree annotated pages per manuscript. Our methodology significantly improves\nupon the current state-of-the-art on the U-DIADS-TL dataset, with a 200%\nincrease in Recognition Accuracy and a 75% increase in Line Intersection over\nUnion. Our method also achieves an F-Measure score on par with or even\nexceeding that of the competition winner of the DIVA-HisDB baseline detection\ntask, all while requiring only three annotated pages, exemplifying the efficacy\nof our approach. Our implementation is publicly available at:\nhttps://github.com/RafaelSterzinger/acpr_few_shot_hist.",
      "pdf_url": "http://arxiv.org/pdf/2508.19162v1",
      "published": "2025-08-26T16:11:32+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19162v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "RDDM: Practicing RAW Domain Diffusion Model for Real-world Image Restoration",
      "authors": [
        "Yan Chen",
        "Yi Wen",
        "Wei Li",
        "Junchao Liu",
        "Yong Guo",
        "Jie Hu",
        "Xinghao Chen"
      ],
      "abstract": "We present the RAW domain diffusion model (RDDM), an end-to-end diffusion\nmodel that restores photo-realistic images directly from the sensor RAW data.\nWhile recent sRGB-domain diffusion methods achieve impressive results, they are\ncaught in a dilemma between high fidelity and realistic generation. As these\nmodels process lossy sRGB inputs and neglect the accessibility of the sensor\nRAW images in many scenarios, e.g., in image and video capturing in edge\ndevices, resulting in sub-optimal performance. RDDM bypasses this limitation by\ndirectly restoring images in the RAW domain, replacing the conventional\ntwo-stage image signal processing (ISP) + IR pipeline. However, a simple\nadaptation of pre-trained diffusion models to the RAW domain confronts the\nout-of-distribution (OOD) issues. To this end, we propose: (1) a RAW-domain VAE\n(RVAE) learning optimal latent representations, (2) a differentiable Post Tone\nProcessing (PTP) module enabling joint RAW and sRGB space optimization. To\ncompensate for the deficiency in the dataset, we develop a scalable degradation\npipeline synthesizing RAW LQ-HQ pairs from existing sRGB datasets for\nlarge-scale training. Furthermore, we devise a configurable multi-bayer (CMB)\nLoRA module handling diverse RAW patterns such as RGGB, BGGR, etc. Extensive\nexperiments demonstrate RDDM's superiority over state-of-the-art sRGB diffusion\nmethods, yielding higher fidelity results with fewer artifacts.",
      "pdf_url": "http://arxiv.org/pdf/2508.19154v1",
      "published": "2025-08-26T16:06:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19154v1",
      "categories": [
        "eess.IV",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Playstyle and Artificial Intelligence: An Initial Blueprint Through the Lens of Video Games",
      "authors": [
        "Chiu-Chou Lin"
      ],
      "abstract": "Contemporary artificial intelligence (AI) development largely centers on\nrational decision-making, valued for its measurability and suitability for\nobjective evaluation. Yet in real-world contexts, an intelligent agent's\ndecisions are shaped not only by logic but also by deeper influences such as\nbeliefs, values, and preferences. The diversity of human decision-making styles\nemerges from these differences, highlighting that \"style\" is an essential but\noften overlooked dimension of intelligence.\n  This dissertation introduces playstyle as an alternative lens for observing\nand analyzing the decision-making behavior of intelligent agents, and examines\nits foundational meaning and historical context from a philosophical\nperspective. By analyzing how beliefs and values drive intentions and actions,\nwe construct a two-tier framework for style formation: the external interaction\nloop with the environment and the internal cognitive loop of deliberation. On\nthis basis, we formalize style-related characteristics and propose measurable\nindicators such as style capacity, style popularity, and evolutionary dynamics.\n  The study focuses on three core research directions: (1) Defining and\nmeasuring playstyle, proposing a general playstyle metric based on discretized\nstate spaces, and extending it to quantify strategic diversity and competitive\nbalance; (2) Expressing and generating playstyle, exploring how reinforcement\nlearning and imitation learning can be used to train agents exhibiting specific\nstylistic tendencies, and introducing a novel approach for human-like style\nlearning and modeling; and (3) Practical applications, analyzing the potential\nof these techniques in domains such as game design and interactive\nentertainment.\n  Finally, the dissertation outlines future extensions, including the role of\nstyle as a core element in building artificial general intelligence (AGI).",
      "pdf_url": "http://arxiv.org/pdf/2508.19152v1",
      "published": "2025-08-26T16:04:18+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19152v1",
      "categories": [
        "cs.AI",
        "cs.LG",
        "cs.MA",
        "cs.SC"
      ]
    },
    {
      "title": "Uncertainty-Resilient Active Intention Recognition for Robotic Assistants",
      "authors": [
        "Juan Carlos Saborío",
        "Marc Vinci",
        "Oscar Lima",
        "Sebastian Stock",
        "Lennart Niecksch",
        "Martin Günther",
        "Alexander Sung",
        "Joachim Hertzberg",
        "Martin Atzmüller"
      ],
      "abstract": "Purposeful behavior in robotic assistants requires the integration of\nmultiple components and technological advances. Often, the problem is reduced\nto recognizing explicit prompts, which limits autonomy, or is oversimplified\nthrough assumptions such as near-perfect information. We argue that a critical\ngap remains unaddressed -- specifically, the challenge of reasoning about the\nuncertain outcomes and perception errors inherent to human intention\nrecognition. In response, we present a framework designed to be resilient to\nuncertainty and sensor noise, integrating real-time sensor data with a\ncombination of planners. Centered around an intention-recognition POMDP, our\napproach addresses cooperative planning and acting under uncertainty. Our\nintegrated framework has been successfully tested on a physical robot with\npromising results.",
      "pdf_url": "http://arxiv.org/pdf/2508.19150v1",
      "published": "2025-08-26T16:00:38+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19150v1",
      "categories": [
        "cs.RO",
        "cs.AI"
      ]
    },
    {
      "title": "Algorithmic Collective Action with Multiple Collectives",
      "authors": [
        "Claudio Battiloro",
        "Pietro Greiner",
        "Bret Nestor",
        "Oumaima Amezgar",
        "Francesca Dominici"
      ],
      "abstract": "As learning systems increasingly influence everyday decisions, user-side\nsteering via Algorithmic Collective Action (ACA)-coordinated changes to shared\ndata-offers a complement to regulator-side policy and firm-side model design.\nAlthough real-world actions have been traditionally decentralized and\nfragmented into multiple collectives despite sharing overarching\nobjectives-with each collective differing in size, strategy, and actionable\ngoals, most of the ACA literature focused on single collective settings. In\nthis work, we present the first theoretical framework for ACA with multiple\ncollectives acting on the same system. In particular, we focus on collective\naction in classification, studying how multiple collectives can plant signals,\ni.e., bias a classifier to learn an association between an altered version of\nthe features and a chosen, possibly overlapping, set of target classes. We\nprovide quantitative results about the role and the interplay of collectives'\nsizes and their alignment of goals. Our framework, by also complementing\nprevious empirical results, opens a path for a holistic treatment of ACA with\nmultiple collectives.",
      "pdf_url": "http://arxiv.org/pdf/2508.19149v1",
      "published": "2025-08-26T16:00:08+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19149v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "ZeST: an LLM-based Zero-Shot Traversability Navigation for Unknown Environments",
      "authors": [
        "Shreya Gummadi",
        "Mateus V. Gasparino",
        "Gianluca Capezzuto",
        "Marcelo Becker",
        "Girish Chowdhary"
      ],
      "abstract": "The advancement of robotics and autonomous navigation systems hinges on the\nability to accurately predict terrain traversability. Traditional methods for\ngenerating datasets to train these prediction models often involve putting\nrobots into potentially hazardous environments, posing risks to equipment and\nsafety. To solve this problem, we present ZeST, a novel approach leveraging\nvisual reasoning capabilities of Large Language Models (LLMs) to create a\ntraversability map in real-time without exposing robots to danger. Our approach\nnot only performs zero-shot traversability and mitigates the risks associated\nwith real-world data collection but also accelerates the development of\nadvanced navigation systems, offering a cost-effective and scalable solution.\nTo support our findings, we present navigation results, in both controlled\nindoor and unstructured outdoor environments. As shown in the experiments, our\nmethod provides safer navigation when compared to other state-of-the-art\nmethods, constantly reaching the final goal.",
      "pdf_url": "http://arxiv.org/pdf/2508.19131v1",
      "published": "2025-08-26T15:30:19+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19131v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "SecureV2X: An Efficient and Privacy-Preserving System for Vehicle-to-Everything (V2X) Applications",
      "authors": [
        "Joshua Lee",
        "Ali Arastehfard",
        "Weiran Liu",
        "Xuegang Ban",
        "Yuan Hong"
      ],
      "abstract": "Autonomous driving and V2X technologies have developed rapidly in the past\ndecade, leading to improved safety and efficiency in modern transportation.\nThese systems interact with extensive networks of vehicles, roadside\ninfrastructure, and cloud resources to support their machine learning\ncapabilities. However, the widespread use of machine learning in V2X systems\nraises issues over the privacy of the data involved. This is particularly\nconcerning for smart-transit and driver safety applications which can\nimplicitly reveal user locations or explicitly disclose medical data such as\nEEG signals. To resolve these issues, we propose SecureV2X, a scalable,\nmulti-agent system for secure neural network inferences deployed between the\nserver and each vehicle. Under this setting, we study two multi-agent V2X\napplications: secure drowsiness detection, and secure red-light violation\ndetection. Our system achieves strong performance relative to baselines, and\nscales efficiently to support a large number of secure computation interactions\nsimultaneously. For instance, SecureV2X is $9.4 \\times$ faster, requires\n$143\\times$ fewer computational rounds, and involves $16.6\\times$ less\ncommunication on drowsiness detection compared to other secure systems.\nMoreover, it achieves a runtime nearly $100\\times$ faster than state-of-the-art\nbenchmarks in object detection tasks for red light violation detection.",
      "pdf_url": "http://arxiv.org/pdf/2508.19115v1",
      "published": "2025-08-26T15:17:46+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19115v1",
      "categories": [
        "cs.CR",
        "cs.AI",
        "E.3; I.2.6; I.5.1; F.1.2"
      ]
    },
    {
      "title": "Hybrid Deep Searcher: Integrating Parallel and Sequential Search Reasoning",
      "authors": [
        "Dayoon Ko",
        "Jihyuk Kim",
        "Haeju Park",
        "Sohyeon Kim",
        "Dahyun Lee",
        "Yongrae Jo",
        "Gunhee Kim",
        "Moontae Lee",
        "Kyungjae Lee"
      ],
      "abstract": "Large reasoning models (LRMs) have demonstrated strong performance in\ncomplex, multi-step reasoning tasks. Existing methods enhance LRMs by\nsequentially integrating external knowledge retrieval; models iteratively\ngenerate queries, retrieve external information, and progressively reason over\nthis information. However, purely sequential querying increases inference\nlatency and context length, diminishing coherence and potentially reducing\naccuracy. To address these limitations, we introduce HDS-QA (Hybrid Deep Search\nQA), a synthetic dataset automatically generated from Natural Questions,\nexplicitly designed to train LRMs to distinguish parallelizable from sequential\nqueries. HDS-QA comprises hybrid-hop questions that combine parallelizable\nindependent subqueries (executable simultaneously) and sequentially dependent\nsubqueries (requiring step-by-step resolution), along with synthetic\nreasoning-querying-retrieval paths involving parallel queries. We fine-tune an\nLRM using HDS-QA, naming the model HybridDeepSearcher, which outperforms\nstate-of-the-art baselines across multiple benchmarks, notably achieving +15.9\nand +11.5 F1 on FanOutQA and a subset of BrowseComp, respectively, both\nrequiring comprehensive and exhaustive search. Experimental results highlight\ntwo key advantages: HybridDeepSearcher reaches comparable accuracy with fewer\nsearch turns, significantly reducing inference latency, and it effectively\nscales as more turns are permitted. These results demonstrate the efficiency,\nscalability, and effectiveness of explicitly training LRMs to leverage hybrid\nparallel and sequential querying.",
      "pdf_url": "http://arxiv.org/pdf/2508.19113v1",
      "published": "2025-08-26T15:15:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19113v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Reasoning LLMs in the Medical Domain: A Literature Survey",
      "authors": [
        "Armin Berger",
        "Sarthak Khanna",
        "David Berghaus",
        "Rafet Sifa"
      ],
      "abstract": "The emergence of advanced reasoning capabilities in Large Language Models\n(LLMs) marks a transformative development in healthcare applications. Beyond\nmerely expanding functional capabilities, these reasoning mechanisms enhance\ndecision transparency and explainability-critical requirements in medical\ncontexts. This survey examines the transformation of medical LLMs from basic\ninformation retrieval tools to sophisticated clinical reasoning systems capable\nof supporting complex healthcare decisions. We provide a thorough analysis of\nthe enabling technological foundations, with a particular focus on specialized\nprompting techniques like Chain-of-Thought and recent breakthroughs in\nReinforcement Learning exemplified by DeepSeek-R1. Our investigation evaluates\npurpose-built medical frameworks while also examining emerging paradigms such\nas multi-agent collaborative systems and innovative prompting architectures.\nThe survey critically assesses current evaluation methodologies for medical\nvalidation and addresses persistent challenges in field interpretation\nlimitations, bias mitigation strategies, patient safety frameworks, and\nintegration of multimodal clinical data. Through this survey, we seek to\nestablish a roadmap for developing reliable LLMs that can serve as effective\npartners in clinical practice and medical research.",
      "pdf_url": "http://arxiv.org/pdf/2508.19097v1",
      "published": "2025-08-26T14:59:19+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19097v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Trustworthy Agents for Electronic Health Records through Confidence Estimation",
      "authors": [
        "Yongwoo Song",
        "Minbyul Jeong",
        "Mujeen Sung"
      ],
      "abstract": "Large language models (LLMs) show promise for extracting information from\nElectronic Health Records (EHR) and supporting clinical decisions. However,\ndeployment in clinical settings faces challenges due to hallucination risks. We\npropose Hallucination Controlled Accuracy at k% (HCAcc@k%), a novel metric\nquantifying the accuracy-reliability trade-off at varying confidence\nthresholds. We introduce TrustEHRAgent, a confidence-aware agent incorporating\nstepwise confidence estimation for clinical question answering. Experiments on\nMIMIC-III and eICU datasets show TrustEHRAgent outperforms baselines under\nstrict reliability constraints, achieving improvements of 44.23%p and 25.34%p\nat HCAcc@70% while baseline methods fail at these thresholds. These results\nhighlight limitations of traditional accuracy metrics in evaluating healthcare\nAI agents. Our work contributes to developing trustworthy clinical agents that\ndeliver accurate information or transparently express uncertainty when\nconfidence is low.",
      "pdf_url": "http://arxiv.org/pdf/2508.19096v1",
      "published": "2025-08-26T14:59:04+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19096v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "APT-LLM: Exploiting Arbitrary-Precision Tensor Core Computing for LLM Acceleration",
      "authors": [
        "Shaobo Ma",
        "Chao Fang",
        "Haikuo Shao",
        "Zhongfeng Wang"
      ],
      "abstract": "Large language models (LLMs) have revolutionized AI applications, yet their\nenormous computational demands severely limit deployment and real-time\nperformance. Quantization methods can help reduce computational costs, however,\nattaining the extreme efficiency associated with ultra-low-bit quantized LLMs\nat arbitrary precision presents challenges on GPUs. This is primarily due to\nthe limited support for GPU Tensor Cores, inefficient memory management, and\ninflexible kernel optimizations. To tackle these challenges, we propose a\ncomprehensive acceleration scheme for arbitrary precision LLMs, namely APT-LLM.\nFirstly, we introduce a novel data format, bipolar-INT, which allows for\nefficient and lossless conversion with signed INT, while also being more\nconducive to parallel computation. We also develop a matrix multiplication\n(MatMul) method allowing for arbitrary precision by dismantling and\nreassembling matrices at the bit level. This method provides flexible precision\nand optimizes the utilization of GPU Tensor Cores. In addition, we propose a\nmemory management system focused on data recovery, which strategically employs\nfast shared memory to substantially increase kernel execution speed and reduce\nmemory access latency. Finally, we develop a kernel mapping method that\ndynamically selects the optimal configurable hyperparameters of kernels for\nvarying matrix sizes, enabling optimal performance across different LLM\narchitectures and precision settings. In LLM inference, APT-LLM achieves up to\na 3.99$\\times$ speedup compared to FP16 baselines and a 2.16$\\times$ speedup\nover NVIDIA CUTLASS INT4 acceleration on RTX 3090. On RTX 4090 and H800,\nAPT-LLM achieves up to 2.44$\\times$ speedup over FP16 and 1.65$\\times$ speedup\nover CUTLASS integer baselines.",
      "pdf_url": "http://arxiv.org/pdf/2508.19087v1",
      "published": "2025-08-26T14:48:29+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19087v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.AR"
      ]
    },
    {
      "title": "HiPlan: Hierarchical Planning for LLM-Based Agents with Adaptive Global-Local Guidance",
      "authors": [
        "Ziyue Li",
        "Yuan Chang",
        "Gaihong Yu",
        "Xiaoqiu Le"
      ],
      "abstract": "Large language model (LLM)-based agents have demonstrated remarkable\ncapabilities in decision-making tasks, but struggle significantly with complex,\nlong-horizon planning scenarios. This arises from their lack of macroscopic\nguidance, causing disorientation and failures in complex tasks, as well as\ninsufficient continuous oversight during execution, rendering them unresponsive\nto environmental changes and prone to deviations. To tackle these challenges,\nwe introduce HiPlan, a hierarchical planning framework that provides adaptive\nglobal-local guidance to boost LLM-based agents'decision-making. HiPlan\ndecomposes complex tasks into milestone action guides for general direction and\nstep-wise hints for detailed actions. During the offline phase, we construct a\nmilestone library from expert demonstrations, enabling structured experience\nreuse by retrieving semantically similar tasks and milestones. In the execution\nphase, trajectory segments from past milestones are dynamically adapted to\ngenerate step-wise hints that align current observations with the milestone\nobjectives, bridging gaps and correcting deviations. Extensive experiments\nacross two challenging benchmarks demonstrate that HiPlan substantially\noutperforms strong baselines, and ablation studies validate the complementary\nbenefits of its hierarchical components.",
      "pdf_url": "http://arxiv.org/pdf/2508.19076v1",
      "published": "2025-08-26T14:37:48+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19076v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "An LLM-powered Natural-to-Robotic Language Translation Framework with Correctness Guarantees",
      "authors": [
        "ZhenDong Chen",
        "ZhanShang Nie",
        "ShiXing Wan",
        "JunYi Li",
        "YongTian Cheng",
        "Shuai Zhao"
      ],
      "abstract": "The Large Language Models (LLM) are increasingly being deployed in robotics\nto generate robot control programs for specific user tasks, enabling embodied\nintelligence. Existing methods primarily focus on LLM training and prompt\ndesign that utilize LLMs to generate executable programs directly from user\ntasks in natural language. However, due to the inconsistency of the LLMs and\nthe high complexity of the tasks, such best-effort approaches often lead to\ntremendous programming errors in the generated code, which significantly\nundermines the effectiveness especially when the light-weight LLMs are applied.\nThis paper introduces a natural-robotic language translation framework that (i)\nprovides correctness verification for generated control programs and (ii)\nenhances the performance of LLMs in program generation via feedback-based\nfine-tuning for the programs. To achieve this, a Robot Skill Language (RSL) is\nproposed to abstract away from the intricate details of the control programs,\nbridging the natural language tasks with the underlying robot skills. Then, the\nRSL compiler and debugger are constructed to verify RSL programs generated by\nthe LLM and provide error feedback to the LLM for refining the outputs until\nbeing verified by the compiler. This provides correctness guarantees for the\nLLM-generated programs before being offloaded to the robots for execution,\nsignificantly enhancing the effectiveness of LLM-powered robotic applications.\nExperiments demonstrate NRTrans outperforms the existing method under a range\nof LLMs and tasks, and achieves a high success rate for light-weight LLMs.",
      "pdf_url": "http://arxiv.org/pdf/2508.19074v1",
      "published": "2025-08-26T14:32:49+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19074v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.PL"
      ]
    },
    {
      "title": "Attackers Strike Back? Not Anymore -- An Ensemble of RL Defenders Awakens for APT Detection",
      "authors": [
        "Sidahmed Benabderrahmane",
        "Talal Rahwan"
      ],
      "abstract": "Advanced Persistent Threats (APTs) represent a growing menace to modern\ndigital infrastructure. Unlike traditional cyberattacks, APTs are stealthy,\nadaptive, and long-lasting, often bypassing signature-based detection systems.\nThis paper introduces a novel framework for APT detection that unites deep\nlearning, reinforcement learning (RL), and active learning into a cohesive,\nadaptive defense system. Our system combines auto-encoders for latent\nbehavioral encoding with a multi-agent ensemble of RL-based defenders, each\ntrained to distinguish between benign and malicious process behaviors. We\nidentify a critical challenge in existing detection systems: their static\nnature and inability to adapt to evolving attack strategies. To this end, our\narchitecture includes multiple RL agents (Q-Learning, PPO, DQN, adversarial\ndefenders), each analyzing latent vectors generated by an auto-encoder. When\nany agent is uncertain about its decision, the system triggers an active\nlearning loop to simulate expert feedback, thus refining decision boundaries.\nAn ensemble voting mechanism, weighted by each agent's performance, ensures\nrobust final predictions.",
      "pdf_url": "http://arxiv.org/pdf/2508.19072v1",
      "published": "2025-08-26T14:29:10+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19072v1",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Dynamic Triangulation-Based Graph Rewiring for Graph Neural Networks",
      "authors": [
        "Hugo Attali",
        "Thomas Papastergiou",
        "Nathalie Pernelle",
        "Fragkiskos D. Malliaros"
      ],
      "abstract": "Graph Neural Networks (GNNs) have emerged as the leading paradigm for\nlearning over graph-structured data. However, their performance is limited by\nissues inherent to graph topology, most notably oversquashing and\noversmoothing. Recent advances in graph rewiring aim to mitigate these\nlimitations by modifying the graph topology to promote more effective\ninformation propagation. In this work, we introduce TRIGON, a novel framework\nthat constructs enriched, non-planar triangulations by learning to select\nrelevant triangles from multiple graph views. By jointly optimizing triangle\nselection and downstream classification performance, our method produces a\nrewired graph with markedly improved structural properties such as reduced\ndiameter, increased spectral gap, and lower effective resistance compared to\nexisting rewiring methods. Empirical results demonstrate that TRIGON\noutperforms state-of-the-art approaches on node classification tasks across a\nrange of homophilic and heterophilic benchmarks.",
      "pdf_url": "http://arxiv.org/pdf/2508.19071v1",
      "published": "2025-08-26T14:28:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19071v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Can Structured Templates Facilitate LLMs in Tackling Harder Tasks? : An Exploration of Scaling Laws by Difficulty",
      "authors": [
        "Zhichao Yang",
        "Zhaoxin Fan",
        "Gen Li",
        "Yuanze Hu",
        "Xinyu Wang",
        "Ye Qiu",
        "Xin Wang",
        "Yifan Sun",
        "Wenjun Wu"
      ],
      "abstract": "Structured, procedural reasoning is essential for Large Language Models\n(LLMs), especially in mathematics. While post-training methods have improved\nLLM performance, they still fall short in capturing deep procedural logic on\ncomplex tasks. To tackle the issue, in this paper, we first investigate this\nlimitation and uncover a novel finding: a Scaling Law by Difficulty, which\nreveals that model performance follows a U-shaped curve with respect to\ntraining data complexity -- excessive low-difficulty data impedes abstraction,\nwhile high-difficulty data significantly enhances reasoning ability. Motivated\nby this, we propose the Structured Solution Template (SST) framework, which\nuses solution templates and a curriculum of varied difficulty to explicitly\nteach procedural reasoning. Specifically, SST comprises (1) fine-tuning with\nstructured solution-template chains and dynamically weighted loss to prioritize\nprocedural logic, (2) prompt-time injection of solution templates as cognitive\nscaffolds to guide inference, and (3) integrated curriculum fine-tuning that\nexplicitly teaches the model to self-plan - execute - self-correct. Experiments\non GSM8K, AIME24, and new Dynamic En benchmark show that SST significantly\nimproves both accuracy and efficiency, especially on harder problems.",
      "pdf_url": "http://arxiv.org/pdf/2508.19069v1",
      "published": "2025-08-26T14:26:32+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19069v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Tackling Federated Unlearning as a Parameter Estimation Problem",
      "authors": [
        "Antonio Balordi",
        "Lorenzo Manini",
        "Fabio Stella",
        "Alessio Merlo"
      ],
      "abstract": "Privacy regulations require the erasure of data from deep learning models.\nThis is a significant challenge that is amplified in Federated Learning, where\ndata remains on clients, making full retraining or coordinated updates often\ninfeasible. This work introduces an efficient Federated Unlearning framework\nbased on information theory, modeling leakage as a parameter estimation\nproblem. Our method uses second-order Hessian information to identify and\nselectively reset only the parameters most sensitive to the data being\nforgotten, followed by minimal federated retraining. This model-agnostic\napproach supports categorical and client unlearning without requiring server\naccess to raw client data after initial information aggregation. Evaluations on\nbenchmark datasets demonstrate strong privacy (MIA success near random,\ncategorical knowledge erased) and high performance (Normalized Accuracy against\nre-trained benchmarks of $\\approx$ 0.9), while aiming for increased efficiency\nover complete retraining. Furthermore, in a targeted backdoor attack scenario,\nour framework effectively neutralizes the malicious trigger, restoring model\nintegrity. This offers a practical solution for data forgetting in FL.",
      "pdf_url": "http://arxiv.org/pdf/2508.19065v1",
      "published": "2025-08-26T14:24:45+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19065v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.IT",
        "math.IT"
      ]
    },
    {
      "title": "No Label Left Behind: A Unified Surface Defect Detection Model for all Supervision Regimes",
      "authors": [
        "Blaž Rolih",
        "Matic Fučka",
        "Danijel Skočaj"
      ],
      "abstract": "Surface defect detection is a critical task across numerous industries, aimed\nat efficiently identifying and localising imperfections or irregularities on\nmanufactured components. While numerous methods have been proposed, many fail\nto meet industrial demands for high performance, efficiency, and adaptability.\nExisting approaches are often constrained to specific supervision scenarios and\nstruggle to adapt to the diverse data annotations encountered in real-world\nmanufacturing processes, such as unsupervised, weakly supervised, mixed\nsupervision, and fully supervised settings. To address these challenges, we\npropose SuperSimpleNet, a highly efficient and adaptable discriminative model\nbuilt on the foundation of SimpleNet. SuperSimpleNet incorporates a novel\nsynthetic anomaly generation process, an enhanced classification head, and an\nimproved learning procedure, enabling efficient training in all four\nsupervision scenarios, making it the first model capable of fully leveraging\nall available data annotations. SuperSimpleNet sets a new standard for\nperformance across all scenarios, as demonstrated by its results on four\nchallenging benchmark datasets. Beyond accuracy, it is very fast, achieving an\ninference time below 10 ms. With its ability to unify diverse supervision\nparadigms while maintaining outstanding speed and reliability, SuperSimpleNet\nrepresents a promising step forward in addressing real-world manufacturing\nchallenges and bridging the gap between academic research and industrial\napplications. Code: https://github.com/blaz-r/SuperSimpleNet",
      "pdf_url": "http://arxiv.org/pdf/2508.19060v1",
      "published": "2025-08-26T14:20:21+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19060v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "A Concurrent Modular Agent: Framework for Autonomous LLM Agents",
      "authors": [
        "Norihiro Maruyama",
        "Takahide Yoshida",
        "Hiroki Sato",
        "Atsushi Masumori",
        "Johnsmith",
        "Takashi Ikegami"
      ],
      "abstract": "We introduce the Concurrent Modular Agent (CMA), a framework that\norchestrates multiple Large-Language-Model (LLM)-based modules that operate\nfully asynchronously yet maintain a coherent and fault-tolerant behavioral\nloop. This framework addresses long-standing difficulties in agent\narchitectures by letting intention emerge from language-mediated interactions\namong autonomous processes. This approach enables flexible, adaptive, and\ncontext-dependent behavior through the combination of concurrently executed\nmodules that offload reasoning to an LLM, inter-module communication, and a\nsingle shared global state.We consider this approach to be a practical\nrealization of Minsky's Society of Mind theory. We demonstrate the viability of\nour system through two practical use-case studies. The emergent properties\nobserved in our system suggest that complex cognitive phenomena like\nself-awareness may indeed arise from the organized interaction of simpler\nprocesses, supporting Minsky-Society of Mind concept and opening new avenues\nfor artificial intelligence research. The source code for our work is available\nat: https://github.com/AlternativeMachine/concurrent-modular-agent.",
      "pdf_url": "http://arxiv.org/pdf/2508.19042v1",
      "published": "2025-08-26T13:58:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19042v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Investigating Advanced Reasoning of Large Language Models via Black-Box Interaction",
      "authors": [
        "Congchi Yin",
        "Tianyi Wu",
        "Yankai Shu",
        "Alex Gu",
        "Yunhan Wang",
        "Jun Shao",
        "Xun Jiang",
        "Piji Li"
      ],
      "abstract": "Existing tasks fall short in evaluating reasoning ability of Large Language\nModels (LLMs) in an interactive, unknown environment. This deficiency leads to\nthe isolated assessment of deductive, inductive, and abductive reasoning,\nneglecting the integrated reasoning process that is indispensable for humans\ndiscovery of real world. We introduce a novel evaluation paradigm,\n\\textit{black-box interaction}, to tackle this challenge. A black-box is\ndefined by a hidden function that maps a specific set of inputs to outputs.\nLLMs are required to unravel the hidden function behind the black-box by\ninteracting with it in given exploration turns, and reasoning over observed\ninput-output pairs. Leveraging this idea, we build the \\textsc{Oracle}\nbenchmark which comprises 6 types of black-box task and 96 black-boxes. 19\nmodern LLMs are benchmarked. o3 ranks first in 5 of the 6 tasks, achieving over\n70\\% accuracy on most easy black-boxes. But it still struggles with some hard\nblack-box tasks, where its average performance drops below 40\\%. Further\nanalysis indicates a universal difficulty among LLMs: They lack the high-level\nplanning capability to develop efficient and adaptive exploration strategies\nfor hypothesis refinement.",
      "pdf_url": "http://arxiv.org/pdf/2508.19035v1",
      "published": "2025-08-26T13:54:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19035v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Metric Matters: A Formal Evaluation of Similarity Measures in Active Learning for Cyber Threat Intelligence",
      "authors": [
        "Sidahmed Benabderrahmane",
        "Talal Rahwan"
      ],
      "abstract": "Advanced Persistent Threats (APTs) pose a severe challenge to cyber defense\ndue to their stealthy behavior and the extreme class imbalance inherent in\ndetection datasets. To address these issues, we propose a novel active\nlearning-based anomaly detection framework that leverages similarity search to\niteratively refine the decision space. Built upon an Attention-Based\nAutoencoder, our approach uses feature-space similarity to identify normal-like\nand anomaly-like instances, thereby enhancing model robustness with minimal\noracle supervision. Crucially, we perform a formal evaluation of various\nsimilarity measures to understand their influence on sample selection and\nanomaly ranking effectiveness. Through experiments on diverse datasets,\nincluding DARPA Transparent Computing APT traces, we demonstrate that the\nchoice of similarity metric significantly impacts model convergence, anomaly\ndetection accuracy, and label efficiency. Our results offer actionable insights\nfor selecting similarity functions in active learning pipelines tailored for\nthreat intelligence and cyber defense.",
      "pdf_url": "http://arxiv.org/pdf/2508.19019v1",
      "published": "2025-08-26T13:34:30+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19019v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.NE"
      ]
    },
    {
      "title": "MAB Optimizer for Estimating Math Question Difficulty via Inverse CV without NLP",
      "authors": [
        "Surajit Das",
        "Gourav Roy",
        "Aleksei Eliseev",
        "Ram Kumar Rajendran"
      ],
      "abstract": "The evolution of technology and education is driving the emergence of\nIntelligent & Autonomous Tutoring Systems (IATS), where objective and\ndomain-agnostic methods for determining question difficulty are essential.\nTraditional human labeling is subjective, and existing NLP-based approaches\nfail in symbolic domains like algebra. This study introduces the Approach of\nPassive Measures among Educands (APME), a reinforcement learning-based\nMulti-Armed Bandit (MAB) framework that estimates difficulty solely from solver\nperformance data -- marks obtained and time taken -- without requiring\nlinguistic features or expert labels. By leveraging the inverse coefficient of\nvariation as a risk-adjusted metric, the model provides an explainable and\nscalable mechanism for adaptive assessment. Empirical validation was conducted\non three heterogeneous datasets. Across these diverse contexts, the model\nachieved an average R2 of 0.9213 and an average RMSE of 0.0584, confirming its\nrobustness, accuracy, and adaptability to different educational levels and\nassessment formats. Compared with baseline approaches-such as regression-based,\nNLP-driven, and IRT models-the proposed framework consistently outperformed\nalternatives, particularly in purely symbolic domains. The findings highlight\nthat (i) item heterogeneity strongly influences perceived difficulty, and (ii)\nvariance in solver outcomes is as critical as mean performance for adaptive\nallocation. Pedagogically, the model aligns with Vygotskys Zone of Proximal\nDevelopment by identifying tasks that balance challenge and attainability,\nsupporting motivation while minimizing disengagement. This domain-agnostic,\nself-supervised approach advances difficulty tagging in IATS and can be\nextended beyond algebra wherever solver interaction data is available",
      "pdf_url": "http://arxiv.org/pdf/2508.19014v1",
      "published": "2025-08-26T13:23:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19014v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "STDiff: A State Transition Diffusion Framework for Time Series Imputation in Industrial Systems",
      "authors": [
        "Gary Simethy",
        "Daniel Ortiz-Arroyo",
        "Petar Durdevic"
      ],
      "abstract": "Most deep learning methods for imputing missing values treat the task as\ncompleting patterns within a fixed time window. This assumption often fails in\nindustrial systems, where dynamics are driven by control actions, are highly\nnon-stationary, and can experience long, uninterrupted gaps. We propose STDiff,\nwhich reframes imputation as learning how the system evolves from one state to\nthe next. STDiff uses a conditional denoising diffusion model with a causal\nbias aligned to control theory, generating missing values step-by-step based on\nthe most recent known state and relevant control or environmental inputs. On a\npublic wastewater treatment dataset with simulated missing blocks, STDiff\nconsistently achieves the lowest errors, with its advantage increasing for\nlonger gaps. On a raw industrial dataset with substantial real gaps, it\nproduces trajectories that remain dynamically plausible, in contrast to\nwindow-based models that tend to flatten or over-smooth. These results support\ndynamics-aware, explicitly conditioned imputation as a robust approach for\nindustrial time series, and we discuss computational trade-offs and extensions\nto broader domains.",
      "pdf_url": "http://arxiv.org/pdf/2508.19011v1",
      "published": "2025-08-26T13:14:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19011v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Sense of Self and Time in Borderline Personality. A Comparative Robustness Study with Generative AI",
      "authors": [
        "Marcin Moskalewicz",
        "Anna Sterna",
        "Marek Pokropski",
        "Paula Flores"
      ],
      "abstract": "This study examines the capacity of large language models (LLMs) to support\nphenomenological qualitative analysis of first-person experience in Borderline\nPersonality Disorder (BPD), understood as a disorder of temporality and\nselfhood. Building on a prior human-led thematic analysis of 24 inpatients'\nlife-story interviews, we compared three LLMs (OpenAI GPT-4o, Google Gemini 2.5\nPro, Anthropic Claude Opus 4) prompted to mimic the interpretative style of the\noriginal investigators. The models were evaluated with blinded and non-blinded\nexpert judges in phenomenology and clinical psychology. Assessments included\nsemantic congruence, Jaccard coefficients, and multidimensional validity\nratings (credibility, coherence, substantiveness, and groundness in data).\nResults showed variable overlap with the human analysis, from 0 percent in GPT\nto 42 percent in Claude and 58 percent in Gemini, and a low Jaccard coefficient\n(0.21-0.28). However, the models recovered themes omitted by humans. Gemini's\noutput most closely resembled the human analysis, with validity scores\nsignificantly higher than GPT and Claude (p < 0.0001), and was judged as human\nby blinded experts. All scores strongly correlated (R > 0.78) with the quantity\nof text and words per theme, highlighting both the variability and potential of\nAI-augmented thematic analysis to mitigate human interpretative bias.",
      "pdf_url": "http://arxiv.org/pdf/2508.19008v1",
      "published": "2025-08-26T13:13:47+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19008v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Building Self-Evolving Agents via Experience-Driven Lifelong Learning: A Framework and Benchmark",
      "authors": [
        "Yuxuan Cai",
        "Yipeng Hao",
        "Jie Zhou",
        "Hang Yan",
        "Zhikai Lei",
        "Rui Zhen",
        "Zhenhua Han",
        "Yutao Yang",
        "Junsong Li",
        "Qianjun Pan",
        "Tianyu Huai",
        "Qin Chen",
        "Xin Li",
        "Kai Chen",
        "Bo Zhang",
        "Xipeng Qiu",
        "Liang He"
      ],
      "abstract": "As AI advances toward general intelligence, the focus is shifting from\nsystems optimized for static tasks to creating open-ended agents that learn\ncontinuously. In this paper, we introduce Experience-driven Lifelong Learning\n(ELL), a framework for building self-evolving agents capable of continuous\ngrowth through real-world interaction. The framework is built on four core\nprinciples: (1) Experience Exploration: Agents learn through continuous,\nself-motivated interaction with dynamic environments, navigating interdependent\ntasks and generating rich experiential trajectories. (2) Long-term Memory:\nAgents preserve and structure historical knowledge, including personal\nexperiences, domain expertise, and commonsense reasoning, into a persistent\nmemory system. (3) Skill Learning: Agents autonomously improve by abstracting\nrecurring patterns from experience into reusable skills, which are actively\nrefined and validated for application in new tasks. (4) Knowledge\nInternalization: Agents internalize explicit and discrete experiences into\nimplicit and intuitive capabilities as \"second nature\".\n  We also introduce StuLife, a benchmark dataset for ELL that simulates a\nstudent's holistic college journey, from enrollment to academic and personal\ndevelopment, across three core phases and ten detailed sub-scenarios. StuLife\nis designed around three key paradigm shifts: From Passive to Proactive, From\nContext to Memory, and From Imitation to Learning. In this dynamic environment,\nagents must acquire and distill practical skills and maintain persistent memory\nto make decisions based on evolving state variables. StuLife provides a\ncomprehensive platform for evaluating lifelong learning capabilities, including\nmemory retention, skill transfer, and self-motivated behavior. Beyond\nevaluating SOTA LLMs on the StuLife benchmark, we also explore the role of\ncontext engineering in advancing AGI.",
      "pdf_url": "http://arxiv.org/pdf/2508.19005v1",
      "published": "2025-08-26T13:04:28+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19005v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "AI Models Exceed Individual Human Accuracy in Predicting Everyday Social Norms",
      "authors": [
        "Pontus Strimling",
        "Simon Karlsson",
        "Irina Vartanova",
        "Kimmo Eriksson"
      ],
      "abstract": "A fundamental question in cognitive science concerns how social norms are\nacquired and represented. While humans typically learn norms through embodied\nsocial experience, we investigated whether large language models can achieve\nsophisticated norm understanding through statistical learning alone. Across two\nstudies, we systematically evaluated multiple AI systems' ability to predict\nhuman social appropriateness judgments for 555 everyday scenarios by examining\nhow closely they predicted the average judgment compared to each human\nparticipant. In Study 1, GPT-4.5's accuracy in predicting the collective\njudgment on a continuous scale exceeded that of every human participant (100th\npercentile). Study 2 replicated this, with Gemini 2.5 Pro outperforming 98.7%\nof humans, GPT-5 97.8%, and Claude Sonnet 4 96.0%. Despite this predictive\npower, all models showed systematic, correlated errors. These findings\ndemonstrate that sophisticated models of social cognition can emerge from\nstatistical learning over linguistic data alone, challenging strong versions of\ntheories emphasizing the exclusive necessity of embodied experience for\ncultural competence. The systematic nature of AI limitations across different\narchitectures indicates potential boundaries of pattern-based social\nunderstanding, while the models' ability to outperform nearly all individual\nhumans in this predictive task suggests that language serves as a remarkably\nrich repository for cultural knowledge transmission.",
      "pdf_url": "http://arxiv.org/pdf/2508.19004v1",
      "published": "2025-08-26T13:03:56+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19004v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "RoofSeg: An edge-aware transformer-based network for end-to-end roof plane segmentation",
      "authors": [
        "Siyuan You",
        "Guozheng Xu",
        "Pengwei Zhou",
        "Qiwen Jin",
        "Jian Yao",
        "Li Li"
      ],
      "abstract": "Roof plane segmentation is one of the key procedures for reconstructing\nthree-dimensional (3D) building models at levels of detail (LoD) 2 and 3 from\nairborne light detection and ranging (LiDAR) point clouds. The majority of\ncurrent approaches for roof plane segmentation rely on the manually designed or\nlearned features followed by some specifically designed geometric clustering\nstrategies. Because the learned features are more powerful than the manually\ndesigned features, the deep learning-based approaches usually perform better\nthan the traditional approaches. However, the current deep learning-based\napproaches have three unsolved problems. The first is that most of them are not\ntruly end-to-end, the plane segmentation results may be not optimal. The second\nis that the point feature discriminability near the edges is relatively low,\nleading to inaccurate planar edges. The third is that the planar geometric\ncharacteristics are not sufficiently considered to constrain the network\ntraining. To solve these issues, a novel edge-aware transformer-based network,\nnamed RoofSeg, is developed for segmenting roof planes from LiDAR point clouds\nin a truly end-to-end manner. In the RoofSeg, we leverage a transformer\nencoder-decoder-based framework to hierarchically predict the plane instance\nmasks with the use of a set of learnable plane queries. To further improve the\nsegmentation accuracy of edge regions, we also design an Edge-Aware Mask Module\n(EAMM) that sufficiently incorporates planar geometric prior of edges to\nenhance its discriminability for plane instance mask refinement. In addition,\nwe propose an adaptive weighting strategy in the mask loss to reduce the\ninfluence of misclassified points, and also propose a new plane geometric loss\nto constrain the network training.",
      "pdf_url": "http://arxiv.org/pdf/2508.19003v1",
      "published": "2025-08-26T13:03:05+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.19003v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "GitTaskBench: A Benchmark for Code Agents Solving Real-World Tasks Through Code Repository Leveraging",
      "authors": [
        "Ziyi Ni",
        "Huacan Wang",
        "Shuo Zhang",
        "Shuo Lu",
        "Ziyang He",
        "Wang You",
        "Zhenheng Tang",
        "Yuntao Du",
        "Bill Sun",
        "Hongzhang Liu",
        "Sen Hu",
        "Ronghao Chen",
        "Bo Li",
        "Xin Li",
        "Chen Hu",
        "Binxing Jiao",
        "Daxin Jiang",
        "Pin Lyu"
      ],
      "abstract": "Beyond scratch coding, exploiting large-scale code repositories (e.g.,\nGitHub) for practical tasks is vital in real-world software development, yet\ncurrent benchmarks rarely evaluate code agents in such authentic,\nworkflow-driven scenarios. To bridge this gap, we introduce GitTaskBench, a\nbenchmark designed to systematically assess this capability via 54 realistic\ntasks across 7 modalities and 7 domains. Each task pairs a relevant repository\nwith an automated, human-curated evaluation harness specifying practical\nsuccess criteria. Beyond measuring execution and task success, we also propose\nthe alpha-value metric to quantify the economic benefit of agent performance,\nwhich integrates task success rates, token cost, and average developer\nsalaries. Experiments across three state-of-the-art agent frameworks with\nmultiple advanced LLMs show that leveraging code repositories for complex task\nsolving remains challenging: even the best-performing system, OpenHands+Claude\n3.7, solves only 48.15% of tasks. Error analysis attributes over half of\nfailures to seemingly mundane yet critical steps like environment setup and\ndependency resolution, highlighting the need for more robust workflow\nmanagement and increased timeout preparedness. By releasing GitTaskBench, we\naim to drive progress and attention toward repository-aware code reasoning,\nexecution, and deployment -- moving agents closer to solving complex,\nend-to-end real-world tasks. The benchmark and code are open-sourced at\nhttps://github.com/QuantaAlpha/GitTaskBench.",
      "pdf_url": "http://arxiv.org/pdf/2508.18993v1",
      "published": "2025-08-26T12:48:05+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18993v1",
      "categories": [
        "cs.SE",
        "cs.AI"
      ]
    },
    {
      "title": "Automatic Prompt Optimization with Prompt Distillation",
      "authors": [
        "Viktor N. Zhuravlev",
        "Artur R. Khairullin",
        "Ernest A. Dyagin",
        "Alena N. Sitkina",
        "Nikita I. Kulin"
      ],
      "abstract": "Autoprompting is the process of automatically selecting optimized prompts for\nlanguage models, which is gaining popularity due to the rapid development of\nprompt engineering driven by extensive research in the field of large language\nmodels (LLMs). This paper presents DistillPrompt -- a novel autoprompting\nmethod based on large language models that employs a multi-stage integration of\ntask-specific information into prompts using training data. DistillPrompt\nutilizes distillation, compression, and aggregation operations to explore the\nprompt space more thoroughly. The method was tested on different datasets for\ntext classification and generation tasks using the t-lite-instruct-0.1 language\nmodel. The results demonstrate a significant average improvement (e.g., 20.12%\nacross the entire dataset compared to Grips) in key metrics over existing\nmethods in the field, establishing DistillPrompt as one of the most effective\nnon-gradient approaches in autoprompting.",
      "pdf_url": "http://arxiv.org/pdf/2508.18992v1",
      "published": "2025-08-26T12:46:58+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18992v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Interpretable by AI Mother Tongue: Native Symbolic Reasoning in Neural Models",
      "authors": [
        "Hung Ming Liu"
      ],
      "abstract": "We present a framework where neural models develop an AI Mother Tongue, a\nnative symbolic language that simultaneously supports intuitive reasoning,\ncompositional symbol chains, and inherent interpretability. Unlike post-hoc\nexplanation methods, our approach embeds reasoning directly into the model's\nrepresentations: symbols capture meaningful semantic patterns, chains trace\ndecision paths, and gated induction mechanisms guide selective focus, yielding\ntransparent yet flexible reasoning. We introduce complementary training\nobjectives to enhance symbol purity and decision sparsity, and employ a\nsequential specialization strategy to first build broad symbolic competence and\nthen refine intuitive judgments. Experiments on AI tasks demonstrate\ncompetitive accuracy alongside verifiable reasoning traces, showing that AI\nMother Tongue can serve as a unified mechanism for interpretability, intuition,\nand symbolic reasoning in neural models.",
      "pdf_url": "http://arxiv.org/pdf/2508.18988v1",
      "published": "2025-08-26T12:40:21+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18988v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Enabling MoE on the Edge via Importance-Driven Expert Scheduling",
      "authors": [
        "Guoying Zhu",
        "Meng Li",
        "Haipeng Dai",
        "Xuechen Liu",
        "Weijun Wang",
        "Keran Li",
        "Jun xiao",
        "Ligeng Chen",
        "Wei Wang"
      ],
      "abstract": "The Mixture of Experts (MoE) architecture has emerged as a key technique for\nscaling Large Language Models by activating only a subset of experts per query.\nDeploying MoE on consumer-grade edge hardware, however, is constrained by\nlimited device memory, making dynamic expert offloading essential. Unlike prior\nwork that treats offloading purely as a scheduling problem, we leverage expert\nimportance to guide decisions, substituting low-importance activated experts\nwith functionally similar ones already cached in GPU memory, thereby preserving\naccuracy. As a result, this design reduces memory usage and data transfer,\nwhile largely eliminating PCIe overhead. In addition, we introduce a scheduling\npolicy that maximizes the reuse ratio of GPU-cached experts, further boosting\nefficiency. Extensive evaluations show that our approach delivers 48% lower\ndecoding latency with over 60% expert cache hit rate, while maintaining nearly\nlossless accuracy.",
      "pdf_url": "http://arxiv.org/pdf/2508.18983v1",
      "published": "2025-08-26T12:32:09+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18983v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "PAX-TS: Model-agnostic multi-granular explanations for time series forecasting via localized perturbations",
      "authors": [
        "Tim Kreuzer",
        "Jelena Zdravkovic",
        "Panagiotis Papapetrou"
      ],
      "abstract": "Time series forecasting has seen considerable improvement during the last\nyears, with transformer models and large language models driving advancements\nof the state of the art. Modern forecasting models are generally opaque and do\nnot provide explanations for their forecasts, while well-known post-hoc\nexplainability methods like LIME are not suitable for the forecasting context.\nWe propose PAX-TS, a model-agnostic post-hoc algorithm to explain time series\nforecasting models and their forecasts. Our method is based on localized input\nperturbations and results in multi-granular explanations. Further, it is able\nto characterize cross-channel correlations for multivariate time series\nforecasts. We clearly outline the algorithmic procedure behind PAX-TS,\ndemonstrate it on a benchmark with 7 algorithms and 10 diverse datasets,\ncompare it with two other state-of-the-art explanation algorithms, and present\nthe different explanation types of the method. We found that the explanations\nof high-performing and low-performing algorithms differ on the same datasets,\nhighlighting that the explanations of PAX-TS effectively capture a model's\nbehavior. Based on time step correlation matrices resulting from the benchmark,\nwe identify 6 classes of patterns that repeatedly occur across different\ndatasets and algorithms. We found that the patterns are indicators of\nperformance, with noticeable differences in forecasting error between the\nclasses. Lastly, we outline a multivariate example where PAX-TS demonstrates\nhow the forecasting model takes cross-channel correlations into account. With\nPAX-TS, time series forecasting models' mechanisms can be illustrated in\ndifferent levels of detail, and its explanations can be used to answer\npractical questions on forecasts.",
      "pdf_url": "http://arxiv.org/pdf/2508.18982v1",
      "published": "2025-08-26T12:31:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18982v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "The point is the mask: scaling coral reef segmentation with weak supervision",
      "authors": [
        "Matteo Contini",
        "Victor Illien",
        "Sylvain Poulain",
        "Serge Bernard",
        "Julien Barde",
        "Sylvain Bonhommeau",
        "Alexis Joly"
      ],
      "abstract": "Monitoring coral reefs at large spatial scales remains an open challenge,\nessential for assessing ecosystem health and informing conservation efforts.\nWhile drone-based aerial imagery offers broad spatial coverage, its limited\nresolution makes it difficult to reliably distinguish fine-scale classes, such\nas coral morphotypes. At the same time, obtaining pixel-level annotations over\nlarge spatial extents is costly and labor-intensive, limiting the scalability\nof deep learning-based segmentation methods for aerial imagery. We present a\nmulti-scale weakly supervised semantic segmentation framework that addresses\nthis challenge by transferring fine-scale ecological information from\nunderwater imagery to aerial data. Our method enables large-scale coral reef\nmapping from drone imagery with minimal manual annotation, combining\nclassification-based supervision, spatial interpolation and self-distillation\ntechniques. We demonstrate the efficacy of the approach, enabling large-area\nsegmentation of coral morphotypes and demonstrating flexibility for integrating\nnew classes. This study presents a scalable, cost-effective methodology for\nhigh-resolution reef monitoring, combining low-cost data collection, weakly\nsupervised deep learning and multi-scale remote sensing.",
      "pdf_url": "http://arxiv.org/pdf/2508.18958v1",
      "published": "2025-08-26T11:58:50+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18958v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Novel Approaches to Artificial Intelligence Development Based on the Nearest Neighbor Method",
      "authors": [
        "I. I. Priezzhev",
        "D. A. Danko",
        "A. V. Shubin"
      ],
      "abstract": "Modern neural network technologies, including large language models, have\nachieved remarkable success in various applied artificial intelligence\napplications, however, they face a range of fundamental limitations. Among them\nare hallucination effects, high computational complexity of training and\ninference, costly fine-tuning, and catastrophic forgetting issues. These\nlimitations significantly hinder the use of neural networks in critical areas\nsuch as medicine, industrial process management, and scientific research. This\narticle proposes an alternative approach based on the nearest neighbors method\nwith hierarchical clustering structures. Employing the k-nearest neighbors\nalgorithm significantly reduces or completely eliminates hallucination effects\nwhile simplifying model expansion and fine-tuning without the need for\nretraining the entire network. To overcome the high computational load of the\nk-nearest neighbors method, the paper proposes using tree-like data structures\nbased on Kohonen self-organizing maps, thereby greatly accelerating nearest\nneighbor searches. Tests conducted on handwritten digit recognition and simple\nsubtitle translation tasks confirmed the effectiveness of the proposed\napproach. With only a slight reduction in accuracy, the nearest neighbor search\ntime was reduced hundreds of times compared to exhaustive search methods. The\nproposed method features transparency and interpretability, closely aligns with\nhuman cognitive mechanisms, and demonstrates potential for extensive use in\ntasks requiring high reliability and explainable results.",
      "pdf_url": "http://arxiv.org/pdf/2508.18953v1",
      "published": "2025-08-26T11:49:42+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18953v1",
      "categories": [
        "cs.AI",
        "I.2.6; I.2.8; I.5.1"
      ]
    },
    {
      "title": "VISION: Robust and Interpretable Code Vulnerability Detection Leveraging Counterfactual Augmentation",
      "authors": [
        "David Egea",
        "Barproda Halder",
        "Sanghamitra Dutta"
      ],
      "abstract": "Automated detection of vulnerabilities in source code is an essential\ncybersecurity challenge, underpinning trust in digital systems and services.\nGraph Neural Networks (GNNs) have emerged as a promising approach as they can\nlearn structural and logical code relationships in a data-driven manner.\nHowever, their performance is severely constrained by training data imbalances\nand label noise. GNNs often learn 'spurious' correlations from superficial code\nsimilarities, producing detectors that fail to generalize well to unseen\nreal-world data. In this work, we propose a unified framework for robust and\ninterpretable vulnerability detection, called VISION, to mitigate spurious\ncorrelations by systematically augmenting a counterfactual training dataset.\nCounterfactuals are samples with minimal semantic modifications but opposite\nlabels. Our framework includes: (i) generating counterfactuals by prompting a\nLarge Language Model (LLM); (ii) targeted GNN training on paired code examples\nwith opposite labels; and (iii) graph-based interpretability to identify the\ncrucial code statements relevant for vulnerability predictions while ignoring\nspurious ones. We find that VISION reduces spurious learning and enables more\nrobust, generalizable detection, improving overall accuracy (from 51.8% to\n97.8%), pairwise contrast accuracy (from 4.5% to 95.8%), and worst-group\naccuracy (from 0.7% to 85.5%) on the Common Weakness Enumeration (CWE)-20\nvulnerability. We further demonstrate gains using proposed metrics: intra-class\nattribution variance, inter-class attribution distance, and node score\ndependency. We also release CWE-20-CFA, a benchmark of 27,556 functions (real\nand counterfactual) from the high-impact CWE-20 category. Finally, VISION\nadvances transparent and trustworthy AI-based cybersecurity systems through\ninteractive visualization for human-in-the-loop analysis.",
      "pdf_url": "http://arxiv.org/pdf/2508.18933v1",
      "published": "2025-08-26T11:20:39+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18933v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Diverse And Private Synthetic Datasets Generation for RAG evaluation: A multi-agent framework",
      "authors": [
        "Ilias Driouich",
        "Hongliu Cao",
        "Eoin Thomas"
      ],
      "abstract": "Retrieval-augmented generation (RAG) systems improve large language model\noutputs by incorporating external knowledge, enabling more informed and\ncontext-aware responses. However, the effectiveness and trustworthiness of\nthese systems critically depends on how they are evaluated, particularly on\nwhether the evaluation process captures real-world constraints like protecting\nsensitive information. While current evaluation efforts for RAG systems have\nprimarily focused on the development of performance metrics, far less attention\nhas been given to the design and quality of the underlying evaluation datasets,\ndespite their pivotal role in enabling meaningful, reliable assessments. In\nthis work, we introduce a novel multi-agent framework for generating synthetic\nQA datasets for RAG evaluation that prioritize semantic diversity and privacy\npreservation. Our approach involves: (1) a Diversity agent leveraging\nclustering techniques to maximize topical coverage and semantic variability,\n(2) a Privacy Agent that detects and mask sensitive information across multiple\ndomains and (3) a QA curation agent that synthesizes private and diverse QA\npairs suitable as ground truth for RAG evaluation. Extensive experiments\ndemonstrate that our evaluation sets outperform baseline methods in diversity\nand achieve robust privacy masking on domain-specific datasets. This work\noffers a practical and ethically aligned pathway toward safer, more\ncomprehensive RAG system evaluation, laying the foundation for future\nenhancements aligned with evolving AI regulations and compliance standards.",
      "pdf_url": "http://arxiv.org/pdf/2508.18929v1",
      "published": "2025-08-26T11:16:14+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18929v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Who Is Lagging Behind: Profiling Student Behaviors with Graph-Level Encoding in Curriculum-Based Online Learning Systems",
      "authors": [
        "Qian Xiao",
        "Conn Breathnach",
        "Ioana Ghergulescu",
        "Conor O'Sullivan",
        "Keith Johnston",
        "Vincent Wade"
      ],
      "abstract": "The surge in the adoption of Intelligent Tutoring Systems (ITSs) in\neducation, while being integral to curriculum-based learning, can inadvertently\nexacerbate performance gaps. To address this problem, student profiling becomes\ncrucial for tracking progress, identifying struggling students, and alleviating\ndisparities among students. Such profiling requires measuring student behaviors\nand performance across different aspects, such as content coverage, learning\nintensity, and proficiency in different concepts within a learning topic.\n  In this study, we introduce CTGraph, a graph-level representation learning\napproach to profile learner behaviors and performance in a self-supervised\nmanner. Our experiments demonstrate that CTGraph can provide a holistic view of\nstudent learning journeys, accounting for different aspects of student\nbehaviors and performance, as well as variations in their learning paths as\naligned to the curriculum structure. We also show that our approach can\nidentify struggling students and provide comparative analysis of diverse groups\nto pinpoint when and where students are struggling. As such, our approach opens\nmore opportunities to empower educators with rich insights into student\nlearning journeys and paves the way for more targeted interventions.",
      "pdf_url": "http://arxiv.org/pdf/2508.18925v1",
      "published": "2025-08-26T11:03:00+00:00",
      "arxiv_url": "http://arxiv.org/abs/2508.18925v1",
      "categories": [
        "cs.AI"
      ]
    }
  ]
}