{
  "last_updated": "2025-10-23T00:50:28.744768",
  "papers": [
    {
      "title": "Grasp Any Region: Towards Precise, Contextual Pixel Understanding for Multimodal LLMs",
      "authors": [
        "Haochen Wang",
        "Yuhao Wang",
        "Tao Zhang",
        "Yikang Zhou",
        "Yanwei Li",
        "Jiacong Wang",
        "Jiani Zheng",
        "Ye Tian",
        "Jiahao Meng",
        "Zilong Huang",
        "Guangcan Mai",
        "Anran Wang",
        "Yunhai Tong",
        "Zhuochen Wang",
        "Xiangtai Li",
        "Zhaoxiang Zhang"
      ],
      "abstract": "While Multimodal Large Language Models (MLLMs) excel at holistic\nunderstanding, they struggle in capturing the dense world with complex scenes,\nrequiring fine-grained analysis of intricate details and object\ninter-relationships. Region-level MLLMs have been a promising step. However,\nprevious attempts are generally optimized to understand given regions in\nisolation, neglecting crucial global contexts. To address this, we introduce\nGrasp Any Region (GAR) for comprehen- sive region-level visual understanding.\nEmpowered by an effective RoI-aligned feature replay technique, GAR supports\n(1) precise perception by leveraging necessary global contexts, and (2)\nmodeling interactions between multiple prompts. Together, it then naturally\nachieves (3) advanced compositional reasoning to answer specific free-form\nquestions about any region, shifting the paradigm from passive description to\nactive dialogue. Moreover, we construct GAR-Bench, which not only provides a\nmore accurate evaluation of single-region comprehension, but also, more\nimportantly, measures interactions and complex reasoning across multiple\nregions. Extensive experiments have demonstrated that GAR-1B not only maintains\nthe state-of-the-art captioning capabilities, e.g., outperforming DAM-3B +4.5\non DLC-Bench, but also excels at modeling relationships between multiple\nprompts with advanced comprehension capabilities, even surpassing InternVL3-78B\non GAR-Bench-VQA. More importantly, our zero-shot GAR-8B even outperforms\nin-domain VideoRefer-7B on VideoRefer-BenchQ, indicating its strong\ncapabilities can be easily transferred to videos.",
      "pdf_url": "http://arxiv.org/pdf/2510.18876v2",
      "published": "2025-10-21T17:59:59+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18876v2",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "How Do LLMs Use Their Depth?",
      "authors": [
        "Akshat Gupta",
        "Jay Yeung",
        "Gopala Anumanchipalli",
        "Anna Ivanova"
      ],
      "abstract": "Growing evidence suggests that large language models do not use their depth\nuniformly, yet we still lack a fine-grained understanding of their layer-wise\nprediction dynamics. In this paper, we trace the intermediate representations\nof several open-weight models during inference and reveal a structured and\nnuanced use of depth. Specifically, we propose a \"Guess-then-Refine\" framework\nthat explains how LLMs internally structure their computations to make\npredictions. We first show that the top-ranked predictions in early LLM layers\nare composed primarily of high-frequency tokens, which act as statistical\nguesses proposed by the model early on due to the lack of appropriate\ncontextual information. As contextual information develops deeper into the\nmodel, these initial guesses get refined into contextually appropriate tokens.\nEven high-frequency token predictions from early layers get refined >70% of the\ntime, indicating that correct token prediction is not \"one-and-done\". We then\ngo beyond frequency-based prediction to examine the dynamic usage of layer\ndepth across three case studies. (i) Part-of-speech analysis shows that\nfunction words are, on average, the earliest to be predicted correctly. (ii)\nFact recall task analysis shows that, in a multi-token answer, the first token\nrequires more computational depth than the rest. (iii) Multiple-choice task\nanalysis shows that the model identifies the format of the response within the\nfirst half of the layers, but finalizes its response only toward the end.\nTogether, our results provide a detailed view of depth usage in LLMs, shedding\nlight on the layer-by-layer computations that underlie successful predictions\nand providing insights for future works to improve computational efficiency in\ntransformer-based models.",
      "pdf_url": "http://arxiv.org/pdf/2510.18871v1",
      "published": "2025-10-21T17:59:05+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18871v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "LightMem: Lightweight and Efficient Memory-Augmented Generation",
      "authors": [
        "Jizhan Fang",
        "Xinle Deng",
        "Haoming Xu",
        "Ziyan Jiang",
        "Yuqi Tang",
        "Ziwen Xu",
        "Shumin Deng",
        "Yunzhi Yao",
        "Mengru Wang",
        "Shuofei Qiao",
        "Huajun Chen",
        "Ningyu Zhang"
      ],
      "abstract": "Despite their remarkable capabilities, Large Language Models (LLMs) struggle\nto effectively leverage historical interaction information in dynamic and\ncomplex environments. Memory systems enable LLMs to move beyond stateless\ninteractions by introducing persistent information storage, retrieval, and\nutilization mechanisms. However, existing memory systems often introduce\nsubstantial time and computational overhead. To this end, we introduce a new\nmemory system called LightMem, which strikes a balance between the performance\nand efficiency of memory systems. Inspired by the Atkinson-Shiffrin model of\nhuman memory, LightMem organizes memory into three complementary stages. First,\ncognition-inspired sensory memory rapidly filters irrelevant information\nthrough lightweight compression and groups information according to their\ntopics. Next, topic-aware short-term memory consolidates these topic-based\ngroups, organizing and summarizing content for more structured access. Finally,\nlong-term memory with sleep-time update employs an offline procedure that\ndecouples consolidation from online inference. Experiments on LongMemEval with\nGPT and Qwen backbones show that LightMem outperforms strong baselines in\naccuracy (up to 10.9% gains) while reducing token usage by up to 117x, API\ncalls by up to 159x, and runtime by over 12x. The code is available at\nhttps://github.com/zjunlp/LightMem.",
      "pdf_url": "http://arxiv.org/pdf/2510.18866v1",
      "published": "2025-10-21T17:58:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18866v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CV",
        "cs.LG",
        "cs.MA"
      ]
    },
    {
      "title": "Every Step Evolves: Scaling Reinforcement Learning for Trillion-Scale Thinking Model",
      "authors": [
        "Ling Team",
        "Anqi Shen",
        "Baihui Li",
        "Bin Hu",
        "Bin Jing",
        "Cai Chen",
        "Chao Huang",
        "Chao Zhang",
        "Chaokun Yang",
        "Cheng Lin",
        "Chengyao Wen",
        "Congqi Li",
        "Deng Zhao",
        "Dingbo Yuan",
        "Donghai You",
        "Fagui Mao",
        "Fanzhuang Meng",
        "Feng Xu",
        "Guojie Li",
        "Guowei Wang",
        "Hao Dai",
        "Haonan Zheng",
        "Hong Liu",
        "Jia Guo",
        "Jiaming Liu",
        "Jian Liu",
        "Jianhao Fu",
        "Jiannan Shi",
        "Jianwen Wang",
        "Jianxin Lai",
        "Jin Yang",
        "Jun Mei",
        "Jun Zhou",
        "Junbo Zhao",
        "Junping Zhao",
        "Kuan Xu",
        "Le Su",
        "Lei Chen",
        "Li Tang",
        "Liang Jiang",
        "Liangcheng Fu",
        "Lianhao Xu",
        "Linfeng Shi",
        "Lisha Liao",
        "Longfei Zheng",
        "Meng Li",
        "Mingchun Chen",
        "Qi Zuo",
        "Qiang Cheng",
        "Qianggang Cao",
        "Qitao Shi",
        "Quanrui Guo",
        "Senlin Zhu",
        "Shaofei Wang",
        "Shaomian Zheng",
        "Shuaicheng Li",
        "Shuwei Gu",
        "Siba Chen",
        "Tao Wu",
        "Tao Zhang",
        "Tianyu Zhang",
        "Tianyu Zhou",
        "Tiwei Bie",
        "Tongkai Yang",
        "Wang Hong",
        "Wang Ren",
        "Weihua Chen",
        "Wenbo Yu",
        "Wengang Zheng",
        "Xiangchun Wang",
        "Xiaodong Yan",
        "Xiaopei Wan",
        "Xin Zhao",
        "Xinyu Kong",
        "Xinyu Tang",
        "Xudong Han",
        "Xudong Wang",
        "Xuemin Yang",
        "Xueyu Hu",
        "Yalin Zhang",
        "Yan Sun",
        "Yicheng Shan",
        "Yilong Wang",
        "Yingying Xu",
        "Yongkang Liu",
        "Yongzhen Guo",
        "Yuanyuan Wang",
        "Yuchen Yan",
        "Yuefan Wang",
        "Yuhong Guo",
        "Zehuan Li",
        "Zhankai Xu",
        "Zhe Li",
        "Zhenduo Zhang",
        "Zhengke Gui",
        "Zhenxuan Pan",
        "Zhenyu Huang",
        "Zhenzhong Lan",
        "Zhiqiang Ding",
        "Zhiqiang Zhang",
        "Zhixun Li",
        "Zhizhen Liu",
        "Zihao Wang",
        "Zujie Wen"
      ],
      "abstract": "We present Ring-1T, the first open-source, state-of-the-art thinking model\nwith a trillion-scale parameter. It features 1 trillion total parameters and\nactivates approximately 50 billion per token. Training such models at a\ntrillion-parameter scale introduces unprecedented challenges, including\ntrain-inference misalignment, inefficiencies in rollout processing, and\nbottlenecks in the RL system. To address these, we pioneer three interconnected\ninnovations: (1) IcePop stabilizes RL training via token-level discrepancy\nmasking and clipping, resolving instability from training-inference mismatches;\n(2) C3PO++ improves resource utilization for long rollouts under a token budget\nby dynamically partitioning them, thereby obtaining high time efficiency; and\n(3) ASystem, a high-performance RL framework designed to overcome the systemic\nbottlenecks that impede trillion-parameter model training. Ring-1T delivers\nbreakthrough results across critical benchmarks: 93.4 on AIME-2025, 86.72 on\nHMMT-2025, 2088 on CodeForces, and 55.94 on ARC-AGI-v1. Notably, it attains a\nsilver medal-level result on the IMO-2025, underscoring its exceptional\nreasoning capabilities. By releasing the complete 1T parameter MoE model to the\ncommunity, we provide the research community with direct access to cutting-edge\nreasoning capabilities. This contribution marks a significant milestone in\ndemocratizing large-scale reasoning intelligence and establishes a new baseline\nfor open-source model performance.",
      "pdf_url": "http://arxiv.org/pdf/2510.18855v1",
      "published": "2025-10-21T17:46:14+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18855v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Lyapunov-Aware Quantum-Inspired Reinforcement Learning for Continuous-Time Vehicle Control: A Feasibility Study",
      "authors": [
        "Nutkritta Kraipatthanapong",
        "Natthaphat Thathong",
        "Pannita Suksawas",
        "Thanunnut Klunklin",
        "Kritin Vongthonglua",
        "Krit Attahakul",
        "Aueaphum Aueawatthanaphisut"
      ],
      "abstract": "This paper presents a novel Lyapunov-Based Quantum Reinforcement Learning\n(LQRL) framework that integrates quantum policy optimization with Lyapunov\nstability analysis for continuous-time vehicle control. The proposed approach\ncombines the representational power of variational quantum circuits (VQCs) with\na stability-aware policy gradient mechanism to ensure asymptotic convergence\nand safe decision-making under dynamic environments. The vehicle longitudinal\ncontrol problem was formulated as a continuous-state reinforcement learning\ntask, where the quantum policy network generates control actions subject to\nLyapunov stability constraints. Simulation experiments were conducted in a\nclosed-loop adaptive cruise control scenario using a quantum-inspired policy\ntrained under stability feedback. The results demonstrate that the LQRL\nframework successfully embeds Lyapunov stability verification into quantum\npolicy learning, enabling interpretable and stability-aware control\nperformance. Although transient overshoot and Lyapunov divergence were observed\nunder aggressive acceleration, the system maintained bounded state evolution,\nvalidating the feasibility of integrating safety guarantees within quantum\nreinforcement learning architectures. The proposed framework provides a\nfoundational step toward provably safe quantum control in autonomous systems\nand hybrid quantum-classical optimization domains.",
      "pdf_url": "http://arxiv.org/pdf/2510.18852v1",
      "published": "2025-10-21T17:44:45+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18852v1",
      "categories": [
        "quant-ph",
        "cs.AI",
        "cs.LG",
        "cs.SY",
        "eess.SY"
      ]
    },
    {
      "title": "DP$^2$O-SR: Direct Perceptual Preference Optimization for Real-World Image Super-Resolution",
      "authors": [
        "Rongyuan Wu",
        "Lingchen Sun",
        "Zhengqiang Zhang",
        "Shihao Wang",
        "Tianhe Wu",
        "Qiaosi Yi",
        "Shuai Li",
        "Lei Zhang"
      ],
      "abstract": "Benefiting from pre-trained text-to-image (T2I) diffusion models, real-world\nimage super-resolution (Real-ISR) methods can synthesize rich and realistic\ndetails. However, due to the inherent stochasticity of T2I models, different\nnoise inputs often lead to outputs with varying perceptual quality. Although\nthis randomness is sometimes seen as a limitation, it also introduces a wider\nperceptual quality range, which can be exploited to improve Real-ISR\nperformance. To this end, we introduce Direct Perceptual Preference\nOptimization for Real-ISR (DP$^2$O-SR), a framework that aligns generative\nmodels with perceptual preferences without requiring costly human annotations.\nWe construct a hybrid reward signal by combining full-reference and\nno-reference image quality assessment (IQA) models trained on large-scale human\npreference datasets. This reward encourages both structural fidelity and\nnatural appearance. To better utilize perceptual diversity, we move beyond the\nstandard best-vs-worst selection and construct multiple preference pairs from\noutputs of the same model. Our analysis reveals that the optimal selection\nratio depends on model capacity: smaller models benefit from broader coverage,\nwhile larger models respond better to stronger contrast in supervision.\nFurthermore, we propose hierarchical preference optimization, which adaptively\nweights training pairs based on intra-group reward gaps and inter-group\ndiversity, enabling more efficient and stable learning. Extensive experiments\nacross both diffusion- and flow-based T2I backbones demonstrate that DP$^2$O-SR\nsignificantly improves perceptual quality and generalizes well to real-world\nbenchmarks.",
      "pdf_url": "http://arxiv.org/pdf/2510.18851v1",
      "published": "2025-10-21T17:43:23+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18851v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Towards Faithful and Controllable Personalization via Critique-Post-Edit Reinforcement Learning",
      "authors": [
        "Chenghao Zhu",
        "Meiling Tao",
        "Tiannan Wang",
        "Dongyi Ding",
        "Yuchen Eleanor Jiang",
        "Wangchunshu Zhou"
      ],
      "abstract": "Faithfully personalizing large language models (LLMs) to align with\nindividual user preferences is a critical but challenging task. While\nsupervised fine-tuning (SFT) quickly reaches a performance plateau, standard\nreinforcement learning from human feedback (RLHF) also struggles with the\nnuances of personalization. Scalar-based reward models are prone to reward\nhacking which leads to verbose and superficially personalized responses. To\naddress these limitations, we propose Critique-Post-Edit, a robust\nreinforcement learning framework that enables more faithful and controllable\npersonalization. Our framework integrates two key components: (1) a\nPersonalized Generative Reward Model (GRM) that provides multi-dimensional\nscores and textual critiques to resist reward hacking, and (2) a\nCritique-Post-Edit mechanism where the policy model revises its own outputs\nbased on these critiques for more targeted and efficient learning. Under a\nrigorous length-controlled evaluation, our method substantially outperforms\nstandard PPO on personalization benchmarks. Personalized Qwen2.5-7B achieves an\naverage 11\\% win-rate improvement, and personalized Qwen2.5-14B model surpasses\nthe performance of GPT-4.1. These results demonstrate a practical path to\nfaithful, efficient, and controllable personalization.",
      "pdf_url": "http://arxiv.org/pdf/2510.18849v1",
      "published": "2025-10-21T17:40:03+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18849v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Actor-Free Continuous Control via Structurally Maximizable Q-Functions",
      "authors": [
        "Yigit Korkmaz",
        "Urvi Bhuwania",
        "Ayush Jain",
        "Erdem Bıyık"
      ],
      "abstract": "Value-based algorithms are a cornerstone of off-policy reinforcement learning\ndue to their simplicity and training stability. However, their use has\ntraditionally been restricted to discrete action spaces, as they rely on\nestimating Q-values for individual state-action pairs. In continuous action\nspaces, evaluating the Q-value over the entire action space becomes\ncomputationally infeasible. To address this, actor-critic methods are typically\nemployed, where a critic is trained on off-policy data to estimate Q-values,\nand an actor is trained to maximize the critic's output. Despite their\npopularity, these methods often suffer from instability during training. In\nthis work, we propose a purely value-based framework for continuous control\nthat revisits structural maximization of Q-functions, introducing a set of key\narchitectural and algorithmic choices to enable efficient and stable learning.\nWe evaluate the proposed actor-free Q-learning approach on a range of standard\nsimulation tasks, demonstrating performance and sample efficiency on par with\nstate-of-the-art baselines, without the cost of learning a separate actor.\nParticularly, in environments with constrained action spaces, where the value\nfunctions are typically non-smooth, our method with structural maximization\noutperforms traditional actor-critic methods with gradient-based maximization.\nWe have released our code at https://github.com/USC-Lira/Q3C.",
      "pdf_url": "http://arxiv.org/pdf/2510.18828v1",
      "published": "2025-10-21T17:24:27+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18828v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO",
        "stat.ML"
      ]
    },
    {
      "title": "An Explainable Hybrid AI Framework for Enhanced Tuberculosis and Symptom Detection",
      "authors": [
        "Neel Patel",
        "Alexander Wong",
        "Ashkan Ebadi"
      ],
      "abstract": "Tuberculosis remains a critical global health issue, particularly in\nresource-limited and remote areas. Early detection is vital for treatment, yet\nthe lack of skilled radiologists underscores the need for artificial\nintelligence (AI)-driven screening tools. Developing reliable AI models is\nchallenging due to the necessity for large, high-quality datasets, which are\ncostly to obtain. To tackle this, we propose a teacher--student framework which\nenhances both disease and symptom detection on chest X-rays by integrating two\nsupervised heads and a self-supervised head. Our model achieves an accuracy of\n98.85% for distinguishing between COVID-19, tuberculosis, and normal cases, and\na macro-F1 score of 90.09% for multilabel symptom detection, significantly\noutperforming baselines. The explainability assessments also show the model\nbases its predictions on relevant anatomical features, demonstrating promise\nfor deployment in clinical screening and triage settings.",
      "pdf_url": "http://arxiv.org/pdf/2510.18819v1",
      "published": "2025-10-21T17:18:55+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18819v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Fine-Tuned Thoughts: Leveraging Chain-of-Thought Reasoning for Industrial Asset Health Monitoring",
      "authors": [
        "Shuxin Lin",
        "Dhaval Patel",
        "Christodoulos Constantinides"
      ],
      "abstract": "Small Language Models (SLMs) are becoming increasingly popular in specialized\nfields, such as industrial applications, due to their efficiency, lower\ncomputational requirements, and ability to be fine-tuned for domain-specific\ntasks, enabling accurate and cost-effective solutions. However, performing\ncomplex reasoning using SLMs in specialized fields such as Industry 4.0 remains\nchallenging. In this paper, we propose a knowledge distillation framework for\nindustrial asset health, which transfers reasoning capabilities via\nChain-of-Thought (CoT) distillation from Large Language Models (LLMs) to\nsmaller, more efficient models (SLMs). We discuss the advantages and the\nprocess of distilling LLMs using multi-choice question answering (MCQA) prompts\nto enhance reasoning and refine decision-making. We also perform in-context\nlearning to verify the quality of the generated knowledge and benchmark the\nperformance of fine-tuned SLMs with generated knowledge against widely used\nLLMs. The results show that the fine-tuned SLMs with CoT reasoning outperform\nthe base models by a significant margin, narrowing the gap to their LLM\ncounterparts. Our code is open-sourced at:\nhttps://github.com/IBM/FailureSensorIQ.",
      "pdf_url": "http://arxiv.org/pdf/2510.18817v1",
      "published": "2025-10-21T17:18:24+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18817v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Online SFT for LLM Reasoning: Surprising Effectiveness of Self-Tuning without Rewards",
      "authors": [
        "Mengqi Li",
        "Lei Zhao",
        "Anthony Man-Cho So",
        "Ruoyu Sun",
        "Xiao Li"
      ],
      "abstract": "We present a simple, self-help online supervised finetuning (OSFT) paradigm\nfor LLM reasoning. In this paradigm, the model generates its own responses and\nis immediately finetuned on this self-generated data. OSFT is a highly\nefficient training strategy for LLM reasoning, as it is reward-free and uses\njust one rollout by default. Experiment results show that OSFT achieves\ndownstream performance on challenging mathematical reasoning tasks comparable\nto strong reinforcement learning with verifiable rewards (RLVR) methods such as\nGRPO. Our ablation study further demonstrates the efficiency and robustness of\nOSFT. The major mechanism of OSFT lies in facilitating the model's own existing\npreference (latent knowledge) learned from pretraining, which leads to\nreasoning ability improvement. We believe that OSFT offers an efficient and\npromising alternative to more complex, reward-based training paradigms. Our\ncode is available at https://github.com/ElementQi/OnlineSFT.",
      "pdf_url": "http://arxiv.org/pdf/2510.18814v1",
      "published": "2025-10-21T17:15:56+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18814v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Decoding Funded Research: Comparative Analysis of Topic Models and Uncovering the Effect of Gender and Geographic Location",
      "authors": [
        "Shirin Tavakoli Kafiabad",
        "Andrea Schiffauerova",
        "Ashkan Ebadi"
      ],
      "abstract": "Optimizing national scientific investment requires a clear understanding of\nevolving research trends and the demographic and geographical forces shaping\nthem, particularly in light of commitments to equity, diversity, and inclusion.\nThis study addresses this need by analyzing 18 years (2005-2022) of research\nproposals funded by the Natural Sciences and Engineering Research Council of\nCanada (NSERC). We conducted a comprehensive comparative evaluation of three\ntopic modelling approaches: Latent Dirichlet Allocation (LDA), Structural Topic\nModelling (STM), and BERTopic. We also introduced a novel algorithm, named\nCOFFEE, designed to enable robust covariate effect estimation for BERTopic.\nThis advancement addresses a significant gap, as BERTopic lacks a native\nfunction for covariate analysis, unlike the probabilistic STM. Our findings\nhighlight that while all models effectively delineate core scientific domains,\nBERTopic outperformed by consistently identifying more granular, coherent, and\nemergent themes, such as the rapid expansion of artificial intelligence.\nAdditionally, the covariate analysis, powered by COFFEE, confirmed distinct\nprovincial research specializations and revealed consistent gender-based\nthematic patterns across various scientific disciplines. These insights offer a\nrobust empirical foundation for funding organizations to formulate more\nequitable and impactful funding strategies, thereby enhancing the effectiveness\nof the scientific ecosystem.",
      "pdf_url": "http://arxiv.org/pdf/2510.18803v1",
      "published": "2025-10-21T16:58:00+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18803v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Computational Foundations for Strategic Coopetition: Formalizing Interdependence and Complementarity",
      "authors": [
        "Vik Pant",
        "Eric Yu"
      ],
      "abstract": "Modern socio-technical systems are characterized by strategic coopetition\nwhere actors simultaneously cooperate to create value and compete to capture\nit. While conceptual modeling languages like i* provide rich qualitative\nrepresentations of strategic dependencies, they lack mechanisms for\nquantitative analysis of dynamic trade-offs. Conversely, classical game theory\noffers mathematical rigor but strips away contextual richness. This technical\nreport bridges this gap by developing computational foundations that formalize\ntwo critical dimensions of coopetition: interdependence and complementarity. We\nground interdependence in i* structural dependency analysis, translating\ndepender-dependee-dependum relationships into quantitative interdependence\ncoefficients through a structured translation framework. We formalize\ncomplementarity following Brandenburger and Nalebuff's Added Value concept,\nmodeling synergistic value creation with validated parameterization. We\nintegrate structural dependencies with bargaining power in value appropriation\nand introduce a game-theoretic formulation where Nash Equilibrium incorporates\nstructural interdependence. Validation combines comprehensive experimental\ntesting across power and logarithmic value function specifications,\ndemonstrating functional form robustness, with empirical application to the\nSamsung-Sony S-LCD joint venture (2004-2011), where logarithmic specifications\nachieve superior empirical fit (validation score 45/60) while power functions\nprovide theoretical tractability. This technical report serves as the\nfoundational reference for a coordinated research program examining strategic\ncoopetition in requirements engineering and multi-agent systems, with companion\nwork addressing trust dynamics, team production, and reciprocity mechanisms.",
      "pdf_url": "http://arxiv.org/pdf/2510.18802v1",
      "published": "2025-10-21T16:57:40+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18802v1",
      "categories": [
        "cs.MA",
        "cs.AI",
        "cs.SE"
      ]
    },
    {
      "title": "Seg the HAB: Language-Guided Geospatial Algae Bloom Reasoning and Segmentation",
      "authors": [
        "Patterson Hsieh",
        "Jerry Yeh",
        "Mao-Chi He",
        "Wen-Han Hsieh",
        "Elvis Hsieh"
      ],
      "abstract": "Climate change is intensifying the occurrence of harmful algal bloom (HAB),\nparticularly cyanobacteria, which threaten aquatic ecosystems and human health\nthrough oxygen depletion, toxin release, and disruption of marine biodiversity.\nTraditional monitoring approaches, such as manual water sampling, remain\nlabor-intensive and limited in spatial and temporal coverage. Recent advances\nin vision-language models (VLMs) for remote sensing have shown potential for\nscalable AI-driven solutions, yet challenges remain in reasoning over imagery\nand quantifying bloom severity. In this work, we introduce ALGae Observation\nand Segmentation (ALGOS), a segmentation-and-reasoning system for HAB\nmonitoring that combines remote sensing image understanding with severity\nestimation. Our approach integrates GeoSAM-assisted human evaluation for\nhigh-quality segmentation mask curation and fine-tunes vision language model on\nseverity prediction using the Cyanobacteria Aggregated Manual Labels (CAML)\nfrom NASA. Experiments demonstrate that ALGOS achieves robust performance on\nboth segmentation and severity-level estimation, paving the way toward\npractical and automated cyanobacterial monitoring systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.18751v1",
      "published": "2025-10-21T15:59:00+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18751v1",
      "categories": [
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Verifiable Accuracy and Abstention Rewards in Curriculum RL to Alleviate Lost-in-Conversation",
      "authors": [
        "Ming Li"
      ],
      "abstract": "Large Language Models demonstrate strong capabilities in single-turn\ninstruction following but suffer from Lost-in-Conversation (LiC), a degradation\nin performance as information is revealed progressively in multi-turn settings.\nMotivated by the current progress on Reinforcement Learning with Verifiable\nRewards (RLVR), we propose Curriculum Reinforcement Learning with Verifiable\nAccuracy and Abstention Rewards (RLAAR), a framework that encourages models not\nonly to generate correct answers, but also to judge the solvability of\nquestions in the multi-turn conversation setting. Our approach employs a\ncompetence-gated curriculum that incrementally increases dialogue difficulty\n(in terms of instruction shards), stabilizing training while promoting\nreliability. Using multi-turn, on-policy rollouts and a mixed-reward system,\nRLAAR teaches models to balance problem-solving with informed abstention,\nreducing premature answering behaviors that cause LiC. Evaluated on LiC\nbenchmarks, RLAAR significantly mitigates LiC performance decay (62.6% to\n75.1%) and improves calibrated abstention rates (33.5% to 73.4%). Together,\nthese results provide a practical recipe for building multi-turn reliable and\ntrustworthy LLMs.",
      "pdf_url": "http://arxiv.org/pdf/2510.18731v1",
      "published": "2025-10-21T15:32:26+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18731v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "HarmNet: A Framework for Adaptive Multi-Turn Jailbreak Attacks on Large Language Models",
      "authors": [
        "Sidhant Narula",
        "Javad Rafiei Asl",
        "Mohammad Ghasemigol",
        "Eduardo Blanco",
        "Daniel Takabi"
      ],
      "abstract": "Large Language Models (LLMs) remain vulnerable to multi-turn jailbreak\nattacks. We introduce HarmNet, a modular framework comprising ThoughtNet, a\nhierarchical semantic network; a feedback-driven Simulator for iterative query\nrefinement; and a Network Traverser for real-time adaptive attack execution.\nHarmNet systematically explores and refines the adversarial space to uncover\nstealthy, high-success attack paths. Experiments across closed-source and\nopen-source LLMs show that HarmNet outperforms state-of-the-art methods,\nachieving higher attack success rates. For example, on Mistral-7B, HarmNet\nachieves a 99.4% attack success rate, 13.9% higher than the best baseline.\nIndex terms: jailbreak attacks; large language models; adversarial framework;\nquery refinement.",
      "pdf_url": "http://arxiv.org/pdf/2510.18728v1",
      "published": "2025-10-21T15:28:20+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18728v1",
      "categories": [
        "cs.CR",
        "cs.AI"
      ]
    },
    {
      "title": "Causally Perturbed Fairness Testing",
      "authors": [
        "Chengwen Du",
        "Tao Chen"
      ],
      "abstract": "To mitigate unfair and unethical discrimination over sensitive features\n(e.g., gender, age, or race), fairness testing plays an integral role in\nengineering systems that leverage AI models to handle tabular data. A key\nchallenge therein is how to effectively reveal fairness bugs under an\nintractable sample size using perturbation. Much current work has been focusing\non designing the test sample generators, ignoring the valuable knowledge about\ndata characteristics that can help guide the perturbation and hence limiting\ntheir full potential. In this paper, we seek to bridge such a gap by proposing\na generic framework of causally perturbed fairness testing, dubbed CausalFT.\nThrough causal inference, the key idea of CausalFT is to extract the most\ndirectly and causally relevant non-sensitive feature to its sensitive\ncounterpart, which can jointly influence the prediction of the label. Such a\ncausal relationship is then seamlessly injected into the perturbation to guide\na test sample generator. Unlike existing generator-level work, CausalFT serves\nas a higher-level framework that can be paired with diverse base generators.\nExtensive experiments on 1296 cases confirm that CausalFT can considerably\nimprove arbitrary base generators in revealing fairness bugs over 93% of the\ncases with acceptable extra runtime overhead. Compared with a state-of-the-art\napproach that ranks the non-sensitive features solely based on correlation,\nCausalFT performs significantly better on 64% cases while being much more\nefficient. Further, CausalFT can better improve bias resilience in nearly all\ncases.",
      "pdf_url": "http://arxiv.org/pdf/2510.18719v1",
      "published": "2025-10-21T15:20:30+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18719v1",
      "categories": [
        "cs.SE",
        "cs.AI"
      ]
    },
    {
      "title": "Preference-based Reinforcement Learning beyond Pairwise Comparisons: Benefits of Multiple Options",
      "authors": [
        "Joongkyu Lee",
        "Seouh-won Yi",
        "Min-hwan Oh"
      ],
      "abstract": "We study online preference-based reinforcement learning (PbRL) with the goal\nof improving sample efficiency. While a growing body of theoretical work has\nemerged-motivated by PbRL's recent empirical success, particularly in aligning\nlarge language models (LLMs)-most existing studies focus only on pairwise\ncomparisons. A few recent works (Zhu et al., 2023, Mukherjee et al., 2024,\nThekumparampil et al., 2024) have explored using multiple comparisons and\nranking feedback, but their performance guarantees fail to improve-and can even\ndeteriorate-as the feedback length increases, despite the richer information\navailable. To address this gap, we adopt the Plackett-Luce (PL) model for\nranking feedback over action subsets and propose M-AUPO, an algorithm that\nselects multiple actions by maximizing the average uncertainty within the\noffered subset. We prove that M-AUPO achieves a suboptimality gap of\n$\\tilde{\\mathcal{O}}\\left( \\frac{d}{T} \\sqrt{ \\sum_{t=1}^T \\frac{1}{|S_t|}}\n\\right)$, where $T$ is the total number of rounds, $d$ is the feature\ndimension, and $|S_t|$ is the size of the subset at round $t$. This result\nshows that larger subsets directly lead to improved performance and, notably,\nthe bound avoids the exponential dependence on the unknown parameter's norm,\nwhich was a fundamental limitation in most previous works. Moreover, we\nestablish a near-matching lower bound of $\\Omega \\left( \\frac{d}{K \\sqrt{T}}\n\\right)$, where $K$ is the maximum subset size. To the best of our knowledge,\nthis is the first theoretical result in PbRL with ranking feedback that\nexplicitly shows improved sample efficiency as a function of the subset size.",
      "pdf_url": "http://arxiv.org/pdf/2510.18713v1",
      "published": "2025-10-21T15:11:01+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18713v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "Fetch.ai: An Architecture for Modern Multi-Agent Systems",
      "authors": [
        "Michael J. Wooldridge",
        "Attila Bagoly",
        "Jonathan J. Ward",
        "Emanuele La Malfa",
        "Gabriel Paludo Licks"
      ],
      "abstract": "Recent surges in LLM-driven intelligent systems largely overlook decades of\nfoundational multi-agent systems (MAS) research, resulting in frameworks with\ncritical limitations such as centralization and inadequate trust and\ncommunication protocols. This paper introduces the Fetch.ai architecture, an\nindustrial-strength platform designed to bridge this gap by facilitating the\nintegration of classical MAS principles with modern AI capabilities. We present\na novel, multi-layered solution built on a decentralized foundation of on-chain\nblockchain services for verifiable identity, discovery, and transactions. This\nis complemented by a comprehensive development framework for creating secure,\ninteroperable agents, a cloud-based platform for deployment, and an intelligent\norchestration layer where an agent-native LLM translates high-level human goals\ninto complex, multi-agent workflows. We demonstrate the deployed nature of this\nsystem through a decentralized logistics use case where autonomous agents\ndynamically discover, negotiate, and transact with one another securely.\nUltimately, the Fetch.ai stack provides a principled architecture for moving\nbeyond current agent implementations towards open, collaborative, and\neconomically sustainable multi-agent ecosystems.",
      "pdf_url": "http://arxiv.org/pdf/2510.18699v1",
      "published": "2025-10-21T14:53:56+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18699v1",
      "categories": [
        "cs.MA",
        "cs.AI"
      ]
    },
    {
      "title": "Exploring Membership Inference Vulnerabilities in Clinical Large Language Models",
      "authors": [
        "Alexander Nemecek",
        "Zebin Yun",
        "Zahra Rahmani",
        "Yaniv Harel",
        "Vipin Chaudhary",
        "Mahmood Sharif",
        "Erman Ayday"
      ],
      "abstract": "As large language models (LLMs) become progressively more embedded in\nclinical decision-support, documentation, and patient-information systems,\nensuring their privacy and trustworthiness has emerged as an imperative\nchallenge for the healthcare sector. Fine-tuning LLMs on sensitive electronic\nhealth record (EHR) data improves domain alignment but also raises the risk of\nexposing patient information through model behaviors. In this work-in-progress,\nwe present an exploratory empirical study on membership inference\nvulnerabilities in clinical LLMs, focusing on whether adversaries can infer if\nspecific patient records were used during model training. Using a\nstate-of-the-art clinical question-answering model, Llemr, we evaluate both\ncanonical loss-based attacks and a domain-motivated paraphrasing-based\nperturbation strategy that more realistically reflects clinical adversarial\nconditions. Our preliminary findings reveal limited but measurable membership\nleakage, suggesting that current clinical LLMs provide partial resistance yet\nremain susceptible to subtle privacy risks that could undermine trust in\nclinical AI adoption. These results motivate continued development of\ncontext-aware, domain-specific privacy evaluations and defenses such as\ndifferential privacy fine-tuning and paraphrase-aware training, to strengthen\nthe security and trustworthiness of healthcare AI systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.18674v1",
      "published": "2025-10-21T14:27:48+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18674v1",
      "categories": [
        "cs.CR",
        "cs.AI"
      ]
    },
    {
      "title": "Reasoning Language Model Inference Serving Unveiled: An Empirical Study",
      "authors": [
        "Qi Li",
        "Junpan Wu",
        "Xiang Liu",
        "Yuxin Wang",
        "Zeyu Li",
        "Zhenheng Tang",
        "Yuhan Chen",
        "Shaohuai Shi",
        "Xiaowen Chu"
      ],
      "abstract": "The reasoning large language model (RLLM) has been proven competitive in\nsolving complex reasoning tasks such as mathematics, coding, compared to\ngeneral LLM. However, the serving performance and behavior of RLLM remains\nunexplored, which may undermine the deployment and utilization of RLLM in\nreal-world scenario. To close this gap, in this paper, we conduct a\ncomprehensive study of RLLM service. We first perform a pilot study on\ncomparing the serving performance between RLLM and traditional LLM and reveal\nthat there are several distinct differences regarding serving behavior: (1)\nsignificant memory usage and fluctuations; (2) straggler requests; (3) adaptive\nrunning time; (4) domain preference. Then we further investigate whether\nexisting inference optimization techniques are valid for RLLM. Our main\ntakeaways are that model quantization methods and speculative decoding can\nimprove service system efficiency with small compromise to RLLM accuracy, while\nprefix caching, KV cache quantization may even degrade accuracy or serving\nperformance for small RLLM. Lastly, we conduct evaluation under real world\nworkload modeled by Gamma distribution to verify our findings. Empirical\nresults of real world workload evaluation across different dataset are aligned\nwith our main findings regarding RLLM serving. We hope our work can provide the\nresearch community and industry with insights to advance RLLM inference\nserving.",
      "pdf_url": "http://arxiv.org/pdf/2510.18672v1",
      "published": "2025-10-21T14:25:51+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18672v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Sherlock Your Queries: Learning to Ask the Right Questions for Dialogue-Based Retrieval",
      "authors": [
        "Dong Yun",
        "Marco Schouten",
        "Dim Papadopoulos"
      ],
      "abstract": "User queries in information retrieval are often ambiguous, making it\nchallenging for systems to identify a user's target from a single query. While\nrecent dialogue-based interactive retrieval systems can clarify user intent,\nthey are inefficient as they often lack an explicit strategy to ask the most\ninformative questions. To address this limitation, we propose SherlockLLM, a\ndialogue-driven retrieval framework that learns an optimal questioning strategy\nvia Reinforcement Learning (RL) and avoids the need for large-scale annotated\ndialogue data. In our framework, an agent is trained to generate a sequence of\nbinary questions to efficiently narrow down the search space. To validate our\napproach, we introduce a benchmark with both structured and unstructured tasks.\nExperimental results show that SherlockLLM is a robust and efficient solution.\nOn the structured tasks, its performance matches strong baselines and\napproaches the theoretical optimal defined by binary search. On the challenging\nunstructured task, our agent significantly outperforms these baselines,\nshowcasing its ability to learn a highly effective information-seeking dialogue\npolicy.",
      "pdf_url": "http://arxiv.org/pdf/2510.18659v1",
      "published": "2025-10-21T14:10:42+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18659v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Binary Quadratic Quantization: Beyond First-Order Quantization for Real-Valued Matrix Compression",
      "authors": [
        "Kyo Kuroki",
        "Yasuyuki Okoshi",
        "Thiem Van Chu",
        "Kazushi Kawamura",
        "Masato Motomura"
      ],
      "abstract": "This paper proposes a novel matrix quantization method, Binary Quadratic\nQuantization (BQQ). In contrast to conventional first-order quantization\napproaches, such as uniform quantization and binary coding quantization, that\napproximate real-valued matrices via linear combinations of binary bases, BQQ\nleverages the expressive power of binary quadratic expressions while\nmaintaining an extremely compact data format. We validate our approach with two\nexperiments: a matrix compression benchmark and post-training quantization\n(PTQ) on pretrained Vision Transformer-based models. Experimental results\ndemonstrate that BQQ consistently achieves a superior trade-off between memory\nefficiency and reconstruction error than conventional methods for compressing\ndiverse matrix data. It also delivers strong PTQ performance, even though we\nneither target state-of-the-art PTQ accuracy under tight memory constraints nor\nrely on PTQ-specific binary matrix optimization. For example, our proposed\nmethod outperforms the state-of-the-art PTQ method by up to 2.2\\% and 59.1% on\nthe ImageNet dataset under the calibration-based and data-free scenarios,\nrespectively, with quantization equivalent to 2 bits. These findings highlight\nthe surprising effectiveness of binary quadratic expressions for efficient\nmatrix approximation and neural network compression.",
      "pdf_url": "http://arxiv.org/pdf/2510.18650v1",
      "published": "2025-10-21T13:58:46+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18650v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG",
        "cs.NE"
      ]
    },
    {
      "title": "ε-Seg: Sparsely Supervised Semantic Segmentation of Microscopy Data",
      "authors": [
        "Sheida Rahnamai Kordasiabi",
        "Damian Dalle Nogare",
        "Florian Jug"
      ],
      "abstract": "Semantic segmentation of electron microscopy (EM) images of biological\nsamples remains a challenge in the life sciences. EM data captures details of\nbiological structures, sometimes with such complexity that even human observers\ncan find it overwhelming. We introduce {\\epsilon}-Seg, a method based on\nhierarchical variational autoencoders (HVAEs), employing center-region masking,\nsparse label contrastive learning (CL), a Gaussian mixture model (GMM) prior,\nand clustering-free label prediction. Center-region masking and the inpainting\nloss encourage the model to learn robust and representative embeddings to\ndistinguish the desired classes, even if training labels are sparse (0.05% of\nthe total image data or less). For optimal performance, we employ CL and a GMM\nprior to shape the latent space of the HVAE such that encoded input patches\ntend to cluster wrt. the semantic classes we wish to distinguish. Finally,\ninstead of clustering latent embeddings for semantic segmentation, we propose a\nMLP semantic segmentation head to directly predict class labels from latent\nembeddings. We show empirical results of {\\epsilon}-Seg and baseline methods on\n2 dense EM datasets of biological tissues and demonstrate the applicability of\nour method also on fluorescence microscopy data. Our results show that\n{\\epsilon}-Seg is capable of achieving competitive sparsely-supervised\nsegmentation results on complex biological image data, even if only limited\namounts of training labels are available.",
      "pdf_url": "http://arxiv.org/pdf/2510.18637v1",
      "published": "2025-10-21T13:41:07+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18637v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "C-SWAP: Explainability-Aware Structured Pruning for Efficient Neural Networks Compression",
      "authors": [
        "Baptiste Bauvin",
        "Loïc Baret",
        "Ola Ahmad"
      ],
      "abstract": "Neural network compression has gained increasing attention in recent years,\nparticularly in computer vision applications, where the need for model\nreduction is crucial for overcoming deployment constraints. Pruning is a widely\nused technique that prompts sparsity in model structures, e.g. weights,\nneurons, and layers, reducing size and inference costs. Structured pruning is\nespecially important as it allows for the removal of entire structures, which\nfurther accelerates inference time and reduces memory overhead. However, it can\nbe computationally expensive, requiring iterative retraining and optimization.\nTo overcome this problem, recent methods considered one-shot setting, which\napplies pruning directly at post-training. Unfortunately, they often lead to a\nconsiderable drop in performance. In this paper, we focus on this issue by\nproposing a novel one-shot pruning framework that relies on explainable deep\nlearning. First, we introduce a causal-aware pruning approach that leverages\ncause-effect relations between model predictions and structures in a\nprogressive pruning process. It allows us to efficiently reduce the size of the\nnetwork, ensuring that the removed structures do not deter the performance of\nthe model. Then, through experiments conducted on convolution neural network\nand vision transformer baselines, pre-trained on classification tasks, we\ndemonstrate that our method consistently achieves substantial reductions in\nmodel size, with minimal impact on performance, and without the need for\nfine-tuning. Overall, our approach outperforms its counterparts, offering the\nbest trade-off. Our code is available on GitHub.",
      "pdf_url": "http://arxiv.org/pdf/2510.18636v1",
      "published": "2025-10-21T13:40:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18636v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG",
        "cs.RO"
      ]
    },
    {
      "title": "Query Decomposition for RAG: Balancing Exploration-Exploitation",
      "authors": [
        "Roxana Petcu",
        "Kenton Murray",
        "Daniel Khashabi",
        "Evangelos Kanoulas",
        "Maarten de Rijke",
        "Dawn Lawrie",
        "Kevin Duh"
      ],
      "abstract": "Retrieval-augmented generation (RAG) systems address complex user requests by\ndecomposing them into subqueries, retrieving potentially relevant documents for\neach, and then aggregating them to generate an answer. Efficiently selecting\ninformative documents requires balancing a key trade-off: (i) retrieving\nbroadly enough to capture all the relevant material, and (ii) limiting\nretrieval to avoid excessive noise and computational cost. We formulate query\ndecomposition and document retrieval in an exploitation-exploration setting,\nwhere retrieving one document at a time builds a belief about the utility of a\ngiven sub-query and informs the decision to continue exploiting or exploring an\nalternative. We experiment with a variety of bandit learning methods and\ndemonstrate their effectiveness in dynamically selecting the most informative\nsub-queries. Our main finding is that estimating document relevance using rank\ninformation and human judgments yields a 35% gain in document-level precision,\n15% increase in {\\alpha}-nDCG, and better performance on the downstream task of\nlong-form generation.",
      "pdf_url": "http://arxiv.org/pdf/2510.18633v1",
      "published": "2025-10-21T13:37:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18633v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Think with 3D: Geometric Imagination Grounded Spatial Reasoning from Limited Views",
      "authors": [
        "Zhangquan Chen",
        "Manyuan Zhang",
        "Xinlei Yu",
        "Xufang Luo",
        "Mingze Sun",
        "Zihao Pan",
        "Yan Feng",
        "Peng Pei",
        "Xunliang Cai",
        "Ruqi Huang"
      ],
      "abstract": "Though recent advances in vision-language models (VLMs) have achieved\nremarkable progress across a wide range of multimodal tasks, understanding 3D\nspatial relationships from limited views remains a significant challenge.\nPrevious reasoning methods typically rely on pure text (e.g., topological\ncognitive maps) or on 2D visual cues. However, their limited representational\ncapacity hinders performance in specific tasks that require 3D spatial\nimagination. To address this limitation, we propose 3DThinker, a framework that\ncan effectively exploits the rich geometric information embedded within images\nwhile reasoning, like humans do. Our framework is the first to enable 3D\nmentaling during reasoning without any 3D prior input, and it does not rely on\nexplicitly labeled 3D data for training. Specifically, our training consists of\ntwo stages. First, we perform supervised training to align the 3D latent\ngenerated by VLM while reasoning with that of a 3D foundation model (e.g.,\nVGGT). Then, we optimize the entire reasoning trajectory solely based on\noutcome signals, thereby refining the underlying 3D mentaling. Extensive\nexperiments across multiple benchmarks show that 3DThinker consistently\noutperforms strong baselines and offers a new perspective toward unifying 3D\nrepresentations into multimodal reasoning. Our code will be available at\nhttps://github.com/zhangquanchen/3DThinker.",
      "pdf_url": "http://arxiv.org/pdf/2510.18632v1",
      "published": "2025-10-21T13:36:58+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18632v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "I.2.10"
      ]
    },
    {
      "title": "Comparative Expressivity for Structured Argumentation Frameworks with Uncertain Rules and Premises",
      "authors": [
        "Carlo Proietti",
        "Antonio Yuste-Ginel"
      ],
      "abstract": "Modelling qualitative uncertainty in formal argumentation is essential both\nfor practical applications and theoretical understanding. Yet, most of the\nexisting works focus on \\textit{abstract} models for arguing with uncertainty.\nFollowing a recent trend in the literature, we tackle the open question of\nstudying plausible instantiations of these abstract models. To do so, we ground\nthe uncertainty of arguments in their components, structured within rules and\npremises. Our main technical contributions are: i) the introduction of a notion\nof expressivity that can handle abstract and structured formalisms, and ii) the\npresentation of both negative and positive expressivity results, comparing the\nexpressivity of abstract and structured models of argumentation with\nuncertainty. These results affect incomplete abstract argumentation frameworks,\nand their extension with dependencies, on the abstract side, and ASPIC+, on the\nstructured side.",
      "pdf_url": "http://arxiv.org/pdf/2510.18631v1",
      "published": "2025-10-21T13:36:38+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18631v1",
      "categories": [
        "cs.AI",
        "cs.LO",
        "03B60"
      ]
    },
    {
      "title": "Leveraging Association Rules for Better Predictions and Better Explanations",
      "authors": [
        "Gilles Audemard",
        "Sylvie Coste-Marquis",
        "Pierre Marquis",
        "Mehdi Sabiri",
        "Nicolas Szczepanski"
      ],
      "abstract": "We present a new approach to classification that combines data and knowledge.\nIn this approach, data mining is used to derive association rules (possibly\nwith negations) from data. Those rules are leveraged to increase the predictive\nperformance of tree-based models (decision trees and random forests) used for a\nclassification task. They are also used to improve the corresponding\nexplanation task through the generation of abductive explanations that are more\ngeneral than those derivable without taking such rules into account.\nExperiments show that for the two tree-based models under consideration,\nbenefits can be offered by the approach in terms of predictive performance and\nin terms of explanation sizes.",
      "pdf_url": "http://arxiv.org/pdf/2510.18628v1",
      "published": "2025-10-21T13:32:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18628v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "VAR: Visual Attention Reasoning via Structured Search and Backtracking",
      "authors": [
        "Wei Cai",
        "Jian Zhao",
        "Yuchen Yuan",
        "Tianle Zhang",
        "Ming Zhu",
        "Haichuan Tang",
        "Chi Zhang",
        "Xuelong Li"
      ],
      "abstract": "Multimodal Large Language Models (MLLMs), despite their advances, are\nhindered by their high hallucination tendency and heavy reliance on brittle,\nlinear reasoning processes, leading to failures in complex tasks. To address\nthese limitations, we introduce Visual Attention Reasoning (VAR), a novel\nframework that recasts grounded reasoning as a structured search over a\nreasoning trajectory space. VAR decomposes the reasoning process into two key\nstages: traceable evidence grounding and search-based chain-of-thought (CoT)\ngeneration, which incorporates a backtracking mechanism for self-correction.\nThe search is guided by a multi-faceted reward function with semantic and\ngeometric self-verification components, which penalize outputs that are not\nfaithfully grounded in the visual input. We provide a theoretical analysis for\nour search strategy, validating its capability to find the correct solution\nwith high probability. Experimental results show that our 7B model, VAR-7B,\nsets a new state-of-the-art on a comprehensive suite of hallucination and\nsafety benchmarks, significantly outperforming existing open-source models and\ndemonstrating competitive performance against leading proprietary systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.18619v1",
      "published": "2025-10-21T13:18:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18619v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "A Rectification-Based Approach for Distilling Boosted Trees into Decision Trees",
      "authors": [
        "Gilles Audemard",
        "Sylvie Coste-Marquis",
        "Pierre Marquis",
        "Mehdi Sabiri",
        "Nicolas Szczepanski"
      ],
      "abstract": "We present a new approach for distilling boosted trees into decision trees,\nin the objective of generating an ML model offering an acceptable compromise in\nterms of predictive performance and interpretability. We explain how the\ncorrection approach called rectification can be used to implement such a\ndistillation process. We show empirically that this approach provides\ninteresting results, in comparison with an approach to distillation achieved by\nretraining the model.",
      "pdf_url": "http://arxiv.org/pdf/2510.18615v1",
      "published": "2025-10-21T13:14:04+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18615v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "The Cost-Benefit of Interdisciplinarity in AI for Mental Health",
      "authors": [
        "Katerina Drakos",
        "Eva Paraschou",
        "Simay Toplu",
        "Line Harder Clemmensen",
        "Christoph Lütge",
        "Nicole Nadine Lønfeldt",
        "Sneha Das"
      ],
      "abstract": "Artificial intelligence has been introduced as a way to improve access to\nmental health support. However, most AI mental health chatbots rely on a\nlimited range of disciplinary input, and fail to integrate expertise across the\nchatbot's lifecycle. This paper examines the cost-benefit trade-off of\ninterdisciplinary collaboration in AI mental health chatbots. We argue that\ninvolving experts from technology, healthcare, ethics, and law across key\nlifecycle phases is essential to ensure value-alignment and compliance with the\nhigh-risk requirements of the AI Act. We also highlight practical\nrecommendations and existing frameworks to help balance the challenges and\nbenefits of interdisciplinarity in mental health chatbots.",
      "pdf_url": "http://arxiv.org/pdf/2510.18581v1",
      "published": "2025-10-21T12:34:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18581v1",
      "categories": [
        "cs.CY",
        "cs.AI"
      ]
    },
    {
      "title": "Kaleido: Open-Sourced Multi-Subject Reference Video Generation Model",
      "authors": [
        "Zhenxing Zhang",
        "Jiayan Teng",
        "Zhuoyi Yang",
        "Tiankun Cao",
        "Cheng Wang",
        "Xiaotao Gu",
        "Jie Tang",
        "Dan Guo",
        "Meng Wang"
      ],
      "abstract": "We present Kaleido, a subject-to-video~(S2V) generation framework, which aims\nto synthesize subject-consistent videos conditioned on multiple reference\nimages of target subjects. Despite recent progress in S2V generation models,\nexisting approaches remain inadequate at maintaining multi-subject consistency\nand at handling background disentanglement, often resulting in lower reference\nfidelity and semantic drift under multi-image conditioning. These shortcomings\ncan be attributed to several factors. Primarily, the training dataset suffers\nfrom a lack of diversity and high-quality samples, as well as cross-paired\ndata, i.e., paired samples whose components originate from different instances.\nIn addition, the current mechanism for integrating multiple reference images is\nsuboptimal, potentially resulting in the confusion of multiple subjects. To\novercome these limitations, we propose a dedicated data construction pipeline,\nincorporating low-quality sample filtering and diverse data synthesis, to\nproduce consistency-preserving training data. Moreover, we introduce Reference\nRotary Positional Encoding (R-RoPE) to process reference images, enabling\nstable and precise multi-image integration. Extensive experiments across\nnumerous benchmarks demonstrate that Kaleido significantly outperforms previous\nmethods in consistency, fidelity, and generalization, marking an advance in S2V\ngeneration.",
      "pdf_url": "http://arxiv.org/pdf/2510.18573v1",
      "published": "2025-10-21T12:28:14+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18573v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "QuantEvolve: Automating Quantitative Strategy Discovery through Multi-Agent Evolutionary Framework",
      "authors": [
        "Junhyeog Yun",
        "Hyoun Jun Lee",
        "Insu Jeon"
      ],
      "abstract": "Automating quantitative trading strategy development in dynamic markets is\nchallenging, especially with increasing demand for personalized investment\nsolutions. Existing methods often fail to explore the vast strategy space while\npreserving the diversity essential for robust performance across changing\nmarket conditions. We present QuantEvolve, an evolutionary framework that\ncombines quality-diversity optimization with hypothesis-driven strategy\ngeneration. QuantEvolve employs a feature map aligned with investor\npreferences, such as strategy type, risk profile, turnover, and return\ncharacteristics, to maintain a diverse set of effective strategies. It also\nintegrates a hypothesis-driven multi-agent system to systematically explore the\nstrategy space through iterative generation and evaluation. This approach\nproduces diverse, sophisticated strategies that adapt to both market regime\nshifts and individual investment needs. Empirical results show that QuantEvolve\noutperforms conventional baselines, validating its effectiveness. We release a\ndataset of evolved strategies to support future research.",
      "pdf_url": "http://arxiv.org/pdf/2510.18569v1",
      "published": "2025-10-21T12:22:16+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18569v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Large language models for folktale type automation based on motifs: Cinderella case study",
      "authors": [
        "Tjaša Arčon",
        "Marko Robnik-Šikonja",
        "Polona Tratnik"
      ],
      "abstract": "Artificial intelligence approaches are being adapted to many research areas,\nincluding digital humanities. We built a methodology for large-scale analyses\nin folkloristics. Using machine learning and natural language processing, we\nautomatically detected motifs in a large collection of Cinderella variants and\nanalysed their similarities and differences with clustering and dimensionality\nreduction. The results show that large language models detect complex\ninteractions in tales, enabling computational analysis of extensive text\ncollections and facilitating cross-lingual comparisons.",
      "pdf_url": "http://arxiv.org/pdf/2510.18561v1",
      "published": "2025-10-21T12:18:20+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18561v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "WebDevJudge: Evaluating (M)LLMs as Critiques for Web Development Quality",
      "authors": [
        "Chunyang Li",
        "Yilun Zheng",
        "Xinting Huang",
        "Tianqing Fang",
        "Jiahao Xu",
        "Yangqiu Song",
        "Lihui Chen",
        "Han Hu"
      ],
      "abstract": "The paradigm of LLM-as-a-judge is emerging as a scalable and efficient\nalternative to human evaluation, demonstrating strong performance on\nwell-defined tasks. However, its reliability in open-ended tasks with dynamic\nenvironments and complex interactions remains unexplored. To bridge the gap, we\nintroduce WebDevJudge, a systematic benchmark for assessing LLM-as-a-judge\nperformance in web development, with support for both non-interactive\nevaluation based on static observations and continuous interactive evaluation\nwith a dynamic web environment. WebDevJudge comprises human preference labels\nover paired web implementations, annotated with structured and query-grounded\nrubrics to ensure high-quality ground truth. Using this benchmark, we\ncomprehensively evaluate various evaluators, including LLMs, MLLMs, and agentic\nworkflows. We systematically investigate the impact of different paradigms and\nguidance mechanisms. Our experiments reveal a significant gap between LLM\njudges and human experts. In-depth analysis indicates this gap stems from\nfundamental model limitations, including failures in recognizing functional\nequivalence, verifying task feasibility, and mitigating bias. Overall,\nWebDevJudge presents a significant challenge to LLM-as-a-judge, offering\ninsights to guide future research toward developing more reliable and capable\nautomated evaluators for complicated scenarios. Code and data are available at\nhttps://github.com/lcy2723/WebDevJudge.",
      "pdf_url": "http://arxiv.org/pdf/2510.18560v1",
      "published": "2025-10-21T12:16:04+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18560v1",
      "categories": [
        "cs.SE",
        "cs.AI"
      ]
    },
    {
      "title": "RAISE: A Unified Framework for Responsible AI Scoring and Evaluation",
      "authors": [
        "Loc Phuc Truong Nguyen",
        "Hung Thanh Do"
      ],
      "abstract": "As AI systems enter high-stakes domains, evaluation must extend beyond\npredictive accuracy to include explainability, fairness, robustness, and\nsustainability. We introduce RAISE (Responsible AI Scoring and Evaluation), a\nunified framework that quantifies model performance across these four\ndimensions and aggregates them into a single, holistic Responsibility Score. We\nevaluated three deep learning models: a Multilayer Perceptron (MLP), a Tabular\nResNet, and a Feature Tokenizer Transformer, on structured datasets from\nfinance, healthcare, and socioeconomics. Our findings reveal critical\ntrade-offs: the MLP demonstrated strong sustainability and robustness, the\nTransformer excelled in explainability and fairness at a very high\nenvironmental cost, and the Tabular ResNet offered a balanced profile. These\nresults underscore that no single model dominates across all responsibility\ncriteria, highlighting the necessity of multi-dimensional evaluation for\nresponsible model selection. Our implementation is available at:\nhttps://github.com/raise-framework/raise.",
      "pdf_url": "http://arxiv.org/pdf/2510.18559v1",
      "published": "2025-10-21T12:15:13+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18559v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CE",
        "cs.CY"
      ]
    },
    {
      "title": "Extracting alignment data in open models",
      "authors": [
        "Federico Barbero",
        "Xiangming Gu",
        "Christopher A. Choquette-Choo",
        "Chawin Sitawarin",
        "Matthew Jagielski",
        "Itay Yona",
        "Petar Veličković",
        "Ilia Shumailov",
        "Jamie Hayes"
      ],
      "abstract": "In this work, we show that it is possible to extract significant amounts of\nalignment training data from a post-trained model -- useful to steer the model\nto improve certain capabilities such as long-context reasoning, safety,\ninstruction following, and maths. While the majority of related work on\nmemorisation has focused on measuring success of training data extraction\nthrough string matching, we argue that embedding models are better suited for\nour specific goals. Distances measured through a high quality embedding model\ncan identify semantic similarities between strings that a different metric such\nas edit distance will struggle to capture. In fact, in our investigation,\napproximate string matching would have severely undercounted (by a conservative\nestimate of $10\\times$) the amount of data that can be extracted due to trivial\nartifacts that deflate the metric. Interestingly, we find that models readily\nregurgitate training data that was used in post-training phases such as SFT or\nRL. We show that this data can be then used to train a base model, recovering a\nmeaningful amount of the original performance. We believe our work exposes a\npossibly overlooked risk towards extracting alignment data. Finally, our work\nopens up an interesting discussion on the downstream effects of distillation\npractices: since models seem to be regurgitating aspects of their training set,\ndistillation can therefore be thought of as indirectly training on the model's\noriginal dataset.",
      "pdf_url": "http://arxiv.org/pdf/2510.18554v1",
      "published": "2025-10-21T12:06:00+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18554v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "SOCIA-Nabla: Textual Gradient Meets Multi-Agent Orchestration for Automated Simulator Generation",
      "authors": [
        "Yuncheng Hua",
        "Sion Weatherhead",
        "Mehdi Jafari",
        "Hao Xue",
        "Flora D. Salim"
      ],
      "abstract": "In this paper, we present SOCIA-Nabla, an end-to-end, agentic framework that\ntreats simulator construction asinstance optimization over code within a\ntextual computation graph. Specialized LLM-driven agents are embedded as graph\nnodes, and a workflow manager executes a loss-driven loop: code synthesis ->\nexecution -> evaluation -> code repair. The optimizer performs Textual-Gradient\nDescent (TGD), while human-in-the-loop interaction is reserved for task-spec\nconfirmation, minimizing expert effort and keeping the code itself as the\ntrainable object. Across three CPS tasks, i.e., User Modeling, Mask Adoption,\nand Personal Mobility, SOCIA-Nabla attains state-of-the-art overall accuracy.\nBy unifying multi-agent orchestration with a loss-aligned optimization view,\nSOCIA-Nabla converts brittle prompt pipelines into reproducible,\nconstraint-aware simulator code generation that scales across domains and\nsimulation granularities. This work is under review, and we will release the\ncode soon.",
      "pdf_url": "http://arxiv.org/pdf/2510.18551v1",
      "published": "2025-10-21T12:00:00+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18551v1",
      "categories": [
        "cs.AI",
        "I.2.7"
      ]
    },
    {
      "title": "EfficientNav: Towards On-Device Object-Goal Navigation with Navigation Map Caching and Retrieval",
      "authors": [
        "Zebin Yang",
        "Sunjian Zheng",
        "Tong Xie",
        "Tianshi Xu",
        "Bo Yu",
        "Fan Wang",
        "Jie Tang",
        "Shaoshan Liu",
        "Meng Li"
      ],
      "abstract": "Object-goal navigation (ObjNav) tasks an agent with navigating to the\nlocation of a specific object in an unseen environment. Embodied agents\nequipped with large language models (LLMs) and online constructed navigation\nmaps can perform ObjNav in a zero-shot manner. However, existing agents heavily\nrely on giant LLMs on the cloud, e.g., GPT-4, while directly switching to small\nLLMs, e.g., LLaMA3.2-11b, suffer from significant success rate drops due to\nlimited model capacity for understanding complex navigation maps, which\nprevents deploying ObjNav on local devices. At the same time, the long prompt\nintroduced by the navigation map description will cause high planning latency\non local devices. In this paper, we propose EfficientNav to enable on-device\nefficient LLM-based zero-shot ObjNav. To help the smaller LLMs better\nunderstand the environment, we propose semantics-aware memory retrieval to\nprune redundant information in navigation maps. To reduce planning latency, we\npropose discrete memory caching and attention-based memory clustering to\nefficiently save and re-use the KV cache. Extensive experimental results\ndemonstrate that EfficientNav achieves 11.1% improvement in success rate on\nHM3D benchmark over GPT-4-based baselines, and demonstrates 6.7x real-time\nlatency reduction and 4.7x end-to-end latency reduction over GPT-4 planner. Our\ncode will be released soon.",
      "pdf_url": "http://arxiv.org/pdf/2510.18546v1",
      "published": "2025-10-21T11:52:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18546v1",
      "categories": [
        "cs.RO",
        "cs.AI"
      ]
    },
    {
      "title": "Pay Attention to the Triggers: Constructing Backdoors That Survive Distillation",
      "authors": [
        "Giovanni De Muri",
        "Mark Vero",
        "Robin Staab",
        "Martin Vechev"
      ],
      "abstract": "LLMs are often used by downstream users as teacher models for knowledge\ndistillation, compressing their capabilities into memory-efficient models.\nHowever, as these teacher models may stem from untrusted parties, distillation\ncan raise unexpected security risks. In this paper, we investigate the security\nimplications of knowledge distillation from backdoored teacher models. First,\nwe show that prior backdoors mostly do not transfer onto student models. Our\nkey insight is that this is because existing LLM backdooring methods choose\ntrigger tokens that rarely occur in usual contexts. We argue that this\nunderestimates the security risks of knowledge distillation and introduce a new\nbackdooring technique, T-MTB, that enables the construction and study of\ntransferable backdoors. T-MTB carefully constructs a composite backdoor\ntrigger, made up of several specific tokens that often occur individually in\nanticipated distillation datasets. As such, the poisoned teacher remains\nstealthy, while during distillation the individual presence of these tokens\nprovides enough signal for the backdoor to transfer onto the student. Using\nT-MTB, we demonstrate and extensively study the security risks of transferable\nbackdoors across two attack scenarios, jailbreaking and content modulation, and\nacross four model families of LLMs.",
      "pdf_url": "http://arxiv.org/pdf/2510.18541v1",
      "published": "2025-10-21T11:39:45+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18541v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CR"
      ]
    },
    {
      "title": "Physics-guided Emulators Reveal Resilience and Fragility under Operational Latencies and Outages",
      "authors": [
        "Sarth Dubey",
        "Subimal Ghosh",
        "Udit Bhatia"
      ],
      "abstract": "Reliable hydrologic and flood forecasting requires models that remain stable\nwhen input data are delayed, missing, or inconsistent. However, most advances\nin rainfall-runoff prediction have been evaluated under ideal data conditions,\nemphasizing accuracy rather than operational resilience. Here, we develop an\noperationally ready emulator of the Global Flood Awareness System (GloFAS) that\ncouples long- and short-term memory networks with a relaxed water-balance\nconstraint to preserve physical coherence. Five architectures span a continuum\nof information availability: from complete historical and forecast forcings to\nscenarios with data latency and outages, allowing systematic evaluation of\nrobustness. Trained in minimally managed catchments across the United States\nand tested in more than 5,000 basins, including heavily regulated rivers in\nIndia, the emulator reproduces the hydrological core of GloFAS and degrades\nsmoothly as information quality declines. Transfer across contrasting\nhydroclimatic and management regimes yields reduced yet physically consistent\nperformance, defining the limits of generalization under data scarcity and\nhuman influence. The framework establishes operational robustness as a\nmeasurable property of hydrological machine learning and advances the design of\nreliable real-time forecasting systems.",
      "pdf_url": "http://arxiv.org/pdf/2510.18535v1",
      "published": "2025-10-21T11:25:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18535v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Counterfactual Reasoning for Steerable Pluralistic Value Alignment of Large Language Models",
      "authors": [
        "Hanze Guo",
        "Jing Yao",
        "Xiao Zhou",
        "Xiaoyuan Yi",
        "Xing Xie"
      ],
      "abstract": "As large language models (LLMs) become increasingly integrated into\napplications serving users across diverse cultures, communities and\ndemographics, it is critical to align LLMs with pluralistic human values beyond\naverage principles (e.g., HHH). In psychological and social value theories such\nas Schwartz's Value Theory, pluralistic values are represented by multiple\nvalue dimensions paired with various priorities. However, existing methods\nencounter two challenges when aligning with such fine-grained value objectives:\n1) they often treat multiple values as independent and equally important,\nignoring their interdependence and relative priorities (value complexity); 2)\nthey struggle to precisely control nuanced value priorities, especially those\nunderrepresented ones (value steerability). To handle these challenges, we\npropose COUPLE, a COUnterfactual reasoning framework for PLuralistic valuE\nalignment. It introduces a structural causal model (SCM) to feature complex\ninterdependency and prioritization among features, as well as the causal\nrelationship between high-level value dimensions and behaviors. Moreover, it\napplies counterfactual reasoning to generate outputs aligned with any desired\nvalue objectives. Benefitting from explicit causal modeling, COUPLE also\nprovides better interpretability. We evaluate COUPLE on two datasets with\ndifferent value systems and demonstrate that COUPLE advances other baselines\nacross diverse types of value objectives.",
      "pdf_url": "http://arxiv.org/pdf/2510.18526v1",
      "published": "2025-10-21T11:12:45+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18526v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Zero-Shot Vehicle Model Recognition via Text-Based Retrieval-Augmented Generation",
      "authors": [
        "Wei-Chia Chang",
        "Yan-Ann Chen"
      ],
      "abstract": "Vehicle make and model recognition (VMMR) is an important task in intelligent\ntransportation systems, but existing approaches struggle to adapt to newly\nreleased models. Contrastive Language-Image Pretraining (CLIP) provides strong\nvisual-text alignment, yet its fixed pretrained weights limit performance\nwithout costly image-specific finetuning. We propose a pipeline that integrates\nvision language models (VLMs) with Retrieval-Augmented Generation (RAG) to\nsupport zero-shot recognition through text-based reasoning. A VLM converts\nvehicle images into descriptive attributes, which are compared against a\ndatabase of textual features. Relevant entries are retrieved and combined with\nthe description to form a prompt, and a language model (LM) infers the make and\nmodel. This design avoids large-scale retraining and enables rapid updates by\nadding textual descriptions of new vehicles. Experiments show that the proposed\nmethod improves recognition by nearly 20% over the CLIP baseline, demonstrating\nthe potential of RAG-enhanced LM reasoning for scalable VMMR in smart-city\napplications.",
      "pdf_url": "http://arxiv.org/pdf/2510.18502v1",
      "published": "2025-10-21T10:39:39+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18502v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ]
    },
    {
      "title": "One Size Fits All? A Modular Adaptive Sanitization Kit (MASK) for Customizable Privacy-Preserving Phone Scam Detection",
      "authors": [
        "Kangzhong Wang",
        "Zitong Shen",
        "Youqian Zhang",
        "Michael MK Cheung",
        "Xiapu Luo",
        "Grace Ngai",
        "Eugene Yujun Fu"
      ],
      "abstract": "Phone scams remain a pervasive threat to both personal safety and financial\nsecurity worldwide. Recent advances in large language models (LLMs) have\ndemonstrated strong potential in detecting fraudulent behavior by analyzing\ntranscribed phone conversations. However, these capabilities introduce notable\nprivacy risks, as such conversations frequently contain sensitive personal\ninformation that may be exposed to third-party service providers during\nprocessing. In this work, we explore how to harness LLMs for phone scam\ndetection while preserving user privacy. We propose MASK (Modular Adaptive\nSanitization Kit), a trainable and extensible framework that enables dynamic\nprivacy adjustment based on individual preferences. MASK provides a pluggable\narchitecture that accommodates diverse sanitization methods - from traditional\nkeyword-based techniques for high-privacy users to sophisticated neural\napproaches for those prioritizing accuracy. We also discuss potential modeling\napproaches and loss function designs for future development, enabling the\ncreation of truly personalized, privacy-aware LLM-based detection systems that\nbalance user trust and detection effectiveness, even beyond phone scam context.",
      "pdf_url": "http://arxiv.org/pdf/2510.18493v1",
      "published": "2025-10-21T10:30:36+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18493v1",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.HC",
        "68M25",
        "I.2.7"
      ]
    },
    {
      "title": "Crucible: Quantifying the Potential of Control Algorithms through LLM Agents",
      "authors": [
        "Lianchen Jia",
        "Chaoyang Li",
        "Qian Houde",
        "Tianchi Huang",
        "Jiangchuan Liu",
        "Lifeng Sun"
      ],
      "abstract": "Control algorithms in production environments typically require domain\nexperts to tune their parameters and logic for specific scenarios. However,\nexisting research predominantly focuses on algorithmic performance under ideal\nor default configurations, overlooking the critical aspect of Tuning Potential.\nTo bridge this gap, we introduce Crucible, an agent that employs an LLM-driven,\nmulti-level expert simulation to turn algorithms and defines a formalized\nmetric to quantitatively evaluate their Tuning Potential. We demonstrate\nCrucible's effectiveness across a wide spectrum of case studies, from classic\ncontrol tasks to complex computer systems, and validate its findings in a\nreal-world deployment. Our experimental results reveal that Crucible\nsystematically quantifies the tunable space across different algorithms.\nFurthermore, Crucible provides a new dimension for algorithm analysis and\ndesign, which ultimately leads to performance improvements. Our code is\navailable at https://github.com/thu-media/Crucible.",
      "pdf_url": "http://arxiv.org/pdf/2510.18491v1",
      "published": "2025-10-21T10:25:26+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18491v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "AndroidControl-Curated: Revealing the True Potential of GUI Agents through Benchmark Purification",
      "authors": [
        "Ho Fai Leung",
        "Xiaoyan Xi",
        "Fei Zuo"
      ],
      "abstract": "On-device virtual assistants like Siri and Google Assistant are increasingly\npivotal, yet their capabilities are hamstrung by a reliance on rigid,\ndeveloper-dependent APIs. GUI agents offer a powerful, API-independent\nalternative, but their adoption is hindered by the perception of poor\nperformance, as even the best models (e.g. Qwen3-VL-235B) scores are capped at\naround 60% on benchmarks like AndroidControl, far from viability for real-world\nuse. Our research reveals that issue lies not only with the models but with the\nbenchmarks themselves. We identified notable shortcomings in AndroidControl,\nincluding ambiguities and factual errors, which systematically underrates agent\ncapabilities. To address this critical oversight, we enhanced AndroidControl\ninto AndroidControl-Curated, a refined version of the benchmark improved\nthrough a rigorous purification pipeline. On this enhanced benchmark,\nstate-of-the-art models achieve success rates nearing 75% on complex tasks (15%\nimprovement), reflecting that on-device GUI agents are actually closer to\npractical deployment than previously thought. We introduce our new SOTA model,\nMagma-R1- 3B, post-trained on just 2.4k curated samples using 60 hours of an\nH20 GPU (approximately $60). Despite being 200 times smaller in parameters,\nthis model delivers performance comparable to Qwen3- VL-235B. We release both\nAndroidControl-Curated benchmark and Magma-R1 model to the research community,\nencouraging adoption of this enhanced benchmark to better reflect model\ncapabilities and accelerate the development of robust, on-device virtual\nassistants.",
      "pdf_url": "http://arxiv.org/pdf/2510.18488v1",
      "published": "2025-10-21T10:11:33+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18488v1",
      "categories": [
        "cs.AI",
        "cs.SE"
      ]
    },
    {
      "title": "StarBench: A Turn-Based RPG Benchmark for Agentic Multimodal Decision-Making and Information Seeking",
      "authors": [
        "Haoran Zhang",
        "Chenhao Zhu",
        "Sicong Guo",
        "Hanzhe Guo",
        "Haiming Li",
        "Donglin Yu"
      ],
      "abstract": "Human players do more than press buttons: they ground what they see on screen\ninto precise keyboard-mouse actions and, when stuck, they seek information\nbefore trying again. We ask whether current vision-language models (VLMs) can\ndo the same. Despite encouraging results under simplified control or tool\nscaffolds, human-like play in a real client - mapping raw screenshots to\ntemporally coherent low-level actions while deciding when to ask for guidance -\nremains an open challenge. We introduce StarBench, a turn-based RPG benchmark\nderived from Honkai: Star Rail that targets these two human-like competencies:\nmultimodal decision-making from pixels to actions and agentic information\nseeking. StarBench standardizes evaluation across eight combat tasks and two\nregimes with shared tasks and metrics: (i) direct control, where agents receive\nonly screenshots and must emit low-level primitives (click and keypress) with\nno semantic hints; and (ii) tool-assisted control, where higher-level intents\ncan be mapped to primitives by detectors and OCR outputs provide optional\ntextualized observations to ease UI grounding. To mirror human practice,\nStarBench also includes an ask-or-act diagnostic that measures whether and when\nagents choose to request brief guidance before proceeding, and how that choice\naffects subsequent performance. We report reference baselines for contemporary\nVLMs and a human reference. Results expose sizable gaps in\nperception-to-control fidelity in the direct regime, while showing that\njudicious information seeking correlates with improved success, establishing\nStarBench as a reproducible yardstick for agentic information seeking and\nmultimodal decision-making in real-client play.",
      "pdf_url": "http://arxiv.org/pdf/2510.18483v1",
      "published": "2025-10-21T10:02:59+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18483v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "LAFA: Agentic LLM-Driven Federated Analytics over Decentralized Data Sources",
      "authors": [
        "Haichao Ji",
        "Zibo Wang",
        "Yifei Zhu",
        "Meng han",
        "Dan Wang",
        "Zhu Han"
      ],
      "abstract": "Large Language Models (LLMs) have shown great promise in automating data\nanalytics tasks by interpreting natural language queries and generating\nmulti-operation execution plans. However, existing LLM-agent-based analytics\nframeworks operate under the assumption of centralized data access, offering\nlittle to no privacy protection. In contrast, federated analytics (FA) enables\nprivacy-preserving computation across distributed data sources, but lacks\nsupport for natural language input and requires structured, machine-readable\nqueries. In this work, we present LAFA, the first system that integrates\nLLM-agent-based data analytics with FA. LAFA introduces a hierarchical\nmulti-agent architecture that accepts natural language queries and transforms\nthem into optimized, executable FA workflows. A coarse-grained planner first\ndecomposes complex queries into sub-queries, while a fine-grained planner maps\neach subquery into a Directed Acyclic Graph of FA operations using prior\nstructural knowledge. To improve execution efficiency, an optimizer agent\nrewrites and merges multiple DAGs, eliminating redundant operations and\nminimizing computational and communicational overhead. Our experiments\ndemonstrate that LAFA consistently outperforms baseline prompting strategies by\nachieving higher execution plan success rates and reducing resource-intensive\nFA operations by a substantial margin. This work establishes a practical\nfoundation for privacy-preserving, LLM-driven analytics that supports natural\nlanguage input in the FA setting.",
      "pdf_url": "http://arxiv.org/pdf/2510.18477v1",
      "published": "2025-10-21T09:56:25+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18477v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Probabilistic Modeling of Intentions in Socially Intelligent LLM Agents",
      "authors": [
        "Feifan Xia",
        "Yuyang Fang",
        "Defang Li",
        "Yantong Xie",
        "Weikang Li",
        "Yang Li",
        "Deguo Xia",
        "Jizhou Huang"
      ],
      "abstract": "We present a probabilistic intent modeling framework for large language model\n(LLM) agents in multi-turn social dialogue. The framework maintains a belief\ndistribution over a partner's latent intentions, initialized from contextual\npriors and dynamically updated through likelihood estimation after each\nutterance. The evolving distribution provides additional contextual grounding\nfor the policy, enabling adaptive dialogue strategies under uncertainty.\nPreliminary experiments in the SOTOPIA environment show consistent\nimprovements: the proposed framework increases the Overall score by 9.0% on\nSOTOPIA-All and 4.1% on SOTOPIA-Hard compared with the Qwen2.5-7B baseline, and\nslightly surpasses an oracle agent that directly observes partner intentions.\nThese early results suggest that probabilistic intent modeling can contribute\nto the development of socially intelligent LLM agents.",
      "pdf_url": "http://arxiv.org/pdf/2510.18476v1",
      "published": "2025-10-21T09:54:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2510.18476v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    }
  ]
}