{
  "last_updated": "2025-07-14T00:58:35.990757",
  "papers": [
    {
      "title": "Traceable Evidence Enhanced Visual Grounded Reasoning: Evaluation and Methodology",
      "authors": [
        "Haochen Wang",
        "Xiangtai Li",
        "Zilong Huang",
        "Anran Wang",
        "Jiacong Wang",
        "Tao Zhang",
        "Jiani Zheng",
        "Sule Bai",
        "Zijian Kang",
        "Jiashi Feng",
        "Zhuochen Wang",
        "Zhaoxiang Zhang"
      ],
      "abstract": "Models like OpenAI-o3 pioneer visual grounded reasoning by dynamically\nreferencing visual regions, just like human \"thinking with images\". However, no\nbenchmark exists to evaluate these capabilities holistically. To bridge this\ngap, we propose TreeBench (Traceable Evidence Evaluation Benchmark), a\ndiagnostic benchmark built on three principles: (1) focused visual perception\nof subtle targets in complex scenes, (2) traceable evidence via bounding box\nevaluation, and (3) second-order reasoning to test object interactions and\nspatial hierarchies beyond simple object localization. Prioritizing images with\ndense objects, we initially sample 1K high-quality images from SA-1B, and\nincorporate eight LMM experts to manually annotate questions, candidate\noptions, and answers for each image. After three stages of quality control,\nTreeBench consists of 405 challenging visual question-answering pairs, even the\nmost advanced models struggle with this benchmark, where none of them reach 60%\naccuracy, e.g., OpenAI-o3 scores only 54.87. Furthermore, we introduce TreeVGR\n(Traceable Evidence Enhanced Visual Grounded Reasoning), a training paradigm to\nsupervise localization and reasoning jointly with reinforcement learning,\nenabling accurate localizations and explainable reasoning pathways. Initialized\nfrom Qwen2.5-VL-7B, it improves V* Bench (+16.8), MME-RealWorld (+12.6), and\nTreeBench (+13.4), proving traceability is key to advancing vision-grounded\nreasoning. The code is available at https://github.com/Haochen-Wang409/TreeVGR.",
      "pdf_url": "http://arxiv.org/pdf/2507.07999v1",
      "published": "2025-07-10T17:59:58+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07999v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "PyVision: Agentic Vision with Dynamic Tooling",
      "authors": [
        "Shitian Zhao",
        "Haoquan Zhang",
        "Shaoheng Lin",
        "Ming Li",
        "Qilong Wu",
        "Kaipeng Zhang",
        "Chen Wei"
      ],
      "abstract": "LLMs are increasingly deployed as agents, systems capable of planning,\nreasoning, and dynamically calling external tools. However, in visual\nreasoning, prior approaches largely remain limited by predefined workflows and\nstatic toolsets. In this report, we present PyVision, an interactive,\nmulti-turn framework that enables MLLMs to autonomously generate, execute, and\nrefine Python-based tools tailored to the task at hand, unlocking flexible and\ninterpretable problem-solving. We develop a taxonomy of the tools created by\nPyVision and analyze their usage across a diverse set of benchmarks.\nQuantitatively, PyVision achieves consistent performance gains, boosting\nGPT-4.1 by +7.8% on V* and Claude-4.0-Sonnet by +31.1% on VLMsAreBlind-mini.\nThese results point to a broader shift: dynamic tooling allows models not just\nto use tools, but to invent them, advancing toward more agentic visual\nreasoning.",
      "pdf_url": "http://arxiv.org/pdf/2507.07998v1",
      "published": "2025-07-10T17:59:55+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07998v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Single-pass Adaptive Image Tokenization for Minimum Program Search",
      "authors": [
        "Shivam Duggal",
        "Sanghyun Byun",
        "William T. Freeman",
        "Antonio Torralba",
        "Phillip Isola"
      ],
      "abstract": "According to Algorithmic Information Theory (AIT) -- Intelligent\nrepresentations compress data into the shortest possible program that can\nreconstruct its content, exhibiting low Kolmogorov Complexity (KC). In\ncontrast, most visual representation learning systems use fixed-length\nrepresentations for all inputs, ignoring variations in complexity or\nfamiliarity. Recent adaptive tokenization methods address this by allocating\nvariable-length representations but typically require test-time search over\nmultiple encodings to find the most predictive one. Inspired by Kolmogorov\nComplexity principles, we propose a single-pass adaptive tokenizer, KARL, which\npredicts the appropriate number of tokens for an image in a single forward\npass, halting once its approximate KC is reached. The token count serves as a\nproxy for the minimum description length. KARL's training procedure closely\nresembles the Upside-Down Reinforcement Learning paradigm, as it learns to\nconditionally predict token halting based on a desired reconstruction quality.\nKARL matches the performance of recent adaptive tokenizers while operating in a\nsingle pass. We present scaling laws for KARL, analyzing the role of\nencoder/decoder size, continuous vs. discrete tokenization and more.\nAdditionally, we offer a conceptual study drawing an analogy between Adaptive\nImage Tokenization and Algorithmic Information Theory, examining the predicted\nimage complexity (KC) across axes such as structure vs. noise and in- vs.\nout-of-distribution familiarity -- revealing alignment with human intuition.",
      "pdf_url": "http://arxiv.org/pdf/2507.07995v1",
      "published": "2025-07-10T17:59:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07995v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Multigranular Evaluation for Brain Visual Decoding",
      "authors": [
        "Weihao Xia",
        "Cengiz Oztireli"
      ],
      "abstract": "Existing evaluation protocols for brain visual decoding predominantly rely on\ncoarse metrics that obscure inter-model differences, lack neuroscientific\nfoundation, and fail to capture fine-grained visual distinctions. To address\nthese limitations, we introduce BASIC, a unified, multigranular evaluation\nframework that jointly quantifies structural fidelity, inferential alignment,\nand contextual coherence between decoded and ground truth images. For the\nstructural level, we introduce a hierarchical suite of segmentation-based\nmetrics, including foreground, semantic, instance, and component masks,\nanchored in granularity-aware correspondence across mask structures. For the\nsemantic level, we extract structured scene representations encompassing\nobjects, attributes, and relationships using multimodal large language models,\nenabling detailed, scalable, and context-rich comparisons with ground-truth\nstimuli. We benchmark a diverse set of visual decoding methods across multiple\nstimulus-neuroimaging datasets within this unified evaluation framework.\nTogether, these criteria provide a more discriminative, interpretable, and\ncomprehensive foundation for measuring brain visual decoding methods.",
      "pdf_url": "http://arxiv.org/pdf/2507.07993v1",
      "published": "2025-07-10T17:59:24+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07993v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "eess.IV",
        "q-bio.NC"
      ]
    },
    {
      "title": "Multi-Granular Spatio-Temporal Token Merging for Training-Free Acceleration of Video LLMs",
      "authors": [
        "Jeongseok Hyun",
        "Sukjun Hwang",
        "Su Ho Han",
        "Taeoh Kim",
        "Inwoong Lee",
        "Dongyoon Wee",
        "Joon-Young Lee",
        "Seon Joo Kim",
        "Minho Shim"
      ],
      "abstract": "Video large language models (LLMs) achieve strong video understanding by\nleveraging a large number of spatio-temporal tokens, but suffer from quadratic\ncomputational scaling with token count. To address this, we propose a\ntraining-free spatio-temporal token merging method, named STTM. Our key insight\nis to exploit local spatial and temporal redundancy in video data which has\nbeen overlooked in prior work. STTM first transforms each frame into\nmulti-granular spatial tokens using a coarse-to-fine search over a quadtree\nstructure, then performs directed pairwise merging across the temporal\ndimension. This decomposed merging approach outperforms existing token\nreduction methods across six video QA benchmarks. Notably, STTM achieves a\n2$\\times$ speed-up with only a 0.5% accuracy drop under a 50% token budget, and\na 3$\\times$ speed-up with just a 2% drop under a 30% budget. Moreover, STTM is\nquery-agnostic, allowing KV cache reuse across different questions for the same\nvideo. The project page is available at https://www.jshyun.me/projects/sttm.",
      "pdf_url": "http://arxiv.org/pdf/2507.07990v1",
      "published": "2025-07-10T17:59:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07990v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "EXPO: Stable Reinforcement Learning with Expressive Policies",
      "authors": [
        "Perry Dong",
        "Qiyang Li",
        "Dorsa Sadigh",
        "Chelsea Finn"
      ],
      "abstract": "We study the problem of training and fine-tuning expressive policies with\nonline reinforcement learning (RL) given an offline dataset. Training\nexpressive policy classes with online RL present a unique challenge of stable\nvalue maximization. Unlike simpler Gaussian policies commonly used in online\nRL, expressive policies like diffusion and flow-matching policies are\nparameterized by a long denoising chain, which hinders stable gradient\npropagation from actions to policy parameters when optimizing against some\nvalue function. Our key insight is that we can address stable value\nmaximization by avoiding direct optimization over value with the expressive\npolicy and instead construct an on-the-fly RL policy to maximize Q-value. We\npropose Expressive Policy Optimization (EXPO), a sample-efficient online RL\nalgorithm that utilizes an on-the-fly policy to maximize value with two\nparameterized policies -- a larger expressive base policy trained with a stable\nimitation learning objective and a light-weight Gaussian edit policy that edits\nthe actions sampled from the base policy toward a higher value distribution.\nThe on-the-fly policy optimizes the actions from the base policy with the\nlearned edit policy and chooses the value maximizing action from the base and\nedited actions for both sampling and temporal-difference (TD) backup. Our\napproach yields up to 2-3x improvement in sample efficiency on average over\nprior methods both in the setting of fine-tuning a pretrained policy given\noffline data and in leveraging offline data to train online.",
      "pdf_url": "http://arxiv.org/pdf/2507.07986v1",
      "published": "2025-07-10T17:57:46+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07986v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Performance and Practical Considerations of Large and Small Language Models in Clinical Decision Support in Rheumatology",
      "authors": [
        "Sabine Felde",
        "Rüdiger Buchkremer",
        "Gamal Chehab",
        "Christian Thielscher",
        "Jörg HW Distler",
        "Matthias Schneider",
        "Jutta G. Richter"
      ],
      "abstract": "Large language models (LLMs) show promise for supporting clinical\ndecision-making in complex fields such as rheumatology. Our evaluation shows\nthat smaller language models (SLMs), combined with retrieval-augmented\ngeneration (RAG), achieve higher diagnostic and therapeutic performance than\nlarger models, while requiring substantially less energy and enabling\ncost-efficient, local deployment. These features are attractive for\nresource-limited healthcare. However, expert oversight remains essential, as no\nmodel consistently reached specialist-level accuracy in rheumatology.",
      "pdf_url": "http://arxiv.org/pdf/2507.07983v1",
      "published": "2025-07-10T17:56:03+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07983v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "L01.224.900.500 (Primary), L01.700.508.300, L01.224.050.375,\n  H02.403.720.750, N04.590, N04.452.758.625 (Secondary)",
        "I.2.7; H.3.3; J.3; I.2.9; C.4"
      ]
    },
    {
      "title": "Geometry Forcing: Marrying Video Diffusion and 3D Representation for Consistent World Modeling",
      "authors": [
        "Haoyu Wu",
        "Diankun Wu",
        "Tianyu He",
        "Junliang Guo",
        "Yang Ye",
        "Yueqi Duan",
        "Jiang Bian"
      ],
      "abstract": "Videos inherently represent 2D projections of a dynamic 3D world. However,\nour analysis suggests that video diffusion models trained solely on raw video\ndata often fail to capture meaningful geometric-aware structure in their\nlearned representations. To bridge this gap between video diffusion models and\nthe underlying 3D nature of the physical world, we propose Geometry Forcing, a\nsimple yet effective method that encourages video diffusion models to\ninternalize latent 3D representations. Our key insight is to guide the model's\nintermediate representations toward geometry-aware structure by aligning them\nwith features from a pretrained geometric foundation model. To this end, we\nintroduce two complementary alignment objectives: Angular Alignment, which\nenforces directional consistency via cosine similarity, and Scale Alignment,\nwhich preserves scale-related information by regressing unnormalized geometric\nfeatures from normalized diffusion representation. We evaluate Geometry Forcing\non both camera view-conditioned and action-conditioned video generation tasks.\nExperimental results demonstrate that our method substantially improves visual\nquality and 3D consistency over the baseline methods. Project page:\nhttps://GeometryForcing.github.io.",
      "pdf_url": "http://arxiv.org/pdf/2507.07982v1",
      "published": "2025-07-10T17:55:08+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07982v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Why is Your Language Model a Poor Implicit Reward Model?",
      "authors": [
        "Noam Razin",
        "Yong Lin",
        "Jiarui Yao",
        "Sanjeev Arora"
      ],
      "abstract": "Reward models are key to language model post-training and inference\npipelines. Conveniently, recent work showed that every language model defines\nan implicit reward model (IM-RM), without requiring any architectural changes.\nHowever, such IM-RMs tend to generalize worse, especially out-of-distribution,\ncompared to explicit reward models (EX-RMs) that apply a dedicated linear head\nover the hidden representations of a language model. The existence of a\ngeneralization gap is puzzling, as EX-RMs and IM-RMs are nearly identical. They\ncan be trained using the same data, loss function, and language model, and\ndiffer only in how the reward is computed. Towards a fundamental understanding\nof the implicit biases underlying different reward model types, we investigate\nthe root cause of this gap. Our main finding, backed by theory and experiments,\nis that IM-RMs rely more heavily on superficial token-level cues. Consequently,\nthey often generalize worse than EX-RMs under token-level distribution shifts,\nas well as in-distribution. Furthermore, we provide evidence against\nalternative hypotheses for the generalization gap. Most notably, we challenge\nthe intuitive claim that IM-RMs struggle in tasks where generation is harder\nthan verification because they can operate both as a verifier and a generator.\nTaken together, our results highlight that seemingly minor design choices can\nsubstantially impact the generalization behavior of reward models.",
      "pdf_url": "http://arxiv.org/pdf/2507.07981v1",
      "published": "2025-07-10T17:55:05+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07981v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Reinforcement Learning with Action Chunking",
      "authors": [
        "Qiyang Li",
        "Zhiyuan Zhou",
        "Sergey Levine"
      ],
      "abstract": "We present Q-chunking, a simple yet effective recipe for improving\nreinforcement learning (RL) algorithms for long-horizon, sparse-reward tasks.\nOur recipe is designed for the offline-to-online RL setting, where the goal is\nto leverage an offline prior dataset to maximize the sample-efficiency of\nonline learning. Effective exploration and sample-efficient learning remain\ncentral challenges in this setting, as it is not obvious how the offline data\nshould be utilized to acquire a good exploratory policy. Our key insight is\nthat action chunking, a technique popularized in imitation learning where\nsequences of future actions are predicted rather than a single action at each\ntimestep, can be applied to temporal difference (TD)-based RL methods to\nmitigate the exploration challenge. Q-chunking adopts action chunking by\ndirectly running RL in a 'chunked' action space, enabling the agent to (1)\nleverage temporally consistent behaviors from offline data for more effective\nonline exploration and (2) use unbiased $n$-step backups for more stable and\nefficient TD learning. Our experimental results demonstrate that Q-chunking\nexhibits strong offline performance and online sample efficiency, outperforming\nprior best offline-to-online methods on a range of long-horizon, sparse-reward\nmanipulation tasks.",
      "pdf_url": "http://arxiv.org/pdf/2507.07969v1",
      "published": "2025-07-10T17:48:03+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07969v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO",
        "stat.ML"
      ]
    },
    {
      "title": "Scaling RL to Long Videos",
      "authors": [
        "Yukang Chen",
        "Wei Huang",
        "Baifeng Shi",
        "Qinghao Hu",
        "Hanrong Ye",
        "Ligeng Zhu",
        "Zhijian Liu",
        "Pavlo Molchanov",
        "Jan Kautz",
        "Xiaojuan Qi",
        "Sifei Liu",
        "Hongxu Yin",
        "Yao Lu",
        "Song Han"
      ],
      "abstract": "We introduce a full-stack framework that scales up reasoning in\nvision-language models (VLMs) to long videos, leveraging reinforcement\nlearning. We address the unique challenges of long video reasoning by\nintegrating three critical components: (1) a large-scale dataset,\nLongVideo-Reason, comprising 52K long video QA pairs with high-quality\nreasoning annotations across diverse domains such as sports, games, and vlogs;\n(2) a two-stage training pipeline that extends VLMs with chain-of-thought\nsupervised fine-tuning (CoT-SFT) and reinforcement learning (RL); and (3) a\ntraining infrastructure for long video RL, named Multi-modal Reinforcement\nSequence Parallelism (MR-SP), which incorporates sequence parallelism and a\nvLLM-based engine tailored for long video, using cached video embeddings for\nefficient rollout and prefilling. In experiments, LongVILA-R1-7B achieves\nstrong performance on long video QA benchmarks such as VideoMME. It also\noutperforms Video-R1-7B and even matches Gemini-1.5-Pro across temporal\nreasoning, goal and purpose reasoning, spatial reasoning, and plot reasoning on\nour LongVideo-Reason-eval benchmark. Notably, our MR-SP system achieves up to\n2.1x speedup on long video RL training. LongVILA-R1 demonstrates consistent\nperformance gains as the number of input video frames scales. LongVILA-R1 marks\na firm step towards long video reasoning in VLMs. In addition, we release our\ntraining system for public availability that supports RL training on various\nmodalities (video, text, and audio), various models (VILA and Qwen series), and\neven image and video generation models. On a single A100 node (8 GPUs), it\nsupports RL training on hour-long videos (e.g., 3,600 frames / around 256k\ntokens).",
      "pdf_url": "http://arxiv.org/pdf/2507.07966v1",
      "published": "2025-07-10T17:47:40+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07966v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "MIRIX: Multi-Agent Memory System for LLM-Based Agents",
      "authors": [
        "Yu Wang",
        "Xi Chen"
      ],
      "abstract": "Although memory capabilities of AI agents are gaining increasing attention,\nexisting solutions remain fundamentally limited. Most rely on flat, narrowly\nscoped memory components, constraining their ability to personalize, abstract,\nand reliably recall user-specific information over time. To this end, we\nintroduce MIRIX, a modular, multi-agent memory system that redefines the future\nof AI memory by solving the field's most critical challenge: enabling language\nmodels to truly remember. Unlike prior approaches, MIRIX transcends text to\nembrace rich visual and multimodal experiences, making memory genuinely useful\nin real-world scenarios. MIRIX consists of six distinct, carefully structured\nmemory types: Core, Episodic, Semantic, Procedural, Resource Memory, and\nKnowledge Vault, coupled with a multi-agent framework that dynamically controls\nand coordinates updates and retrieval. This design enables agents to persist,\nreason over, and accurately retrieve diverse, long-term user data at scale. We\nvalidate MIRIX in two demanding settings. First, on ScreenshotVQA, a\nchallenging multimodal benchmark comprising nearly 20,000 high-resolution\ncomputer screenshots per sequence, requiring deep contextual understanding and\nwhere no existing memory systems can be applied, MIRIX achieves 35% higher\naccuracy than the RAG baseline while reducing storage requirements by 99.9%.\nSecond, on LOCOMO, a long-form conversation benchmark with single-modal textual\ninput, MIRIX attains state-of-the-art performance of 85.4%, far surpassing\nexisting baselines. These results show that MIRIX sets a new performance\nstandard for memory-augmented LLM agents. To allow users to experience our\nmemory system, we provide a packaged application powered by MIRIX. It monitors\nthe screen in real time, builds a personalized memory base, and offers\nintuitive visualization and secure local storage to ensure privacy.",
      "pdf_url": "http://arxiv.org/pdf/2507.07957v1",
      "published": "2025-07-10T17:40:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07957v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Low Resource Reconstruction Attacks Through Benign Prompts",
      "authors": [
        "Sol Yarkoni",
        "Roi Livni"
      ],
      "abstract": "The recent advances in generative models such as diffusion models have raised\nseveral risks and concerns related to privacy, copyright infringements and data\nstewardship. To better understand and control the risks, various researchers\nhave created techniques, experiments and attacks that reconstruct images, or\npart of images, from the training set. While these techniques already establish\nthat data from the training set can be reconstructed, they often rely on\nhigh-resources, excess to the training set as well as well-engineered and\ndesigned prompts.\n  In this work, we devise a new attack that requires low resources, assumes\nlittle to no access to the actual training set, and identifies, seemingly,\nbenign prompts that lead to potentially-risky image reconstruction. This\nhighlights the risk that images might even be reconstructed by an uninformed\nuser and unintentionally. For example, we identified that, with regard to one\nexisting model, the prompt ``blue Unisex T-Shirt'' can generate the face of a\nreal-life human model. Our method builds on an intuition from previous works\nwhich leverages domain knowledge and identifies a fundamental vulnerability\nthat stems from the use of scraped data from e-commerce platforms, where\ntemplated layouts and images are tied to pattern-like prompts.",
      "pdf_url": "http://arxiv.org/pdf/2507.07947v1",
      "published": "2025-07-10T17:32:26+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07947v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Working with AI: Measuring the Occupational Implications of Generative AI",
      "authors": [
        "Kiran Tomlinson",
        "Sonia Jaffe",
        "Will Wang",
        "Scott Counts",
        "Siddharth Suri"
      ],
      "abstract": "Given the rapid adoption of generative AI and its potential to impact a wide\nrange of tasks, understanding the effects of AI on the economy is one of\nsociety's most important questions. In this work, we take a step toward that\ngoal by analyzing the work activities people do with AI, how successfully and\nbroadly those activities are done, and combine that with data on what\noccupations do those activities. We analyze a dataset of 200k anonymized and\nprivacy-scrubbed conversations between users and Microsoft Bing Copilot, a\npublicly available generative AI system. We find the most common work\nactivities people seek AI assistance for involve gathering information and\nwriting, while the most common activities that AI itself is performing are\nproviding information and assistance, writing, teaching, and advising.\nCombining these activity classifications with measurements of task success and\nscope of impact, we compute an AI applicability score for each occupation. We\nfind the highest AI applicability scores for knowledge work occupation groups\nsuch as computer and mathematical, and office and administrative support, as\nwell as occupations such as sales whose work activities involve providing and\ncommunicating information. Additionally, we characterize the types of work\nactivities performed most successfully, how wage and education correlate with\nAI applicability, and how real-world usage compares to predictions of\noccupational AI impact.",
      "pdf_url": "http://arxiv.org/pdf/2507.07935v1",
      "published": "2025-07-10T17:16:33+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07935v1",
      "categories": [
        "cs.AI",
        "cs.CY",
        "econ.GN",
        "q-fin.EC"
      ]
    },
    {
      "title": "Meek Models Shall Inherit the Earth",
      "authors": [
        "Hans Gundlach",
        "Jayson Lynch",
        "Neil Thompson"
      ],
      "abstract": "The past decade has seen incredible scaling of AI systems by a few companies,\nleading to inequality in AI model performance. This paper argues that, contrary\nto prevailing intuition, the diminishing returns to compute scaling will lead\nto a convergence of AI model capabilities. In other words, meek models (those\nwith limited computation budget) shall inherit the earth, approaching the\nperformance level of the best models overall. We develop a model illustrating\nthat under a fixed-distribution next-token objective, the marginal capability\nreturns to raw compute shrink substantially. Given current scaling practices,\nwe argue that these diminishing returns are strong enough that even companies\nthat can scale their models exponentially faster than other organizations will\neventually have little advantage in capabilities. As part of our argument, we\ngive several reasons that proxies like training loss differences capture\nimportant capability measures using evidence from benchmark data and\ntheoretical performance models. In addition, we analyze empirical data on the\ncapability difference of AI models over time. Finally, in light of the\nincreasing ability of meek models, we argue that AI strategy and policy require\nreexamination, and we outline the areas this shift will affect.",
      "pdf_url": "http://arxiv.org/pdf/2507.07931v1",
      "published": "2025-07-10T17:10:07+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07931v1",
      "categories": [
        "cs.AI",
        "cs.CY",
        "I.2.0; K.4.1"
      ]
    },
    {
      "title": "Probing Experts' Perspectives on AI-Assisted Public Speaking Training",
      "authors": [
        "Nesrine Fourati",
        "Alisa Barkar",
        "Marion Dragée",
        "Liv Danthon-Lefebvre",
        "Mathieu Chollet"
      ],
      "abstract": "Background: Public speaking is a vital professional skill, yet it remains a\nsource of significant anxiety for many individuals. Traditional training relies\nheavily on expert coaching, but recent advances in AI has led to novel types of\ncommercial automated public speaking feedback tools. However, most research has\nfocused on prototypes rather than commercial applications, and little is known\nabout how public speaking experts perceive these tools.\n  Objectives: This study aims to evaluate expert opinions on the efficacy and\ndesign of commercial AI-based public speaking training tools and to propose\nguidelines for their improvement.\n  Methods: The research involved 16 semi-structured interviews and 2 focus\ngroups with public speaking experts. Participants discussed their views on\ncurrent commercial tools, their potential integration into traditional\ncoaching, and suggestions for enhancing these systems.\n  Results and Conclusions: Experts acknowledged the value of AI tools in\nhandling repetitive, technical aspects of training, allowing coaches to focus\non higher-level skills. However they found key issues in current tools,\nemphasising the need for personalised, understandable, carefully selected\nfeedback and clear instructional design. Overall, they supported a hybrid model\ncombining traditional coaching with AI-supported exercises.",
      "pdf_url": "http://arxiv.org/pdf/2507.07930v2",
      "published": "2025-07-10T17:09:21+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07930v2",
      "categories": [
        "cs.HC",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "Towards Continuous Home Cage Monitoring: An Evaluation of Tracking and Identification Strategies for Laboratory Mice",
      "authors": [
        "Juan Pablo Oberhauser",
        "Daniel Grzenda"
      ],
      "abstract": "Continuous, automated monitoring of laboratory mice enables more accurate\ndata collection and improves animal welfare through real-time insights.\nResearchers can achieve a more dynamic and clinically relevant characterization\nof disease progression and therapeutic effects by integrating behavioral and\nphysiological monitoring in the home cage. However, providing individual mouse\nmetrics is difficult because of their housing density, similar appearances,\nhigh mobility, and frequent interactions. To address these challenges, we\ndevelop a real-time identification (ID) algorithm that accurately assigns ID\npredictions to mice wearing custom ear tags in digital home cages monitored by\ncameras. Our pipeline consists of three parts: (1) a custom multiple object\ntracker (MouseTracks) that combines appearance and motion cues from mice; (2) a\ntransformer-based ID classifier (Mouseformer); and (3) a tracklet associator\nlinear program to assign final ID predictions to tracklets (MouseMap). Our\nmodels assign an animal ID based on custom ear tags at 30 frames per second\nwith 24/7 cage coverage. We show that our custom tracking and ID pipeline\nimproves tracking efficiency and lowers ID switches across mouse strains and\nvarious environmental factors compared to current mouse tracking methods.",
      "pdf_url": "http://arxiv.org/pdf/2507.07929v1",
      "published": "2025-07-10T17:09:14+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07929v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "DTECT: Dynamic Topic Explorer & Context Tracker",
      "authors": [
        "Suman Adhya",
        "Debarshi Kumar Sanyal"
      ],
      "abstract": "The explosive growth of textual data over time presents a significant\nchallenge in uncovering evolving themes and trends. Existing dynamic topic\nmodeling techniques, while powerful, often exist in fragmented pipelines that\nlack robust support for interpretation and user-friendly exploration. We\nintroduce DTECT (Dynamic Topic Explorer & Context Tracker), an end-to-end\nsystem that bridges the gap between raw textual data and meaningful temporal\ninsights. DTECT provides a unified workflow that supports data preprocessing,\nmultiple model architectures, and dedicated evaluation metrics to analyze the\ntopic quality of temporal topic models. It significantly enhances\ninterpretability by introducing LLM-driven automatic topic labeling, trend\nanalysis via temporally salient words, interactive visualizations with\ndocument-level summarization, and a natural language chat interface for\nintuitive data querying. By integrating these features into a single, cohesive\nplatform, DTECT empowers users to more effectively track and understand\nthematic dynamics. DTECT is open-source and available at\nhttps://github.com/AdhyaSuman/DTECT.",
      "pdf_url": "http://arxiv.org/pdf/2507.07910v1",
      "published": "2025-07-10T16:44:33+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07910v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.IR"
      ]
    },
    {
      "title": "Agentic Retrieval of Topics and Insights from Earnings Calls",
      "authors": [
        "Anant Gupta",
        "Rajarshi Bhowmik",
        "Geoffrey Gunow"
      ],
      "abstract": "Tracking the strategic focus of companies through topics in their earnings\ncalls is a key task in financial analysis. However, as industries evolve,\ntraditional topic modeling techniques struggle to dynamically capture emerging\ntopics and their relationships. In this work, we propose an LLM-agent driven\napproach to discover and retrieve emerging topics from quarterly earnings\ncalls. We propose an LLM-agent to extract topics from documents, structure them\ninto a hierarchical ontology, and establish relationships between new and\nexisting topics through a topic ontology. We demonstrate the use of extracted\ntopics to infer company-level insights and emerging trends over time. We\nevaluate our approach by measuring ontology coherence, topic evolution\naccuracy, and its ability to surface emerging financial trends.",
      "pdf_url": "http://arxiv.org/pdf/2507.07906v1",
      "published": "2025-07-10T16:38:59+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07906v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "An Integrated Framework of Prompt Engineering and Multidimensional Knowledge Graphs for Legal Dispute Analysis",
      "authors": [
        "Mingda Zhang",
        "Na Zhao",
        "Jianglong Qing",
        "Qing xu",
        "Kaiwen Pan",
        "Ting luo"
      ],
      "abstract": "The rapid development of artificial intelligence has positioned large\nlanguage models as fundamental components of intelligent legal systems.\nHowever, these models face significant limitations in legal dispute analysis,\nincluding insufficient legal knowledge representation, limited concept\nunderstanding, and reasoning deficiencies. This research proposes an enhanced\nframework integrating prompt engineering with multidimensional knowledge\ngraphs. The framework introduces a three-stage hierarchical prompt structure\ncomprising task definition, knowledge background, and reasoning guidance,\nsupplemented by legal-specific reasoning templates and dynamic optimization\nmechanisms. A three-layer knowledge graph architecture is constructed with\nlegal classification ontology, representation, and instance layers. Four\ncomplementary methods enable precise legal concept retrieval: direct legal norm\ncode matching, domain-specific semantic vector similarity, ontology-based path\nreasoning, and specialized lexical segmentation. These components integrate\nwith web search technology to establish a knowledge-enhanced framework for\nlegal decision-making. Experimental results demonstrate significant performance\nimprovements in legal dispute analysis, enabling accurate legal application\nanalysis for complex cases while exhibiting nuanced understanding of judicial\ndecision-making logic, providing a novel technical approach for implementing\nintelligent legal assistance systems.",
      "pdf_url": "http://arxiv.org/pdf/2507.07893v1",
      "published": "2025-07-10T16:22:41+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07893v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "UnIT: Scalable Unstructured Inference-Time Pruning for MAC-efficient Neural Inference on MCUs",
      "authors": [
        "Ashe Neth",
        "Sawinder kaur",
        "Mohammad Nur Hossain Khan",
        "Subrata Biswas",
        "Asif Salekin",
        "Bashima Islam"
      ],
      "abstract": "Existing pruning methods are typically applied during training or compile\ntime and often rely on structured sparsity. While compatible with low-power\nmicrocontrollers (MCUs), structured pruning underutilizes the opportunity for\nfine-grained efficiency on devices without SIMD support or parallel compute. To\naddress these limitations, we introduce UnIT (Unstructured Inference-Time\npruning), a lightweight method that dynamically identifies and skips\nunnecessary multiply-accumulate (MAC) operations during inference, guided by\ninput-specific activation patterns. Unlike structured pruning, UnIT embraces\nirregular sparsity and does not require retraining or hardware specialization.\nIt transforms pruning decisions into lightweight comparisons, replacing\nmultiplications with threshold checks and approximated divisions. UnIT further\noptimizes compute by reusing threshold computations across multiple connections\nand applying layer- and group-specific pruning sensitivity. We present three\nfast, hardware-friendly division approximations tailored to the capabilities of\ncommon embedded platforms. Demonstrated on the MSP430 microcontroller, UnIT\nachieves 11.02% to 82.03% MAC reduction, 27.30% to 84.19% faster inference, and\n27.33% to 84.38% lower energy consumption compared to training-time pruned\nmodels, while maintaining accuracy with 0.48-7%. Under domain shift, UnIT\nmatches or exceeds the accuracy of retrained models while requiring\nsignificantly fewer MACs. These results establish unstructured inference-time\npruning as a viable and practical solution for efficient, retraining-free\ndeployment of deep neural networks on MCUs.",
      "pdf_url": "http://arxiv.org/pdf/2507.07885v1",
      "published": "2025-07-10T16:12:06+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07885v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Mitigating Watermark Stealing Attacks in Generative Models via Multi-Key Watermarking",
      "authors": [
        "Toluwani Aremu",
        "Noor Hussein",
        "Munachiso Nwadike",
        "Samuele Poppi",
        "Jie Zhang",
        "Karthik Nandakumar",
        "Neil Gong",
        "Nils Lukas"
      ],
      "abstract": "Watermarking offers a promising solution for GenAI providers to establish the\nprovenance of their generated content. A watermark is a hidden signal embedded\nin the generated content, whose presence can later be verified using a secret\nwatermarking key. A threat to GenAI providers are \\emph{watermark stealing}\nattacks, where users forge a watermark into content that was \\emph{not}\ngenerated by the provider's models without access to the secret key, e.g., to\nfalsely accuse the provider. Stealing attacks collect \\emph{harmless}\nwatermarked samples from the provider's model and aim to maximize the expected\nsuccess rate of generating \\emph{harmful} watermarked samples. Our work focuses\non mitigating stealing attacks while treating the underlying watermark as a\nblack-box. Our contributions are: (i) Proposing a multi-key extension to\nmitigate stealing attacks that can be applied post-hoc to any watermarking\nmethod across any modality. (ii) We provide theoretical guarantees and\ndemonstrate empirically that our method makes forging substantially less\neffective across multiple datasets, and (iii) we formally define the threat of\nwatermark forging as the task of generating harmful, watermarked content and\nmodel this threat via security games.",
      "pdf_url": "http://arxiv.org/pdf/2507.07871v1",
      "published": "2025-07-10T15:52:32+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07871v1",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Alpay Algebra V: Multi-Layered Semantic Games and Transfinite Fixed-Point Simulation",
      "authors": [
        "Bugra Kilictas",
        "Faruk Alpay"
      ],
      "abstract": "This paper extends the self-referential framework of Alpay Algebra into a\nmulti-layered semantic game architecture where transfinite fixed-point\nconvergence encompasses hierarchical sub-games at each iteration level.\nBuilding upon Alpay Algebra IV's empathetic embedding concept, we introduce a\nnested game-theoretic structure where the alignment process between AI systems\nand documents becomes a meta-game containing embedded decision problems. We\nformalize this through a composite operator $\\phi(\\cdot, \\gamma(\\cdot))$ where\n$\\phi$ drives the main semantic convergence while $\\gamma$ resolves local\nsub-games. The resulting framework demonstrates that game-theoretic reasoning\nemerges naturally from fixed-point iteration rather than being imposed\nexternally. We prove a Game Theorem establishing existence and uniqueness of\nsemantic equilibria under realistic cognitive simulation assumptions. Our\nverification suite includes adaptations of Banach's fixed-point theorem to\ntransfinite contexts, a novel $\\phi$-topology based on the\nKozlov-Maz'ya-Rossmann formula for handling semantic singularities, and\ncategorical consistency tests via the Yoneda lemma. The paper itself functions\nas a semantic artifact designed to propagate its fixed-point patterns in AI\nembedding spaces -- a deliberate instantiation of the \"semantic virus\" concept\nit theorizes. All results are grounded in category theory, information theory,\nand realistic AI cognition models, ensuring practical applicability beyond pure\nmathematical abstraction.",
      "pdf_url": "http://arxiv.org/pdf/2507.07868v1",
      "published": "2025-07-10T15:48:23+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07868v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "68T50, 68T07, 03G30, 18C10",
        "I.2.7; I.2.6; F.4.1"
      ]
    },
    {
      "title": "Searching for actual causes: Approximate algorithms with adjustable precision",
      "authors": [
        "Samuel Reyd",
        "Ada Diaconescu",
        "Jean-Louis Dessalles"
      ],
      "abstract": "Causality has gained popularity in recent years. It has helped improve the\nperformance, reliability, and interpretability of machine learning models.\nHowever, recent literature on explainable artificial intelligence (XAI) has\nfaced criticism. The classical XAI and causality literature focuses on\nunderstanding which factors contribute to which consequences. While such\nknowledge is valuable for researchers and engineers, it is not what non-expert\nusers expect as explanations. Instead, these users often await facts that cause\nthe target consequences, i.e., actual causes. Formalizing this notion is still\nan open problem. Additionally, identifying actual causes is reportedly an\nNP-complete problem, and there are too few practical solutions to approximate\nformal definitions. We propose a set of algorithms to identify actual causes\nwith a polynomial complexity and an adjustable level of precision and\nexhaustiveness. Our experiments indicate that the algorithms (1) identify\ncauses for different categories of systems that are not handled by existing\napproaches (i.e., non-boolean, black-box, and stochastic systems), (2) can be\nadjusted to gain more precision and exhaustiveness with more computation time.",
      "pdf_url": "http://arxiv.org/pdf/2507.07857v1",
      "published": "2025-07-10T15:39:36+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07857v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Optimization Guarantees for Square-Root Natural-Gradient Variational Inference",
      "authors": [
        "Navish Kumar",
        "Thomas Möllenhoff",
        "Mohammad Emtiyaz Khan",
        "Aurelien Lucchi"
      ],
      "abstract": "Variational inference with natural-gradient descent often shows fast\nconvergence in practice, but its theoretical convergence guarantees have been\nchallenging to establish. This is true even for the simplest cases that involve\nconcave log-likelihoods and use a Gaussian approximation. We show that the\nchallenge can be circumvented for such cases using a square-root\nparameterization for the Gaussian covariance. This approach establishes novel\nconvergence guarantees for natural-gradient variational-Gaussian inference and\nits continuous-time gradient flow. Our experiments demonstrate the\neffectiveness of natural gradient methods and highlight their advantages over\nalgorithms that use Euclidean or Wasserstein geometries.",
      "pdf_url": "http://arxiv.org/pdf/2507.07853v1",
      "published": "2025-07-10T15:33:28+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07853v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "From Ambiguity to Accuracy: The Transformative Effect of Coreference Resolution on Retrieval-Augmented Generation systems",
      "authors": [
        "Youngjoon Jang",
        "Seongtae Hong",
        "Junyoung Son",
        "Sungjin Park",
        "Chanjun Park",
        "Heuiseok Lim"
      ],
      "abstract": "Retrieval-Augmented Generation (RAG) has emerged as a crucial framework in\nnatural language processing (NLP), improving factual consistency and reducing\nhallucinations by integrating external document retrieval with large language\nmodels (LLMs). However, the effectiveness of RAG is often hindered by\ncoreferential complexity in retrieved documents, introducing ambiguity that\ndisrupts in-context learning. In this study, we systematically investigate how\nentity coreference affects both document retrieval and generative performance\nin RAG-based systems, focusing on retrieval relevance, contextual\nunderstanding, and overall response quality. We demonstrate that coreference\nresolution enhances retrieval effectiveness and improves question-answering\n(QA) performance. Through comparative analysis of different pooling strategies\nin retrieval tasks, we find that mean pooling demonstrates superior context\ncapturing ability after applying coreference resolution. In QA tasks, we\ndiscover that smaller models benefit more from the disambiguation process,\nlikely due to their limited inherent capacity for handling referential\nambiguity. With these findings, this study aims to provide a deeper\nunderstanding of the challenges posed by coreferential complexity in RAG,\nproviding guidance for improving retrieval and generation in\nknowledge-intensive AI applications.",
      "pdf_url": "http://arxiv.org/pdf/2507.07847v1",
      "published": "2025-07-10T15:26:59+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07847v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Benchmarking Content-Based Puzzle Solvers on Corrupted Jigsaw Puzzles",
      "authors": [
        "Richard Dirauf",
        "Florian Wolz",
        "Dario Zanca",
        "Björn Eskofier"
      ],
      "abstract": "Content-based puzzle solvers have been extensively studied, demonstrating\nsignificant progress in computational techniques. However, their evaluation\noften lacks realistic challenges crucial for real-world applications, such as\nthe reassembly of fragmented artefacts or shredded documents. In this work, we\ninvestigate the robustness of State-Of-The-Art content-based puzzle solvers\nintroducing three types of jigsaw puzzle corruptions: missing pieces, eroded\nedges, and eroded contents. Evaluating both heuristic and deep learning-based\nsolvers, we analyse their ability to handle these corruptions and identify key\nlimitations. Our results show that solvers developed for standard puzzles have\na rapid decline in performance if more pieces are corrupted. However, deep\nlearning models can significantly improve their robustness through fine-tuning\nwith augmented data. Notably, the advanced Positional Diffusion model adapts\nparticularly well, outperforming its competitors in most experiments. Based on\nour findings, we highlight promising research directions for enhancing the\nautomated reconstruction of real-world artefacts.",
      "pdf_url": "http://arxiv.org/pdf/2507.07828v1",
      "published": "2025-07-10T15:01:23+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07828v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "AI Should Sense Better, Not Just Scale Bigger: Adaptive Sensing as a Paradigm Shift",
      "authors": [
        "Eunsu Baek",
        "Keondo Park",
        "Jeonggil Ko",
        "Min-hwan Oh",
        "Taesik Gong",
        "Hyung-Sin Kim"
      ],
      "abstract": "Current AI advances largely rely on scaling neural models and expanding\ntraining datasets to achieve generalization and robustness. Despite notable\nsuccesses, this paradigm incurs significant environmental, economic, and\nethical costs, limiting sustainability and equitable access. Inspired by\nbiological sensory systems, where adaptation occurs dynamically at the input\n(e.g., adjusting pupil size, refocusing vision)--we advocate for adaptive\nsensing as a necessary and foundational shift. Adaptive sensing proactively\nmodulates sensor parameters (e.g., exposure, sensitivity, multimodal\nconfigurations) at the input level, significantly mitigating covariate shifts\nand improving efficiency. Empirical evidence from recent studies demonstrates\nthat adaptive sensing enables small models (e.g., EfficientNet-B0) to surpass\nsubstantially larger models (e.g., OpenCLIP-H) trained with significantly more\ndata and compute. We (i) outline a roadmap for broadly integrating adaptive\nsensing into real-world applications spanning humanoid, healthcare, autonomous\nsystems, agriculture, and environmental monitoring, (ii) critically assess\ntechnical and ethical integration challenges, and (iii) propose targeted\nresearch directions, such as standardized benchmarks, real-time adaptive\nalgorithms, multimodal integration, and privacy-preserving methods.\nCollectively, these efforts aim to transition the AI community toward\nsustainable, robust, and equitable artificial intelligence systems.",
      "pdf_url": "http://arxiv.org/pdf/2507.07820v1",
      "published": "2025-07-10T14:50:32+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07820v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "MoSE: Skill-by-Skill Mixture-of-Expert Learning for Autonomous Driving",
      "authors": [
        "Lu Xu",
        "Jiaqian Yu",
        "Xiongfeng Peng",
        "Yiwei Chen",
        "Weiming Li",
        "Jaewook Yoo",
        "Sunghyun Chunag",
        "Dongwook Lee",
        "Daehyun Ji",
        "Chao Zhang"
      ],
      "abstract": "Recent studies show large language models (LLMs) and vision language models\n(VLMs) trained using web-scale data can empower end-to-end autonomous driving\nsystems for a better generalization and interpretation. Specifically, by\ndynamically routing inputs to specialized subsets of parameters, the\nMixture-of-Experts (MoE) technique enables general LLMs or VLMs to achieve\nsubstantial performance improvements while maintaining computational\nefficiency. However, general MoE models usually demands extensive training data\nand complex optimization. In this work, inspired by the learning process of\nhuman drivers, we propose a skill-oriented MoE, called MoSE, which mimics human\ndrivers' learning process and reasoning process, skill-by-skill and\nstep-by-step. We propose a skill-oriented routing mechanism that begins with\ndefining and annotating specific skills, enabling experts to identify the\nnecessary driving competencies for various scenarios and reasoning tasks,\nthereby facilitating skill-by-skill learning. Further align the driving process\nto multi-step planning in human reasoning and end-to-end driving models, we\nbuild a hierarchical skill dataset and pretrain the router to encourage the\nmodel to think step-by-step. Unlike multi-round dialogs, MoSE integrates\nvaluable auxiliary tasks (e.g.\\ description, reasoning, planning) in one single\nforward process without introducing any extra computational cost. With less\nthan 3B sparsely activated parameters, our model outperforms several 8B+\nparameters on CODA AD corner case reasoning task. Compared to existing methods\nbased on open-source models and data, our approach achieves state-of-the-art\nperformance with significantly reduced activated model size (at least by\n$62.5\\%$) with a single-turn conversation.",
      "pdf_url": "http://arxiv.org/pdf/2507.07818v1",
      "published": "2025-07-10T14:48:08+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07818v1",
      "categories": [
        "cs.AI",
        "cs.CV",
        "cs.LG"
      ]
    },
    {
      "title": "On the Effect of Instruction Tuning Loss on Generalization",
      "authors": [
        "Anwoy Chatterjee",
        "H S V N S Kowndinya Renduchintala",
        "Sumit Bhatia",
        "Tanmoy Chakraborty"
      ],
      "abstract": "Instruction Tuning has emerged as a pivotal post-training paradigm that\nenables pre-trained language models to better follow user instructions. Despite\nits significance, little attention has been given to optimizing the loss\nfunction used. A fundamental, yet often overlooked, question is whether the\nconventional auto-regressive objective - where loss is computed only on\nresponse tokens, excluding prompt tokens - is truly optimal for instruction\ntuning. In this work, we systematically investigate the impact of\ndifferentially weighting prompt and response tokens in instruction tuning loss,\nand propose Weighted Instruction Tuning (WIT) as a better alternative to\nconventional instruction tuning. Through extensive experiments on five language\nmodels of different families and scale, three finetuning datasets of different\nsizes, and five diverse evaluation benchmarks, we show that the standard\ninstruction tuning loss often yields suboptimal performance and limited\nrobustness to input prompt variations. We find that a low-to-moderate weight\nfor prompt tokens coupled with a moderate-to-high weight for response tokens\nyields the best-performing models across settings and also serve as better\nstarting points for the subsequent preference alignment training. These\nfindings highlight the need to reconsider instruction tuning loss and offer\nactionable insights for developing more robust and generalizable models. Our\ncode is open-sourced at https://github.com/kowndinya-renduchintala/WIT.",
      "pdf_url": "http://arxiv.org/pdf/2507.07817v1",
      "published": "2025-07-10T14:46:33+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07817v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Bridging Logic and Learning: Decoding Temporal Logic Embeddings via Transformers",
      "authors": [
        "Sara Candussio",
        "Gaia Saveri",
        "Gabriele Sarti",
        "Luca Bortolussi"
      ],
      "abstract": "Continuous representations of logic formulae allow us to integrate symbolic\nknowledge into data-driven learning algorithms. If such embeddings are\nsemantically consistent, i.e. if similar specifications are mapped into nearby\nvectors, they enable continuous learning and optimization directly in the\nsemantic space of formulae. However, to translate the optimal continuous\nrepresentation into a concrete requirement, such embeddings must be invertible.\nWe tackle this issue by training a Transformer-based decoder-only model to\ninvert semantic embeddings of Signal Temporal Logic (STL) formulae. STL is a\npowerful formalism that allows us to describe properties of signals varying\nover time in an expressive yet concise way. By constructing a small vocabulary\nfrom STL syntax, we demonstrate that our proposed model is able to generate\nvalid formulae after only 1 epoch and to generalize to the semantics of the\nlogic in about 10 epochs. Additionally, the model is able to decode a given\nembedding into formulae that are often simpler in terms of length and nesting\nwhile remaining semantically close (or equivalent) to gold references. We show\nthe effectiveness of our methodology across various levels of training formulae\ncomplexity to assess the impact of training data on the model's ability to\neffectively capture the semantic information contained in the embeddings and\ngeneralize out-of-distribution. Finally, we deploy our model for solving a\nrequirement mining task, i.e. inferring STL specifications that solve a\nclassification task on trajectories, performing the optimization directly in\nthe semantic space.",
      "pdf_url": "http://arxiv.org/pdf/2507.07808v1",
      "published": "2025-07-10T14:35:37+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07808v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Visual Instance-aware Prompt Tuning",
      "authors": [
        "Xi Xiao",
        "Yunbei Zhang",
        "Xingjian Li",
        "Tianyang Wang",
        "Xiao Wang",
        "Yuxiang Wei",
        "Jihun Hamm",
        "Min Xu"
      ],
      "abstract": "Visual Prompt Tuning (VPT) has emerged as a parameter-efficient fine-tuning\nparadigm for vision transformers, with conventional approaches utilizing\ndataset-level prompts that remain the same across all input instances. We\nobserve that this strategy results in sub-optimal performance due to high\nvariance in downstream datasets. To address this challenge, we propose Visual\nInstance-aware Prompt Tuning (ViaPT), which generates instance-aware prompts\nbased on each individual input and fuses them with dataset-level prompts,\nleveraging Principal Component Analysis (PCA) to retain important prompting\ninformation. Moreover, we reveal that VPT-Deep and VPT-Shallow represent two\ncorner cases based on a conceptual understanding, in which they fail to\neffectively capture instance-specific information, while random dimension\nreduction on prompts only yields performance between the two extremes. Instead,\nViaPT overcomes these limitations by balancing dataset-level and instance-level\nknowledge, while reducing the amount of learnable parameters compared to\nVPT-Deep. Extensive experiments across 34 diverse datasets demonstrate that our\nmethod consistently outperforms state-of-the-art baselines, establishing a new\nparadigm for analyzing and optimizing visual prompts for vision transformers.",
      "pdf_url": "http://arxiv.org/pdf/2507.07796v1",
      "published": "2025-07-10T14:23:15+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07796v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Measuring AI Alignment with Human Flourishing",
      "authors": [
        "Elizabeth Hilliard",
        "Akshaya Jagadeesh",
        "Alex Cook",
        "Steele Billings",
        "Nicholas Skytland",
        "Alicia Llewellyn",
        "Jackson Paull",
        "Nathan Paull",
        "Nolan Kurylo",
        "Keatra Nesbitt",
        "Robert Gruenewald",
        "Anthony Jantzi",
        "Omar Chavez"
      ],
      "abstract": "This paper introduces the Flourishing AI Benchmark (FAI Benchmark), a novel\nevaluation framework that assesses AI alignment with human flourishing across\nseven dimensions: Character and Virtue, Close Social Relationships, Happiness\nand Life Satisfaction, Meaning and Purpose, Mental and Physical Health,\nFinancial and Material Stability, and Faith and Spirituality. Unlike\ntraditional benchmarks that focus on technical capabilities or harm prevention,\nthe FAI Benchmark measures AI performance on how effectively models contribute\nto the flourishing of a person across these dimensions. The benchmark evaluates\nhow effectively LLM AI systems align with current research models of holistic\nhuman well-being through a comprehensive methodology that incorporates 1,229\nobjective and subjective questions. Using specialized judge Large Language\nModels (LLMs) and cross-dimensional evaluation, the FAI Benchmark employs\ngeometric mean scoring to ensure balanced performance across all flourishing\ndimensions. Initial testing of 28 leading language models reveals that while\nsome models approach holistic alignment (with the highest-scoring models\nachieving 72/100), none are acceptably aligned across all dimensions,\nparticularly in Faith and Spirituality, Character and Virtue, and Meaning and\nPurpose. This research establishes a framework for developing AI systems that\nactively support human flourishing rather than merely avoiding harm, offering\nsignificant implications for AI development, ethics, and evaluation.",
      "pdf_url": "http://arxiv.org/pdf/2507.07787v2",
      "published": "2025-07-10T14:09:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07787v2",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Where are we with calibration under dataset shift in image classification?",
      "authors": [
        "Mélanie Roschewitz",
        "Raghav Mehta",
        "Fabio de Sousa Ribeiro",
        "Ben Glocker"
      ],
      "abstract": "We conduct an extensive study on the state of calibration under real-world\ndataset shift for image classification. Our work provides important insights on\nthe choice of post-hoc and in-training calibration techniques, and yields\npractical guidelines for all practitioners interested in robust calibration\nunder shift. We compare various post-hoc calibration methods, and their\ninteractions with common in-training calibration strategies (e.g., label\nsmoothing), across a wide range of natural shifts, on eight different\nclassification tasks across several imaging domains. We find that: (i)\nsimultaneously applying entropy regularisation and label smoothing yield the\nbest calibrated raw probabilities under dataset shift, (ii) post-hoc\ncalibrators exposed to a small amount of semantic out-of-distribution data\n(unrelated to the task) are most robust under shift, (iii) recent calibration\nmethods specifically aimed at increasing calibration under shifts do not\nnecessarily offer significant improvements over simpler post-hoc calibration\nmethods, (iv) improving calibration under shifts often comes at the cost of\nworsening in-distribution calibration. Importantly, these findings hold for\nrandomly initialised classifiers, as well as for those finetuned from\nfoundation models, the latter being consistently better calibrated compared to\nmodels trained from scratch. Finally, we conduct an in-depth analysis of\nensembling effects, finding that (i) applying calibration prior to ensembling\n(instead of after) is more effective for calibration under shifts, (ii) for\nensembles, OOD exposure deteriorates the ID-shifted calibration trade-off,\n(iii) ensembling remains one of the most effective methods to improve\ncalibration robustness and, combined with finetuning from foundation models,\nyields best calibration results overall.",
      "pdf_url": "http://arxiv.org/pdf/2507.07780v1",
      "published": "2025-07-10T13:59:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07780v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Synchronizing Task Behavior: Aligning Multiple Tasks during Test-Time Training",
      "authors": [
        "Wooseong Jeong",
        "Jegyeong Cho",
        "Youngho Yoon",
        "Kuk-Jin Yoon"
      ],
      "abstract": "Generalizing neural networks to unseen target domains is a significant\nchallenge in real-world deployments. Test-time training (TTT) addresses this by\nusing an auxiliary self-supervised task to reduce the domain gap caused by\ndistribution shifts between the source and target. However, we find that when\nmodels are required to perform multiple tasks under domain shifts, conventional\nTTT methods suffer from unsynchronized task behavior, where the adaptation\nsteps needed for optimal performance in one task may not align with the\nrequirements of other tasks. To address this, we propose a novel TTT approach\ncalled Synchronizing Tasks for Test-time Training (S4T), which enables the\nconcurrent handling of multiple tasks. The core idea behind S4T is that\npredicting task relations across domain shifts is key to synchronizing tasks\nduring test time. To validate our approach, we apply S4T to conventional\nmulti-task benchmarks, integrating it with traditional TTT protocols. Our\nempirical results show that S4T outperforms state-of-the-art TTT methods across\nvarious benchmarks.",
      "pdf_url": "http://arxiv.org/pdf/2507.07778v1",
      "published": "2025-07-10T13:58:32+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07778v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "OPC: One-Point-Contraction Unlearning Toward Deep Feature Forgetting",
      "authors": [
        "Jaeheun Jung",
        "Bosung Jung",
        "Suhyun Bae",
        "Donghun Lee"
      ],
      "abstract": "Machine unlearning seeks to remove the influence of particular data or class\nfrom trained models to meet privacy, legal, or ethical requirements. Existing\nunlearning methods tend to forget shallowly: phenomenon of an unlearned model\npretend to forget by adjusting only the model response, while its internal\nrepresentations retain information sufficiently to restore the forgotten data\nor behavior. We empirically confirm the widespread shallowness by reverting the\nforgetting effect of various unlearning methods via training-free performance\nrecovery attack and gradient-inversion-based data reconstruction attack. To\naddress this vulnerability fundamentally, we define a theoretical criterion of\n``deep forgetting'' based on one-point-contraction of feature representations\nof data to forget. We also propose an efficient approximation algorithm, and\nuse it to construct a novel general-purpose unlearning algorithm:\nOne-Point-Contraction (OPC). Empirical evaluations on image classification\nunlearning benchmarks show that OPC achieves not only effective unlearning\nperformance but also superior resilience against both performance recovery\nattack and gradient-inversion attack. The distinctive unlearning performance of\nOPC arises from the deep feature forgetting enforced by its theoretical\nfoundation, and recaps the need for improved robustness of machine unlearning\nmethods.",
      "pdf_url": "http://arxiv.org/pdf/2507.07754v1",
      "published": "2025-07-10T13:34:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07754v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "When Large Language Models Meet Law: Dual-Lens Taxonomy, Technical Advances, and Ethical Governance",
      "authors": [
        "Peizhang Shao",
        "Linrui Xu",
        "Jinxi Wang",
        "Wei Zhou",
        "Xingyu Wu"
      ],
      "abstract": "This paper establishes the first comprehensive review of Large Language\nModels (LLMs) applied within the legal domain. It pioneers an innovative dual\nlens taxonomy that integrates legal reasoning frameworks and professional\nontologies to systematically unify historical research and contemporary\nbreakthroughs. Transformer-based LLMs, which exhibit emergent capabilities such\nas contextual reasoning and generative argumentation, surmount traditional\nlimitations by dynamically capturing legal semantics and unifying evidence\nreasoning. Significant progress is documented in task generalization, reasoning\nformalization, workflow integration, and addressing core challenges in text\nprocessing, knowledge integration, and evaluation rigor via technical\ninnovations like sparse attention mechanisms and mixture-of-experts\narchitectures. However, widespread adoption of LLM introduces critical\nchallenges: hallucination, explainability deficits, jurisdictional adaptation\ndifficulties, and ethical asymmetry. This review proposes a novel taxonomy that\nmaps legal roles to NLP subtasks and computationally implements the Toulmin\nargumentation framework, thus systematizing advances in reasoning, retrieval,\nprediction, and dispute resolution. It identifies key frontiers including\nlow-resource systems, multimodal evidence integration, and dynamic rebuttal\nhandling. Ultimately, this work provides both a technical roadmap for\nresearchers and a conceptual framework for practitioners navigating the\nalgorithmic future, laying a robust foundation for the next era of legal\nartificial intelligence. We have created a GitHub repository to index the\nrelevant papers: https://github.com/Kilimajaro/LLMs_Meet_Law.",
      "pdf_url": "http://arxiv.org/pdf/2507.07748v1",
      "published": "2025-07-10T13:26:34+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07748v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Identification of Violin Reduction via Contour Lines Classification",
      "authors": [
        "Philémon Beghin",
        "Anne-Emmanuelle Ceulemans",
        "François Glineur"
      ],
      "abstract": "The first violins appeared in late 16th-century Italy. Over the next 200\nyears, they spread across Europe and luthiers of various royal courts, eager to\nexperiment with new techniques, created a highly diverse family of instruments.\nAround 1750, size standards were introduced to unify violin making for\norchestras and conservatories. Instruments that fell between two standards were\nthen reduced to a smaller size by luthiers. These reductions have an impact on\nseveral characteristics of violins, in particular on the contour lines, i.e.\nlines of constant altitude, which look more like a U for non reduced\ninstruments and a V for reduced ones. While such differences are observed by\nexperts, they have not been studied quantitatively.\n  This paper presents a method for classifying violins as reduced or\nnon-reduced based on their contour lines. We study a corpus of 25 instruments\nwhose 3D geometric meshes were acquired via photogrammetry. For each\ninstrument, we extract 10-20 contour lines regularly spaced every millimetre.\nEach line is fitted with a parabola-like curve (with an equation of the type y\n= alpha*abs(x)**beta) depending on two parameters, describing how open (beta)\nand how vertically stretched (alpha) the curve is. We compute additional\nfeatures from those parameters, using regressions and counting how many values\nfall under some threshold. We also deal with outliers and non equal numbers of\nlevels, and eventually obtain a numerical profile for each instrument.\n  We then apply classification methods to assess whether geometry alone can\npredict size reduction. We find that distinguishing between reduced and non\nreduced instruments is feasible to some degree, taking into account that a\nwhole spectrum of more or less transformed violins exists, for which it is more\ndifficult to quantify the reduction. We also find the opening parameter beta to\nbe the most predictive.",
      "pdf_url": "http://arxiv.org/pdf/2507.07743v1",
      "published": "2025-07-10T13:23:15+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07743v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Not All Preferences are What You Need for Post-Training: Selective Alignment Strategy for Preference Optimization",
      "authors": [
        "Zhijin Dong"
      ],
      "abstract": "Post-training alignment of large language models (LLMs) is a critical\nchallenge, as not all tokens contribute equally to model performance. This\npaper introduces a selective alignment strategy that prioritizes high-impact\ntokens within preference pairs, leveraging token-level log-probability\ndifferences between the current policy and a reference model. By focusing on\nthese informative tokens, our approach reduces computational overhead and\nenhances alignment fidelity. We further explore the role of reference model\nquality, demonstrating that stronger reference models significantly improve\ntoken selection accuracy and overall optimization effectiveness. Comprehensive\nexperiments on benchmarks such as Arena-Hard and MT-Bench validate the\nsuperiority of our Selective-DPO method over standard DPO and\ndistillation-based baselines. Our findings highlight the importance of\ntoken-level optimization and reference model selection in advancing preference\nalignment for LLMs. The code is available at\nhttps://github.com/Dongzhijin/SDPO.",
      "pdf_url": "http://arxiv.org/pdf/2507.07725v1",
      "published": "2025-07-10T12:58:45+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07725v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Stable Preference Optimization for LLMs: A Bilevel Approach Beyond Direct Preference Optimization",
      "authors": [
        "Chengtao Jian",
        "Kai Yang",
        "Ye Ouyang",
        "Xiaozhou Ye"
      ],
      "abstract": "Direct Preference Optimization (DPO) has emerged as a popular and efficient\nalternative to reward modeling and reinforcement learning for aligning language\nmodels with human preferences. Despite its empirical success, the theoretical\nproperties and intrinsic limitations of DPO remain underexplored. In this work,\nwe first present a comprehensive analysis of DPO's dynamics from a probability\nevolution perspective. Our analysis reveals that DPO is highly sensitive to\ninitialization. It also tends to misallocate probability mass, which can\ninadvertently shift probability toward irrelevant or undesired responses. This\nmisallocation may unintentionally reinforce model bias, thereby compromising\nboth the stability of model alignment and the consistency with intended\npreferences. Motivated by these theoretical findings, we propose a\ntheoretically grounded bilevel optimization framework that tightly integrate\nsupervised fine-tuning with an enhanced DPO objective a.k.a. stable preference\noptimization. Our approach introduces a principled regularization scheme to\nexplicitly encourage absolute probability improvement for preferred outputs,\nwhile maintaining stable optimization dynamics. Experiments on challenging\nreasoning and summarization benchmarks elucidate that our method consistently\nimproves reasoning accuracy and better aligns output distributions with\nintended preferences, outperforming standard DPO. Stable preference\noptimization provides new insights into the design of preference-based\nalignment objectives and opens up new avenues towards more reliable and\ninterpretable language model alignment.",
      "pdf_url": "http://arxiv.org/pdf/2507.07723v1",
      "published": "2025-07-10T12:57:39+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07723v1",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ]
    },
    {
      "title": "Adaptive Gaussian Mixture Models-based Anomaly Detection for under-constrained Cable-Driven Parallel Robots",
      "authors": [
        "Julio Garrido",
        "Javier Vales",
        "Diego Silva-Muñiz",
        "Enrique Riveiro",
        "Pablo López-Matencio",
        "Josué Rivera-Andrade"
      ],
      "abstract": "Cable-Driven Parallel Robots (CDPRs) are increasingly used for load\nmanipulation tasks involving predefined toolpaths with intermediate stops. At\neach stop, where the platform maintains a fixed pose and the motors keep the\ncables under tension, the system must evaluate whether it is safe to proceed by\ndetecting anomalies that could compromise performance (e.g., wind gusts or\ncable impacts). This paper investigates whether anomalies can be detected using\nonly motor torque data, without additional sensors. It introduces an adaptive,\nunsupervised outlier detection algorithm based on Gaussian Mixture Models\n(GMMs) to identify anomalies from torque signals. The method starts with a\nbrief calibration period, just a few seconds, during which a GMM is fit on\nknown anomaly-free data. Real-time torque measurements are then evaluated using\nMahalanobis distance from the GMM, with statistically derived thresholds\ntriggering anomaly flags. Model parameters are periodically updated using the\nlatest segments identified as anomaly-free to adapt to changing conditions.\nValidation includes 14 long-duration test sessions simulating varied wind\nintensities. The proposed method achieves a 100% true positive rate and 95.4%\naverage true negative rate, with 1-second detection latency. Comparative\nevaluation against power threshold and non-adaptive GMM methods indicates\nhigher robustness to drift and environmental variation.",
      "pdf_url": "http://arxiv.org/pdf/2507.07714v1",
      "published": "2025-07-10T12:52:19+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07714v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "KeyKnowledgeRAG (K^2RAG): An Enhanced RAG method for improved LLM question-answering capabilities",
      "authors": [
        "Hruday Markondapatnaikuni",
        "Basem Suleiman",
        "Abdelkarim Erradi",
        "Shijing Chen"
      ],
      "abstract": "Fine-tuning is an immensely resource-intensive process when retraining Large\nLanguage Models (LLMs) to incorporate a larger body of knowledge. Although many\nfine-tuning techniques have been developed to reduce the time and computational\ncost involved, the challenge persists as LLMs continue to grow in size and\ncomplexity. To address this, a new approach to knowledge expansion in LLMs is\nneeded. Retrieval-Augmented Generation (RAG) offers one such alternative by\nstoring external knowledge in a database and retrieving relevant chunks to\nsupport question answering. However, naive implementations of RAG face\nsignificant limitations in scalability and answer accuracy. This paper\nintroduces KeyKnowledgeRAG (K2RAG), a novel framework designed to overcome\nthese limitations. Inspired by the divide-and-conquer paradigm, K2RAG\nintegrates dense and sparse vector search, knowledge graphs, and text\nsummarization to improve retrieval quality and system efficiency. The framework\nalso includes a preprocessing step that summarizes the training data,\nsignificantly reducing the training time. K2RAG was evaluated using the\nMultiHopRAG dataset, where the proposed pipeline was trained on the document\ncorpus and tested on a separate evaluation set. Results demonstrated notable\nimprovements over common naive RAG implementations. K2RAG achieved the highest\nmean answer similarity score of 0.57, and reached the highest third quartile\n(Q3) similarity of 0.82, indicating better alignment with ground-truth answers.\nIn addition to improved accuracy, the framework proved highly efficient. The\nsummarization step reduced the average training time of individual components\nby 93%, and execution speed was up to 40% faster than traditional knowledge\ngraph-based RAG systems. K2RAG also demonstrated superior scalability,\nrequiring three times less VRAM than several naive RAG implementations tested\nin this study.",
      "pdf_url": "http://arxiv.org/pdf/2507.07695v1",
      "published": "2025-07-10T12:19:03+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07695v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Rationale-Enhanced Decoding for Multi-modal Chain-of-Thought",
      "authors": [
        "Shin'ya Yamaguchi",
        "Kosuke Nishida",
        "Daiki Chijiwa"
      ],
      "abstract": "Large vision-language models (LVLMs) have demonstrated remarkable\ncapabilities by integrating pre-trained vision encoders with large language\nmodels (LLMs). Similar to single-modal LLMs, chain-of-thought (CoT) prompting\nhas been adapted for LVLMs to enhance multi-modal reasoning by generating\nintermediate rationales based on visual and textual inputs. While CoT is\nassumed to improve grounding and accuracy in LVLMs, our experiments reveal a\nkey challenge: existing LVLMs often ignore the contents of generated rationales\nin CoT reasoning. To address this, we re-formulate multi-modal CoT reasoning as\na KL-constrained reward maximization focused on rationale-conditional\nlog-likelihood. As the optimal solution, we propose rationale-enhanced decoding\n(RED), a novel plug-and-play inference-time decoding strategy. RED harmonizes\nvisual and rationale information by multiplying distinct image-conditional and\nrationale-conditional next token distributions. Extensive experiments show that\nRED consistently and significantly improves reasoning over standard CoT and\nother decoding methods across multiple benchmarks and LVLMs. Our work offers a\npractical and effective approach to improve both the faithfulness and accuracy\nof CoT reasoning in LVLMs, paving the way for more reliable rationale-grounded\nmulti-modal systems.",
      "pdf_url": "http://arxiv.org/pdf/2507.07685v1",
      "published": "2025-07-10T12:07:13+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07685v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Learning Pole Structures of Hadronic States using Predictive Uncertainty Estimation",
      "authors": [
        "Felix Frohnert",
        "Denny Lane B. Sombillo",
        "Evert van Nieuwenburg",
        "Patrick Emonts"
      ],
      "abstract": "Matching theoretical predictions to experimental data remains a central\nchallenge in hadron spectroscopy. In particular, the identification of new\nhadronic states is difficult, as exotic signals near threshold can arise from a\nvariety of physical mechanisms. A key diagnostic in this context is the pole\nstructure of the scattering amplitude, but different configurations can produce\nsimilar signatures. The mapping between pole configurations and line shapes is\nespecially ambiguous near the mass threshold, where analytic control is\nlimited. In this work, we introduce an uncertainty-aware machine learning\napproach for classifying pole structures in $S$-matrix elements. Our method is\nbased on an ensemble of classifier chains that provide both epistemic and\naleatoric uncertainty estimates. We apply a rejection criterion based on\npredictive uncertainty, achieving a validation accuracy of nearly $95\\%$ while\ndiscarding only a small fraction of high-uncertainty predictions. Trained on\nsynthetic data with known pole structures, the model generalizes to previously\nunseen experimental data, including enhancements associated with the\n$P_{c\\bar{c}}(4312)^+$ state observed by LHCb. In this, we infer a four-pole\nstructure, representing the presence of a genuine compact pentaquark in the\npresence of a higher channel virtual state pole with non-vanishing width. While\nevaluated on this particular state, our framework is broadly applicable to\nother candidate hadronic states and offers a scalable tool for pole structure\ninference in scattering amplitudes.",
      "pdf_url": "http://arxiv.org/pdf/2507.07668v2",
      "published": "2025-07-10T11:49:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07668v2",
      "categories": [
        "hep-ph",
        "cs.AI",
        "cs.LG",
        "hep-ex"
      ]
    },
    {
      "title": "PlanQA: A Benchmark for Spatial Reasoning in LLMs using Structured Representations",
      "authors": [
        "Fedor Rodionov",
        "Abdelrahman Eldesokey",
        "Michael Birsak",
        "John Femiani",
        "Bernard Ghanem",
        "Peter Wonka"
      ],
      "abstract": "We introduce PlanQA, a diagnostic benchmark for evaluating geometric and\nspatial reasoning in large-language models (LLMs). PlanQA is grounded in\nstructured representations of indoor scenes, such as kitchens, living rooms,\nand bedrooms, encoded in a symbolic format (e.g., JSON, XML layouts). The\nbenchmark includes diverse question types that test not only metric and\ntopological reasoning (e.g., distance, visibility, shortest paths) but also\ninterior design constraints such as affordance, clearance, balance, and\nusability. Our results across a variety of frontier open-source and commercial\nLLMs show that while models may succeed in shallow queries, they often fail to\nsimulate physical constraints, preserve spatial coherence, or generalize under\nlayout perturbation. PlanQA uncovers a clear blind spot in today's LLMs: they\ndo not consistently reason about real-world layouts. We hope that this\nbenchmark inspires new work on language models that can accurately infer and\nmanipulate spatial and geometric properties in practical settings.",
      "pdf_url": "http://arxiv.org/pdf/2507.07644v1",
      "published": "2025-07-10T11:16:48+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07644v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "TransformEEG: Towards Improving Model Generalizability in Deep Learning-based EEG Parkinson's Disease Detection",
      "authors": [
        "Federico Del Pup",
        "Riccardo Brun",
        "Filippo Iotti",
        "Edoardo Paccagnella",
        "Mattia Pezzato",
        "Sabrina Bertozzo",
        "Andrea Zanola",
        "Louis Fabrice Tshimanga",
        "Henning Müller",
        "Manfredo Atzori"
      ],
      "abstract": "Electroencephalography (EEG) is establishing itself as an important,\nlow-cost, noninvasive diagnostic tool for the early detection of Parkinson's\nDisease (PD). In this context, EEG-based Deep Learning (DL) models have shown\npromising results due to their ability to discover highly nonlinear patterns\nwithin the signal. However, current state-of-the-art DL models suffer from poor\ngeneralizability caused by high inter-subject variability. This high\nvariability underscores the need for enhancing model generalizability by\ndeveloping new architectures better tailored to EEG data. This paper introduces\nTransformEEG, a hybrid Convolutional-Transformer designed for Parkinson's\ndisease detection using EEG data. Unlike transformer models based on the EEGNet\nstructure, TransformEEG incorporates a depthwise convolutional tokenizer. This\ntokenizer is specialized in generating tokens composed by channel-specific\nfeatures, which enables more effective feature mixing within the self-attention\nlayers of the transformer encoder. To evaluate the proposed model, four public\ndatasets comprising 290 subjects (140 PD patients, 150 healthy controls) were\nharmonized and aggregated. A 10-outer, 10-inner Nested-Leave-N-Subjects-Out\n(N-LNSO) cross-validation was performed to provide an unbiased comparison\nagainst seven other consolidated EEG deep learning models. TransformEEG\nachieved the highest balanced accuracy's median (78.45%) as well as the lowest\ninterquartile range (6.37%) across all the N-LNSO partitions. When combined\nwith data augmentation and threshold correction, median accuracy increased to\n80.10%, with an interquartile range of 5.74%. In conclusion, TransformEEG\nproduces more consistent and less skewed results. It demonstrates a substantial\nreduction in variability and more reliable PD detection using EEG data compared\nto the other investigated models.",
      "pdf_url": "http://arxiv.org/pdf/2507.07622v1",
      "published": "2025-07-10T10:44:53+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07622v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Towards conservative inference in credal networks using belief functions: the case of credal chains",
      "authors": [
        "Marco Sangalli",
        "Thomas Krak",
        "Cassio de Campos"
      ],
      "abstract": "This paper explores belief inference in credal networks using Dempster-Shafer\ntheory. By building on previous work, we propose a novel framework for\npropagating uncertainty through a subclass of credal networks, namely chains.\nThe proposed approach efficiently yields conservative intervals through belief\nand plausibility functions, combining computational speed with robust\nuncertainty representation. Key contributions include formalizing belief-based\ninference methods and comparing belief-based inference against classical\nsensitivity analysis. Numerical results highlight the advantages and\nlimitations of applying belief inference within this framework, providing\ninsights into its practical utility for chains and for credal networks in\ngeneral.",
      "pdf_url": "http://arxiv.org/pdf/2507.07619v1",
      "published": "2025-07-10T10:40:24+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07619v1",
      "categories": [
        "cs.AI",
        "math.PR"
      ]
    },
    {
      "title": "Enhancing Vaccine Safety Surveillance: Extracting Vaccine Mentions from Emergency Department Triage Notes Using Fine-Tuned Large Language Models",
      "authors": [
        "Sedigh Khademi",
        "Jim Black",
        "Christopher Palmer",
        "Muhammad Javed",
        "Hazel Clothier",
        "Jim Buttery",
        "Gerardo Luis Dimaguila"
      ],
      "abstract": "This study evaluates fine-tuned Llama 3.2 models for extracting\nvaccine-related information from emergency department triage notes to support\nnear real-time vaccine safety surveillance. Prompt engineering was used to\ninitially create a labeled dataset, which was then confirmed by human\nannotators. The performance of prompt-engineered models, fine-tuned models, and\na rule-based approach was compared. The fine-tuned Llama 3 billion parameter\nmodel outperformed other models in its accuracy of extracting vaccine names.\nModel quantization enabled efficient deployment in resource-constrained\nenvironments. Findings demonstrate the potential of large language models in\nautomating data extraction from emergency department notes, supporting\nefficient vaccine safety surveillance and early detection of emerging adverse\nevents following immunization issues.",
      "pdf_url": "http://arxiv.org/pdf/2507.07599v1",
      "published": "2025-07-10T09:57:08+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07599v1",
      "categories": [
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "Context Pooling: Query-specific Graph Pooling for Generic Inductive Link Prediction in Knowledge Graphs",
      "authors": [
        "Zhixiang Su",
        "Di Wang",
        "Chunyan Miao"
      ],
      "abstract": "Recent investigations on the effectiveness of Graph Neural Network\n(GNN)-based models for link prediction in Knowledge Graphs (KGs) show that\nvanilla aggregation does not significantly impact the model performance. In\nthis paper, we introduce a novel method, named Context Pooling, to enhance\nGNN-based models' efficacy for link predictions in KGs. To our best of\nknowledge, Context Pooling is the first methodology that applies graph pooling\nin KGs. Additionally, Context Pooling is first-of-its-kind to enable the\ngeneration of query-specific graphs for inductive settings, where testing\nentities are unseen during training. Specifically, we devise two metrics,\nnamely neighborhood precision and neighborhood recall, to assess the neighbors'\nlogical relevance regarding the given queries, thereby enabling the subsequent\ncomprehensive identification of only the logically relevant neighbors for link\nprediction. Our method is generic and assessed by being applied to two\nstate-of-the-art (SOTA) models on three public transductive and inductive\ndatasets, achieving SOTA performance in 42 out of 48 settings.",
      "pdf_url": "http://arxiv.org/pdf/2507.07595v1",
      "published": "2025-07-10T09:54:37+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07595v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Bayesian Discrete Diffusion Beats Autoregressive Perplexity",
      "authors": [
        "Cooper Doyle"
      ],
      "abstract": "We reveal a hidden Bayesian core of discrete-diffusion language models by\nshowing that the expected denoiser output under the forward masking\ndistribution recovers the exact posterior over clean tokens. Under minimal\nassumptions, Monte Carlo marginalization over K independent corruptions\nconverges to this posterior at rate O(1/sqrt(K)), yielding a simple proof of\nconsistency and finite-sample error bounds. Building on this insight, we\nintroduce a lightweight inference-time ensemble that averages K\nmask-and-denoise passes to obtain posterior-aware token probabilities and\nuncertainty estimates at no extra training cost. On WikiText-2, our method\nachieves test perplexity 8.8 with K=8, versus 20.3 for GPT-2 Small, despite\nusing a model of comparable size. Code is available at\nhttps://github.com/mercury0100/bayesradd.",
      "pdf_url": "http://arxiv.org/pdf/2507.07586v1",
      "published": "2025-07-10T09:42:47+00:00",
      "arxiv_url": "http://arxiv.org/abs/2507.07586v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    }
  ]
}