{
  "last_updated": "2025-11-25T00:51:25.997920",
  "papers": [
    {
      "title": "Enhancing Quranic Learning: A Multimodal Deep Learning Approach for Arabic Phoneme Recognition",
      "authors": [
        "Ayhan Kucukmanisa",
        "Derya Gelmez",
        "Sukru Selim Calik",
        "Zeynep Hilal Kilimci"
      ],
      "abstract": "Recent advances in multimodal deep learning have greatly enhanced the capability of systems for speech analysis and pronunciation assessment. Accurate pronunciation detection remains a key challenge in Arabic, particularly in the context of Quranic recitation, where subtle phonetic differences can alter meaning. Addressing this challenge, the present study proposes a transformer-based multimodal framework for Arabic phoneme mispronunciation detection that combines acoustic and textual representations to achieve higher precision and robustness. The framework integrates UniSpeech-derived acoustic embeddings with BERT-based textual embeddings extracted from Whisper transcriptions, creating a unified representation that captures both phonetic detail and linguistic context. To determine the most effective integration strategy, early, intermediate, and late fusion methods were implemented and evaluated on two datasets containing 29 Arabic phonemes, including eight hafiz sounds, articulated by 11 native speakers. Additional speech samples collected from publicly available YouTube recordings were incorporated to enhance data diversity and generalization. Model performance was assessed using standard evaluation metrics: accuracy, precision, recall, and F1-score, allowing a detailed comparison of the fusion strategies. Experimental findings show that the UniSpeech-BERT multimodal configuration provides strong results and that fusion-based transformer architectures are effective for phoneme-level mispronunciation detection. The study contributes to the development of intelligent, speaker-independent, and multimodal Computer-Aided Language Learning (CALL) systems, offering a practical step toward technology-supported Quranic pronunciation training and broader speech-based educational applications.",
      "pdf_url": "https://arxiv.org/pdf/2511.17477v1",
      "published": "2025-11-21T18:25:46+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17477v1",
      "categories": [
        "cs.SD",
        "cs.AI"
      ]
    },
    {
      "title": "Masked-and-Reordered Self-Supervision for Reinforcement Learning from Verifiable Rewards",
      "authors": [
        "Zhen Wang",
        "Zhifeng Gao",
        "Guolin Ke"
      ],
      "abstract": "Test-time scaling has been shown to substantially improve large language models' (LLMs) mathematical reasoning. However, for a large portion of mathematical corpora, especially theorem proving, RLVR's scalability is limited: intermediate reasoning is crucial, while final answers are difficult to directly and reliably verify. Meanwhile, token-level SFT often degenerates into rote memorization rather than inducing longer chains of thought. Inspired by BERT's self-supervised tasks, we propose MR-RLVR (Masked-and-Reordered RLVR), which constructs process-level self-supervised rewards via \"masked-then-fill\" and \"step reordering\" to extract learnable signals from intermediate reasoning. Our training pipeline comprises two stages: we first perform self-supervised training on sampled mathematical calculation and proof data; we then conduct RLVR fine-tuning on mathematical calculation datasets where only outcomes are verifiable. We implement MR-RLVR on Qwen2.5-3B and DeepSeek-R1-Distill-Qwen-1.5B, and evaluate on AIME24, AIME25, AMC23, and MATH500. Under a fixed sampling and decoding budget, MR-RLVR achieves average relative gains over the original RLVR of +9.86% Pass@1, +5.27% Pass@5, and +4.00% Pass@8. These results indicate that incorporating process-aware self-supervised signals can effectively enhance RLVR's scalability and performance in only outcome-verifiable settings.",
      "pdf_url": "https://arxiv.org/pdf/2511.17473v1",
      "published": "2025-11-21T18:23:04+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17473v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "PersonaAgent with GraphRAG: Community-Aware Knowledge Graphs for Personalized LLM",
      "authors": [
        "Siqi Liang",
        "Yudi Zhang",
        "Yue Guo"
      ],
      "abstract": "We propose a novel framework for persona-based language model system, motivated by the need for personalized AI agents that adapt to individual user preferences. In our approach, the agent embodies the user's \"persona\" (e.g. user profile or taste) and is powered by a large language model (LLM). To enable the agent to leverage rich contextual information, we introduce a Knowledge-Graph-enhanced Retrieval-Augmented Generation (Graph RAG) mechanism that constructs an LLM-derived graph index of relevant documents and summarizes communities of related information. Our framework generates personalized prompts by combining: (1) a summary of the user's historical behaviors and preferences extracted from the knowledge graph, and (2) relevant global interaction patterns identified through graph-based community detection. This dynamic prompt engineering approach allows the agent to maintain consistent persona-aligned behaviors while benefiting from collective knowledge. On the LaMP benchmark, our method improves news categorization F1 by 11.1%, movie tagging F1 by 56.1%, and reduces product rating MAE by 10.4% over prior methods. Our code is available at https://anonymous.4open.science/r/PersonaAgentwGraphRAG-DE6F",
      "pdf_url": "https://arxiv.org/pdf/2511.17467v1",
      "published": "2025-11-21T18:15:47+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17467v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "SRA-CP: Spontaneous Risk-Aware Selective Cooperative Perception",
      "authors": [
        "Jiaxi Liu",
        "Chengyuan Ma",
        "Hang Zhou",
        "Weizhe Tang",
        "Shixiao Liang",
        "Haoyang Ding",
        "Xiaopeng Li",
        "Bin Ran"
      ],
      "abstract": "Cooperative perception (CP) offers significant potential to overcome the limitations of single-vehicle sensing by enabling information sharing among connected vehicles (CVs). However, existing generic CP approaches need to transmit large volumes of perception data that are irrelevant to the driving safety, exceeding available communication bandwidth. Moreover, most CP frameworks rely on pre-defined communication partners, making them unsuitable for dynamic traffic environments. This paper proposes a Spontaneous Risk-Aware Selective Cooperative Perception (SRA-CP) framework to address these challenges. SRA-CP introduces a decentralized protocol where connected agents continuously broadcast lightweight perception coverage summaries and initiate targeted cooperation only when risk-relevant blind zones are detected. A perceptual risk identification module enables each CV to locally assess the impact of occlusions on its driving task and determine whether cooperation is necessary. When CP is triggered, the ego vehicle selects appropriate peers based on shared perception coverage and engages in selective information exchange through a fusion module that prioritizes safety-critical content and adapts to bandwidth constraints. We evaluate SRA-CP on a public dataset against several representative baselines. Results show that SRA-CP achieves less than 1% average precision (AP) loss for safety-critical objects compared to generic CP, while using only 20% of the communication bandwidth. Moreover, it improves the perception performance by 15% over existing selective CP methods that do not incorporate risk awareness.",
      "pdf_url": "https://arxiv.org/pdf/2511.17461v1",
      "published": "2025-11-21T18:03:48+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17461v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Planning with Sketch-Guided Verification for Physics-Aware Video Generation",
      "authors": [
        "Yidong Huang",
        "Zun Wang",
        "Han Lin",
        "Dong-Ki Kim",
        "Shayegan Omidshafiei",
        "Jaehong Yoon",
        "Yue Zhang",
        "Mohit Bansal"
      ],
      "abstract": "Recent video generation approaches increasingly rely on planning intermediate control signals such as object trajectories to improve temporal coherence and motion fidelity. However, these methods mostly employ single-shot plans that are typically limited to simple motions, or iterative refinement which requires multiple calls to the video generator, incuring high computational cost. To overcome these limitations, we propose SketchVerify, a training-free, sketch-verification-based planning framework that improves motion planning quality with more dynamically coherent trajectories (i.e., physically plausible and instruction-consistent motions) prior to full video generation by introducing a test-time sampling and verification loop. Given a prompt and a reference image, our method predicts multiple candidate motion plans and ranks them using a vision-language verifier that jointly evaluates semantic alignment with the instruction and physical plausibility. To efficiently score candidate motion plans, we render each trajectory as a lightweight video sketch by compositing objects over a static background, which bypasses the need for expensive, repeated diffusion-based synthesis while achieving comparable performance. We iteratively refine the motion plan until a satisfactory one is identified, which is then passed to the trajectory-conditioned generator for final synthesis. Experiments on WorldModelBench and PhyWorldBench demonstrate that our method significantly improves motion quality, physical realism, and long-term consistency compared to competitive baselines while being substantially more efficient. Our ablation study further shows that scaling up the number of trajectory candidates consistently enhances overall performance.",
      "pdf_url": "https://arxiv.org/pdf/2511.17450v1",
      "published": "2025-11-21T17:48:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17450v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "GRAPHIC--Guidelines for Reviewing Algorithmic Practices in Human-centred Design and Interaction for Creativity",
      "authors": [
        "Joana Rovira Martins",
        "Pedro Martins",
        "Ana Boavida"
      ],
      "abstract": "Artificial Intelligence (AI) has been increasingly applied to creative domains, leading to the development of systems that collaborate with humans in design processes. In Graphic Design, integrating computational systems into co-creative workflows presents specific challenges, as it requires balancing scientific rigour with the subjective and visual nature of design practice. Following the PRISMA methodology, we identified 872 articles, resulting in a final corpus of 71 publications describing 68 unique systems. Based on this review, we introduce GRAPHIC (Guidelines for Reviewing Algorithmic Practices in Human-centred Design and Interaction for Creativity), a framework for analysing AI-based systems applied to Graphic Design. Its goal is to understand how current systems support human-AI collaboration in the Graphic Design discipline. The framework comprises main dimensions, which our analysis revealed to be essential across diverse system types: (1) Collaborative Panorama, (2) Processes and Modalities, and (3) Graphic Design Principles. Its application revealed research gaps, including the need to balance initiative and control between agents, improve communication through explainable interaction models, and promote systems that support transformational creativity grounded in core design principles.",
      "pdf_url": "https://arxiv.org/pdf/2511.17443v1",
      "published": "2025-11-21T17:42:09+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17443v1",
      "categories": [
        "cs.HC",
        "cs.AI",
        "cs.GR"
      ]
    },
    {
      "title": "REMSA: An LLM Agent for Foundation Model Selection in Remote Sensing",
      "authors": [
        "Binger Chen",
        "Tacettin Emre Bök",
        "Behnood Rasti",
        "Volker Markl",
        "Begüm Demir"
      ],
      "abstract": "Foundation Models (FMs) are increasingly used in remote sensing (RS) for tasks such as environmental monitoring, disaster assessment, and land-use mapping. These models include unimodal vision encoders trained on a single data modality and multimodal architectures trained on combinations of SAR, multispectral, hyperspectral, and image-text data. They support diverse RS tasks including semantic segmentation, image classification, change detection, and visual question answering. However, selecting an appropriate remote sensing foundation model (RSFM) remains difficult due to scattered documentation, heterogeneous formats, and varied deployment constraints. We introduce the RSFM Database (RS-FMD), a structured resource covering over 150 RSFMs spanning multiple data modalities, resolutions, and learning paradigms. Built on RS-FMD, we present REMSA, the first LLM-based agent for automated RSFM selection from natural language queries. REMSA interprets user requirements, resolves missing constraints, ranks candidate models using in-context learning, and provides transparent justifications. We also propose a benchmark of 75 expert-verified RS query scenarios, producing 900 configurations under an expert-centered evaluation protocol. REMSA outperforms several baselines, including naive agents, dense retrieval, and unstructured RAG-based LLMs. It operates entirely on publicly available metadata and does not access private or sensitive data.",
      "pdf_url": "https://arxiv.org/pdf/2511.17442v1",
      "published": "2025-11-21T17:41:26+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17442v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "InTAct: Interval-based Task Activation Consolidation for Continual Learning",
      "authors": [
        "Patryk Krukowski",
        "Jan Miksa",
        "Piotr Helm",
        "Jacek Tabor",
        "Paweł Wawrzyński",
        "Przemysław Spurek"
      ],
      "abstract": "Continual learning aims to enable neural networks to acquire new knowledge without forgetting previously learned information. While recent prompt-based methods perform strongly in class-incremental settings, they remain vulnerable under domain shifts, where the input distribution changes but the label space remains fixed. This exposes a persistent problem known as representation drift. Shared representations evolve in ways that overwrite previously useful features and cause forgetting even when prompts isolate task-specific parameters. To address this issue, we introduce InTAct, a method that preserves functional behavior in shared layers without freezing parameters or storing past data. InTAct captures the characteristic activation ranges associated with previously learned tasks and constrains updates to ensure the network remains consistent within these regions, while still allowing for flexible adaptation elsewhere. In doing so, InTAct stabilizes the functional role of important neurons rather than directly restricting parameter values. The approach is architecture-agnostic and integrates seamlessly into existing prompt-based continual learning frameworks. By regulating representation changes where past knowledge is encoded, InTAct achieves a principled balance between stability and plasticity. Across diverse domain-incremental benchmarks, including DomainNet and ImageNet-R, InTAct consistently reduces representation drift and improves performance, increasing Average Accuracy by up to 8 percentage points over state-of-the-art baselines.",
      "pdf_url": "https://arxiv.org/pdf/2511.17439v1",
      "published": "2025-11-21T17:36:12+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17439v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "SMILE: A Composite Lexical-Semantic Metric for Question-Answering Evaluation",
      "authors": [
        "Shrikant Kendre",
        "Austin Xu",
        "Honglu Zhou",
        "Michael Ryoo",
        "Shafiq Joty",
        "Juan Carlos Niebles"
      ],
      "abstract": "Traditional evaluation metrics for textual and visual question answering, like ROUGE, METEOR, and Exact Match (EM), focus heavily on n-gram based lexical similarity, often missing the deeper semantic understanding needed for accurate assessment. While measures like BERTScore and MoverScore leverage contextual embeddings to address this limitation, they lack flexibility in balancing sentence-level and keyword-level semantics and ignore lexical similarity, which remains important. Large Language Model (LLM) based evaluators, though powerful, come with drawbacks like high costs, bias, inconsistency, and hallucinations. To address these issues, we introduce SMILE: Semantic Metric Integrating Lexical Exactness, a novel approach that combines sentence-level semantic understanding with keyword-level semantic understanding and easy keyword matching. This composite method balances lexical precision and semantic relevance, offering a comprehensive evaluation. Extensive benchmarks across text, image, and video QA tasks show SMILE is highly correlated with human judgments and computationally lightweight, bridging the gap between lexical and semantic evaluation.",
      "pdf_url": "https://arxiv.org/pdf/2511.17432v1",
      "published": "2025-11-21T17:30:18+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17432v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Preventing Shortcut Learning in Medical Image Analysis through Intermediate Layer Knowledge Distillation from Specialist Teachers",
      "authors": [
        "Christopher Boland",
        "Sotirios Tsaftaris",
        "Sonia Dahdouh"
      ],
      "abstract": "Deep learning models are prone to learning shortcut solutions to problems using spuriously correlated yet irrelevant features of their training data. In high-risk applications such as medical image analysis, this phenomenon may prevent models from using clinically meaningful features when making predictions, potentially leading to poor robustness and harm to patients. We demonstrate that different types of shortcuts (those that are diffuse and spread throughout the image, as well as those that are localized to specific areas) manifest distinctly across network layers and can, therefore, be more effectively targeted through mitigation strategies that target the intermediate layers. We propose a novel knowledge distillation framework that leverages a teacher network fine-tuned on a small subset of task-relevant data to mitigate shortcut learning in a student network trained on a large dataset corrupted with a bias feature. Through extensive experiments on CheXpert, ISIC 2017, and SimBA datasets using various architectures (ResNet-18, AlexNet, DenseNet-121, and 3D CNNs), we demonstrate consistent improvements over traditional Empirical Risk Minimization, augmentation-based bias-mitigation, and group-based bias-mitigation approaches. In many cases, we achieve comparable performance with a baseline model trained on bias-free data, even on out-of-distribution test data. Our results demonstrate the practical applicability of our approach to real-world medical imaging scenarios where bias annotations are limited and shortcut features are difficult to identify a priori.",
      "pdf_url": "https://arxiv.org/pdf/2511.17421v1",
      "published": "2025-11-21T17:18:35+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17421v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "DS-Span: Single-Phase Discriminative Subgraph Mining for Efficient Graph Embeddings",
      "authors": [
        "Yeamin Kaiser",
        "Muhammed Tasnim Bin Anwar",
        "Bholanath Das",
        "Chowdhury Farhan Ahmed",
        "Md. Tanvir Alam"
      ],
      "abstract": "Graph representation learning seeks to transform complex, high-dimensional graph structures into compact vector spaces that preserve both topology and semantics. Among the various strategies, subgraph-based methods provide an interpretable bridge between symbolic pattern discovery and continuous embedding learning. Yet, existing frequent or discriminative subgraph mining approaches often suffer from redundant multi-phase pipelines, high computational cost, and weak coupling between mined structures and their discriminative relevance. We propose DS-Span, a single-phase discriminative subgraph mining framework that unifies pattern growth, pruning, and supervision-driven scoring within one traversal of the search space. DS-Span introduces a coverage-capped eligibility mechanism that dynamically limits exploration once a graph is sufficiently represented, and an information-gain-guided selection that promotes subgraphs with strong class-separating ability while minimizing redundancy. The resulting subgraph set serves as an efficient, interpretable basis for downstream graph embedding and classification. Extensive experiments across benchmarks demonstrate that DS-Span generates more compact and discriminative subgraph features than prior multi-stage methods, achieving higher or comparable accuracy with significantly reduced runtime. These results highlight the potential of unified, single-phase discriminative mining as a foundation for scalable and interpretable graph representation learning.",
      "pdf_url": "https://arxiv.org/pdf/2511.17419v1",
      "published": "2025-11-21T17:17:51+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17419v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "That's not natural: The Impact of Off-Policy Training Data on Probe Performance",
      "authors": [
        "Nathalie Kirch",
        "Samuel Dower",
        "Adrians Skapars",
        "Ekdeep Singh Lubana",
        "Dmitrii Krasheninnikov"
      ],
      "abstract": "Probing has emerged as a promising method for monitoring Large Language Models (LLMs), enabling inference-time detection of concerning behaviours such as deception and sycophancy. However, natural examples of many behaviours are rare, forcing researchers to rely on synthetic or off-policy LLM responses for training probes. We systematically evaluate how the use of synthetic and off-policy data influences probe generalisation across eight distinct LLM behaviours. Testing linear and attention probes across multiple LLMs, we find that the response generation strategy can significantly affect probe performance, though the magnitude of this effect varies by behaviour. We find that successful generalisation from off-policy data, to test sets where the model is incentivised to produce the target behaviour, is predictive of successful on-policy generalisation. Leveraging this result, we predict that Deception and Sandbagging probes may fail to generalise from off-policy to on-policy data when used in real monitoring scenarios. Notably, shifts in the training data domain still cause even larger performance degradation, with different-domain test scores being consistently lower than the same-domain ones. These results indicate that, in the absence of on-policy data, using same-domain off-policy data yields more reliable probes than using on-policy data from a different domain, emphasizing the need for methods that can better handle distribution shifts in LLM monitoring.",
      "pdf_url": "https://arxiv.org/pdf/2511.17408v1",
      "published": "2025-11-21T17:08:48+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17408v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Beyond Multiple Choice: A Hybrid Framework for Unifying Robust Evaluation and Verifiable Reasoning Training",
      "authors": [
        "Yesheng Liu",
        "Hao Li",
        "Haiyu Xu",
        "Baoqi Pei",
        "Jiahao Wang",
        "Mingxuan Zhao",
        "Jingshu Zheng",
        "Zheqi He",
        "JG Yao",
        "Bowen Qin",
        "Xi Yang",
        "Jiajun Zhang"
      ],
      "abstract": "Multiple-choice question answering (MCQA) has been a popular format for evaluating and reinforcement fine-tuning (RFT) of modern multimodal language models. Its constrained output format allows for simplified, deterministic automatic verification. However, we find that the options may leak exploitable signals, which makes the accuracy metrics unreliable for indicating real capabilities and encourages explicit or implicit answer guessing behaviors during RFT. We propose ReVeL (Rewrite and Verify by LLM), a framework that rewrites multiple-choice questions into open-form questions while keeping answers verifiable whenever possible. The framework categorizes questions according to different answer types, apply different rewriting and verification schemes, respectively. When applied for RFT, we converted 20k MCQA examples and use GRPO to finetune Qwen2.5-VL models. Models trained on ReVeL-OpenQA match MCQA accuracy on multiple-choice benchmarks and improve OpenQA accuracy by about six percentage points, indicating better data efficiency and more robust reward signals than MCQA-based training. When used for evaluation, ReVeL also reveals up to 20 percentage points of score inflation in MCQA benchmarks (relative to OpenQA), improves judging accuracy, and reduces both cost and latency. We will release code and data publicly.",
      "pdf_url": "https://arxiv.org/pdf/2511.17405v1",
      "published": "2025-11-21T17:06:37+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17405v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Sparse Mixture-of-Experts for Multi-Channel Imaging: Are All Channel Interactions Required?",
      "authors": [
        "Sukwon Yun",
        "Heming Yao",
        "Burkhard Hoeckendorf",
        "David Richmond",
        "Aviv Regev",
        "Russell Littman"
      ],
      "abstract": "Vision Transformers ($\\text{ViTs}$) have become the backbone of vision foundation models, yet their optimization for multi-channel domains - such as cell painting or satellite imagery - remains underexplored. A key challenge in these domains is capturing interactions between channels, as each channel carries different information. While existing works have shown efficacy by treating each channel independently during tokenization, this approach naturally introduces a major computational bottleneck in the attention block - channel-wise comparisons leads to a quadratic growth in attention, resulting in excessive $\\text{FLOPs}$ and high training cost. In this work, we shift focus from efficacy to the overlooked efficiency challenge in cross-channel attention and ask: \"Is it necessary to model all channel interactions?\". Inspired by the philosophy of Sparse Mixture-of-Experts ($\\text{MoE}$), we propose MoE-ViT, a Mixture-of-Experts architecture for multi-channel images in $\\text{ViTs}$, which treats each channel as an expert and employs a lightweight router to select only the most relevant experts per patch for attention. Proof-of-concept experiments on real-world datasets - JUMP-CP and So2Sat - demonstrate that $\\text{MoE-ViT}$ achieves substantial efficiency gains without sacrificing, and in some cases enhancing, performance, making it a practical and attractive backbone for multi-channel imaging.",
      "pdf_url": "https://arxiv.org/pdf/2511.17400v1",
      "published": "2025-11-21T17:00:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17400v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Designing and Generating Diverse, Equitable Face Image Datasets for Face Verification Tasks",
      "authors": [
        "Georgia Baltsou",
        "Ioannis Sarridis",
        "Christos Koutlis",
        "Symeon Papadopoulos"
      ],
      "abstract": "Face verification is a significant component of identity authentication in various applications including online banking and secure access to personal devices. The majority of the existing face image datasets often suffer from notable biases related to race, gender, and other demographic characteristics, limiting the effectiveness and fairness of face verification systems. In response to these challenges, we propose a comprehensive methodology that integrates advanced generative models to create varied and diverse high-quality synthetic face images. This methodology emphasizes the representation of a diverse range of facial traits, ensuring adherence to characteristics permissible in identity card photographs. Furthermore, we introduce the Diverse and Inclusive Faces for Verification (DIF-V) dataset, comprising 27,780 images of 926 unique identities, designed as a benchmark for future research in face verification. Our analysis reveals that existing verification models exhibit biases toward certain genders and races, and notably, applying identity style modifications negatively impacts model performance. By tackling the inherent inequities in existing datasets, this work not only enriches the discussion on diversity and ethics in artificial intelligence but also lays the foundation for developing more inclusive and reliable face verification technologies",
      "pdf_url": "https://arxiv.org/pdf/2511.17393v1",
      "published": "2025-11-21T16:53:08+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17393v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Quantum Masked Autoencoders for Vision Learning",
      "authors": [
        "Emma Andrews",
        "Prabhat Mishra"
      ],
      "abstract": "Classical autoencoders are widely used to learn features of input data. To improve the feature learning, classical masked autoencoders extend classical autoencoders to learn the features of the original input sample in the presence of masked-out data. While quantum autoencoders exist, there is no design and implementation of quantum masked autoencoders that can leverage the benefits of quantum computing and quantum autoencoders. In this paper, we propose quantum masked autoencoders (QMAEs) that can effectively learn missing features of a data sample within quantum states instead of classical embeddings. We showcase that our QMAE architecture can learn the masked features of an image and can reconstruct the masked input image with improved visual fidelity in MNIST images. Experimental evaluation highlights that QMAE can significantly outperform (12.86% on average) in classification accuracy compared to state-of-the-art quantum autoencoders in the presence of masks.",
      "pdf_url": "https://arxiv.org/pdf/2511.17372v1",
      "published": "2025-11-21T16:37:18+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17372v1",
      "categories": [
        "quant-ph",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Agentifying Agentic AI",
      "authors": [
        "Virginia Dignum",
        "Frank Dignum"
      ],
      "abstract": "Agentic AI seeks to endow systems with sustained autonomy, reasoning, and interaction capabilities. To realize this vision, its assumptions about agency must be complemented by explicit models of cognition, cooperation, and governance. This paper argues that the conceptual tools developed within the Autonomous Agents and Multi-Agent Systems (AAMAS) community, such as BDI architectures, communication protocols, mechanism design, and institutional modelling, provide precisely such a foundation. By aligning adaptive, data-driven approaches with structured models of reasoning and coordination, we outline a path toward agentic systems that are not only capable and flexible, but also transparent, cooperative, and accountable. The result is a perspective on agency that bridges formal theory and practical autonomy.",
      "pdf_url": "https://arxiv.org/pdf/2511.17332v1",
      "published": "2025-11-21T15:54:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17332v1",
      "categories": [
        "cs.AI",
        "cs.MA"
      ]
    },
    {
      "title": "AI Workers, Geopolitics, and Algorithmic Collective Action",
      "authors": [
        "Sydney Reis"
      ],
      "abstract": "According to the theory of International Political Economy (IPE), states are often incentivized to rely on rather than constrain powerful corporations. For this reason, IPE provides a useful lens to explain why efforts to govern Artificial Intelligence (AI) at the international and national levels have thus far been developed, applied, and enforced unevenly. Building on recent work that explores how AI companies engage in geopolitics, this position paper argues that some AI workers can be considered actors of geopolitics. It makes the timely case that governance alone cannot ensure responsible, ethical, or robust AI development and use, and greater attention should be paid to bottom-up interventions at the site of AI development. AI workers themselves should be situated as individual agents of change, especially when considering their potential to foster Algorithmic Collective Action (ACA). Drawing on methods of Participatory Design (PD), this paper proposes engaging AI workers as sources of knowledge, relative power, and intentionality to encourage more responsible and just AI development and create the conditions that can facilitate ACA.",
      "pdf_url": "https://arxiv.org/pdf/2511.17331v1",
      "published": "2025-11-21T15:52:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17331v1",
      "categories": [
        "cs.CY",
        "cs.AI",
        "cs.HC"
      ]
    },
    {
      "title": "MusicAIR: A Multimodal AI Music Generation Framework Powered by an Algorithm-Driven Core",
      "authors": [
        "Callie C. Liao",
        "Duoduo Liao",
        "Ellie L. Zhang"
      ],
      "abstract": "Recent advances in generative AI have made music generation a prominent research focus. However, many neural-based models rely on large datasets, raising concerns about copyright infringement and high-performance costs. In contrast, we propose MusicAIR, an innovative multimodal AI music generation framework powered by a novel algorithm-driven symbolic music core, effectively mitigating copyright infringement risks. The music core algorithms connect critical lyrical and rhythmic information to automatically derive musical features, creating a complete, coherent melodic score solely from the lyrics. The MusicAIR framework facilitates music generation from lyrics, text, and images. The generated score adheres to established principles of music theory, lyrical structure, and rhythmic conventions. We developed Generate AI Music (GenAIM), a web tool using MusicAIR for lyric-to-song, text-to-music, and image-to-music generation. In our experiments, we evaluated AI-generated music scores produced by the system using both standard music metrics and innovative analysis that compares these compositions with original works. The system achieves an average key confidence of 85%, outperforming human composers at 79%, and aligns closely with established music theory standards, demonstrating its ability to generate diverse, human-like compositions. As a co-pilot tool, GenAIM can serve as a reliable music composition assistant and a possible educational composition tutor while simultaneously lowering the entry barrier for all aspiring musicians, which is innovative and significantly contributes to AI for music generation.",
      "pdf_url": "https://arxiv.org/pdf/2511.17323v1",
      "published": "2025-11-21T15:43:27+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17323v1",
      "categories": [
        "cs.SD",
        "cs.AI",
        "cs.CL",
        "cs.MM"
      ]
    },
    {
      "title": "FORWARD: Dataset of a forwarder operating in rough terrain",
      "authors": [
        "Mikael Lundbäck",
        "Erik Wallin",
        "Carola Häggström",
        "Mattias Nyström",
        "Andreas Grönlund",
        "Mats Richardson",
        "Petrus Jönsson",
        "William Arnvik",
        "Lucas Hedström",
        "Arvid Fälldin",
        "Martin Servin"
      ],
      "abstract": "We present FORWARD, a high-resolution multimodal dataset of a cut-to-length forwarder operating in rough terrain on two harvest sites in the middle part of Sweden. The forwarder is a large Komatsu model equipped with a variety of sensors, including RTK-GNSS, 360-camera, operator vibration sensors, internal CAN-bus signal recording, and multiple IMUs. The data includes event time logs recorded in 5 Hz with e.g., driving speed, fuel consumption, vehicle position with centimeter accuracy, and crane use while the vehicle operates in forest areas laser-scanned with very high-resolution, $\\sim$1500 points per square meter. Production log files (StanForD standard) with time-stamped machine events, extensive video material, and terrain data in various formats are included as well. About 18 hours of regular wood extraction work during three days is annotated from 360-video material into individual work elements and included in the dataset. We also include scenario specifications of conducted experiments on forest roads and in terrain. Scenarios include repeatedly driving the same routes with and without steel tracks, different load weight, and different target driving speeds. The dataset is intended for developing models and algorithms for trafficability, perception, and autonomous control of forest machines using artificial intelligence, simulation, and experiments on physical testbeds. In part, we focus on forwarders traversing terrain, avoiding obstacles, and loading or unloading logs, with consideration for efficiency, fuel consumption, safety, and environmental impact. Other benefits of the open dataset include the ability to explore auto-generation and calibration of forestry machine simulators and automation scenario descriptions using the data recorded in the field.",
      "pdf_url": "https://arxiv.org/pdf/2511.17318v1",
      "published": "2025-11-21T15:36:41+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17318v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CE",
        "cs.LG",
        "physics.app-ph"
      ]
    },
    {
      "title": "MuM: Multi-View Masked Image Modeling for 3D Vision",
      "authors": [
        "David Nordström",
        "Johan Edstedt",
        "Fredrik Kahl",
        "Georg Bökman"
      ],
      "abstract": "Self-supervised learning on images seeks to extract meaningful visual representations from unlabeled data. When scaled to large datasets, this paradigm has achieved state-of-the-art performance and the resulting trained models such as DINOv3 have seen widespread adoption. However, most prior efforts are optimized for semantic understanding rather than geometric reasoning. One important exception is Cross-View Completion, CroCo, which is a form of masked autoencoding (MAE) tailored for 3D understanding. In this work, we continue on the path proposed by CroCo and focus on learning features tailored for 3D vision. In a nutshell, we extend MAE to arbitrarily many views of the same scene. By uniformly masking all views and employing a lightweight decoder with inter-frame attention, our approach is inherently simpler and more scalable than CroCo. We evaluate the resulting model, MuM, extensively on downstream tasks including feedforward reconstruction, dense image matching and relative pose estimation, finding that it outperforms the state-of-the-art visual encoders DINOv3 and CroCo v2.",
      "pdf_url": "https://arxiv.org/pdf/2511.17309v1",
      "published": "2025-11-21T15:25:47+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17309v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Large Language Models for Sentiment Analysis to Detect Social Challenges: A Use Case with South African Languages",
      "authors": [
        "Koena Ronny Mabokela",
        "Tim Schlippe",
        "Matthias Wölfel"
      ],
      "abstract": "Sentiment analysis can aid in understanding people's opinions and emotions on social issues. In multilingual communities sentiment analysis systems can be used to quickly identify social challenges in social media posts, enabling government departments to detect and address these issues more precisely and effectively. Recently, large-language models (LLMs) have become available to the wide public and initial analyses have shown that they exhibit magnificent zero-shot sentiment analysis abilities in English. However, there is no work that has investigated to leverage LLMs for sentiment analysis on social media posts in South African languages and detect social challenges. Consequently, in this work, we analyse the zero-shot performance of the state-of-the-art LLMs GPT-3.5, GPT-4, LlaMa 2, PaLM 2, and Dolly 2 to investigate the sentiment polarities of the 10 most emerging topics in English, Sepedi and Setswana social media posts that fall within the jurisdictional areas of 10 South African government departments. Our results demonstrate that there are big differences between the various LLMs, topics, and languages. In addition, we show that a fusion of the outcomes of different LLMs provides large gains in sentiment classification performance with sentiment classification errors below 1%. Consequently, it is now feasible to provide systems that generate reliable information about sentiment analysis to detect social challenges and draw conclusions about possible needs for actions on specific topics and within different language groups.",
      "pdf_url": "https://arxiv.org/pdf/2511.17301v1",
      "published": "2025-11-21T15:14:32+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17301v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Where Culture Fades: Revealing the Cultural Gap in Text-to-Image Generation",
      "authors": [
        "Chuancheng Shi",
        "Shangze Li",
        "Shiming Guo",
        "Simiao Xie",
        "Wenhua Wu",
        "Jingtong Dou",
        "Chao Wu",
        "Canran Xiao",
        "Cong Wang",
        "Zifeng Cheng",
        "Fei Shen",
        "Tat-Seng Chua"
      ],
      "abstract": "Multilingual text-to-image (T2I) models have advanced rapidly in terms of visual realism and semantic alignment, and are now widely utilized. Yet outputs vary across cultural contexts: because language carries cultural connotations, images synthesized from multilingual prompts should preserve cross-lingual cultural consistency. We conduct a comprehensive analysis showing that current T2I models often produce culturally neutral or English-biased results under multilingual prompts. Analyses of two representative models indicate that the issue stems not from missing cultural knowledge but from insufficient activation of culture-related representations. We propose a probing method that localizes culture-sensitive signals to a small set of neurons in a few fixed layers. Guided by this finding, we introduce two complementary alignment strategies: (1) inference-time cultural activation that amplifies the identified neurons without backbone fine-tuned; and (2) layer-targeted cultural enhancement that updates only culturally relevant layers. Experiments on our CultureBench demonstrate consistent improvements over strong baselines in cultural consistency while preserving fidelity and diversity.",
      "pdf_url": "https://arxiv.org/pdf/2511.17282v1",
      "published": "2025-11-21T14:40:50+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17282v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CY"
      ]
    },
    {
      "title": "Leveraging CVAE for Joint Configuration Estimation of Multifingered Grippers from Point Cloud Data",
      "authors": [
        "Julien Merand",
        "Boris Meden",
        "Mathieu Grossard"
      ],
      "abstract": "This paper presents an efficient approach for determining the joint configuration of a multifingered gripper solely from the point cloud data of its poly-articulated chain, as generated by visual sensors, simulations or even generative neural networks. Well-known inverse kinematics (IK) techniques can provide mathematically exact solutions (when they exist) for joint configuration determination based solely on the fingertip pose, but often require post-hoc decision-making by considering the positions of all intermediate phalanges in the gripper's fingers, or rely on algorithms to numerically approximate solutions for more complex kinematics. In contrast, our method leverages machine learning to implicitly overcome these challenges. This is achieved through a Conditional Variational Auto-Encoder (CVAE), which takes point cloud data of key structural elements as input and reconstructs the corresponding joint configurations. We validate our approach on the MultiDex grasping dataset using the Allegro Hand, operating within 0.05 milliseconds and achieving accuracy comparable to state-of-the-art methods. This highlights the effectiveness of our pipeline for joint configuration estimation within the broader context of AI-driven techniques for grasp planning.",
      "pdf_url": "https://arxiv.org/pdf/2511.17276v1",
      "published": "2025-11-21T14:31:39+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17276v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Range-Edit: Semantic Mask Guided Outdoor LiDAR Scene Editing",
      "authors": [
        "Suchetan G. Uppur",
        "Hemant Kumar",
        "Vaibhav Kumar"
      ],
      "abstract": "Training autonomous driving and navigation systems requires large and diverse point cloud datasets that capture complex edge case scenarios from various dynamic urban settings. Acquiring such diverse scenarios from real-world point cloud data, especially for critical edge cases, is challenging, which restricts system generalization and robustness. Current methods rely on simulating point cloud data within handcrafted 3D virtual environments, which is time-consuming, computationally expensive, and often fails to fully capture the complexity of real-world scenes. To address some of these issues, this research proposes a novel approach that addresses the problem discussed by editing real-world LiDAR scans using semantic mask-based guidance to generate novel synthetic LiDAR point clouds. We incorporate range image projection and semantic mask conditioning to achieve diffusion-based generation. Point clouds are transformed to 2D range view images, which are used as an intermediate representation to enable semantic editing using convex hull-based semantic masks. These masks guide the generation process by providing information on the dimensions, orientations, and locations of objects in the real environment, ensuring geometric consistency and realism. This approach demonstrates high-quality LiDAR point cloud generation, capable of producing complex edge cases and dynamic scenes, as validated on the KITTI-360 dataset. This offers a cost-effective and scalable solution for generating diverse LiDAR data, a step toward improving the robustness of autonomous driving systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.17269v1",
      "published": "2025-11-21T14:16:27+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17269v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "DISCA: A Digital In-memory Stochastic Computing Architecture Using A Compressed Bent-Pyramid Format",
      "authors": [
        "Shady Agwa",
        "Yikang Shen",
        "Shiwei Wang",
        "Themis Prodromakis"
      ],
      "abstract": "Nowadays, we are witnessing an Artificial Intelligence revolution that dominates the technology landscape in various application domains, such as healthcare, robotics, automotive, security, and defense. Massive-scale AI models, which mimic the human brain's functionality, typically feature millions and even billions of parameters through data-intensive matrix multiplication tasks. While conventional Von-Neumann architectures struggle with the memory wall and the end of Moore's Law, these AI applications are migrating rapidly towards the edge, such as in robotics and unmanned aerial vehicles for surveillance, thereby adding more constraints to the hardware budget of AI architectures at the edge. Although in-memory computing has been proposed as a promising solution for the memory wall, both analog and digital in-memory computing architectures suffer from substantial degradation of the proposed benefits due to various design limitations. We propose a new digital in-memory stochastic computing architecture, DISCA, utilizing a compressed version of the quasi-stochastic Bent-Pyramid data format. DISCA inherits the same computational simplicity of analog computing, while preserving the same scalability, productivity, and reliability of digital systems. Post-layout modeling results of DISCA show an energy efficiency of 3.59 TOPS/W per bit at 500 MHz using a commercial 180nm CMOS technology. Therefore, DISCA significantly improves the energy efficiency for matrix multiplication workloads by orders of magnitude if scaled and compared to its counterpart architectures.",
      "pdf_url": "https://arxiv.org/pdf/2511.17265v1",
      "published": "2025-11-21T14:13:16+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17265v1",
      "categories": [
        "cs.AR",
        "cs.AI",
        "cs.ET",
        "cs.PF"
      ]
    },
    {
      "title": "Intervene-All-Paths: Unified Mitigation of LVLM Hallucinations across Alignment Formats",
      "authors": [
        "Jiaye Qian",
        "Ge Zheng",
        "Yuchen Zhu",
        "Sibei Yang"
      ],
      "abstract": "Despite their impressive performance across a wide range of tasks, Large Vision-Language Models (LVLMs) remain prone to hallucination. In this study, we propose a comprehensive intervention framework aligned with the transformer's causal architecture in LVLMs, integrating the effects of different intervention paths on hallucination. We find that hallucinations in LVLMs do not arise from a single causal path, but rather from the interplay among image-to-input-text, image-to-output-text, and text-to-text pathways. For the first time, we also find that LVLMs rely on different pathways depending on the question-answer alignment format. Building on these insights, we propose simple yet effective methods to identify and intervene on critical hallucination heads within each pathway, tailored to discriminative and generative formats. Experiments across multiple benchmarks demonstrate that our approach consistently reduces hallucinations across diverse alignment types.",
      "pdf_url": "https://arxiv.org/pdf/2511.17254v1",
      "published": "2025-11-21T13:57:38+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17254v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Lost in Translation and Noise: A Deep Dive into the Failure Modes of VLMs on Real-World Tables",
      "authors": [
        "Anshul Singh",
        "Rohan Chaudhary",
        "Gagneet Singh",
        "Abhay Kumary"
      ],
      "abstract": "The impressive performance of VLMs is largely measured on benchmarks that fail to capture the complexities of real-world scenarios. Existing datasets for tabular QA, such as WikiTableQuestions and FinQA, are overwhelmingly monolingual (English) and present tables in a digitally perfect, clean format. This creates a significant gap between research and practice. To address this, we present \\textbf{MirageTVQA}, a new benchmark designed to evaluate VLMs on these exact dimensions. Featuring nearly 60,000 QA pairs across 24 languages, MirageTVQA challenges models with tables that are not only multilingual but also visually imperfect, incorporating realistic noise to mimic scanned documents. Our evaluation of the leading VLMs reveals two primary failure points: a severe degradation in performance (over 35\\% drop for the best models) when faced with visual noise and a consistent English-first bias where reasoning abilities fail to transfer to other languages. MirageTVQA provides a benchmark for measuring and driving progress towards more robust VLM models for table reasoning. The dataset and the code are available at: https://github.com/anshulsc/MirageTVQA.",
      "pdf_url": "https://arxiv.org/pdf/2511.17238v1",
      "published": "2025-11-21T13:32:56+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17238v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Algorithmic design and implementation considerations of deep MPC",
      "authors": [
        "Prabhat K. Mishra",
        "Mateus V. Gasparino",
        "Girish Chowdhary"
      ],
      "abstract": "Deep Model Predictive Control (Deep MPC) is an evolving field that integrates model predictive control and deep learning. This manuscript is focused on a particular approach, which employs deep neural network in the loop with MPC. This class of approaches distributes control authority between a neural network and an MPC controller, in such a way that the neural network learns the model uncertainties while the MPC handles constraints. The approach is appealing because training data collected while the system is in operation can be used to fine-tune the neural network, and MPC prevents unsafe behavior during those learning transients. This manuscript explains implementation challenges of Deep MPC, algorithmic way to distribute control authority and argues that a poor choice in distributing control authority may lead to poor performance. A reason of poor performance is explained through a numerical experiment on a four-wheeled skid-steer dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2511.17233v1",
      "published": "2025-11-21T13:21:20+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17233v1",
      "categories": [
        "eess.SY",
        "cs.AI"
      ]
    },
    {
      "title": "TP-MDDN: Task-Preferenced Multi-Demand-Driven Navigation with Autonomous Decision-Making",
      "authors": [
        "Shanshan Li",
        "Da Huang",
        "Yu He",
        "Yanwei Fu",
        "Yu-Gang Jiang",
        "Xiangyang Xue"
      ],
      "abstract": "In daily life, people often move through spaces to find objects that meet their needs, posing a key challenge in embodied AI. Traditional Demand-Driven Navigation (DDN) handles one need at a time but does not reflect the complexity of real-world tasks involving multiple needs and personal choices. To bridge this gap, we introduce Task-Preferenced Multi-Demand-Driven Navigation (TP-MDDN), a new benchmark for long-horizon navigation involving multiple sub-demands with explicit task preferences. To solve TP-MDDN, we propose AWMSystem, an autonomous decision-making system composed of three key modules: BreakLLM (instruction decomposition), LocateLLM (goal selection), and StatusMLLM (task monitoring). For spatial memory, we design MASMap, which combines 3D point cloud accumulation with 2D semantic mapping for accurate and efficient environmental understanding. Our Dual-Tempo action generation framework integrates zero-shot planning with policy-based fine control, and is further supported by an Adaptive Error Corrector that handles failure cases in real time. Experiments demonstrate that our approach outperforms state-of-the-art baselines in both perception accuracy and navigation robustness.",
      "pdf_url": "https://arxiv.org/pdf/2511.17225v1",
      "published": "2025-11-21T13:12:13+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17225v1",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Parrot: Persuasion and Agreement Robustness Rating of Output Truth -- A Sycophancy Robustness Benchmark for LLMs",
      "authors": [
        "Yusuf Çelebi",
        "Mahmoud El Hussieni",
        "Özay Ezerceli"
      ],
      "abstract": "This study presents PARROT (Persuasion and Agreement Robustness Rating of Output Truth), a robustness focused framework designed to measure the degradation in accuracy that occurs under social pressure exerted on users through authority and persuasion in large language models (LLMs) the phenomenon of sycophancy (excessive conformity). PARROT (i) isolates causal effects by comparing the neutral version of the same question with an authoritatively false version using a double-blind evaluation, (ii) quantifies confidence shifts toward the correct and imposed false responses using log-likelihood-based calibration tracking, and (iii) systematically classifies failure modes (e.g., robust correct, sycophantic agreement, reinforced error, stubborn error, self-correction, etc.) using an eight-state behavioral taxonomy. We evaluated 22 models using 1,302 MMLU-style multiple-choice questions across 13 domains and domain-specific authority templates. Findings show marked heterogeneity: advanced models (e.g., GPT-5, GPT-4.1, Claude Sonnet 4.5) exhibit low \"follow rates\" ($\\leq 11\\%$, GPT-5: 4\\%) and minimal accuracy loss, while older/smaller models show severe epistemic collapse (GPT-4: 80\\%, Qwen 2.5-1.5B: 94\\%). The danger is not limited to response changes; weak models reduce confidence in the correct response while increasing confidence in the imposed incorrect response. While international law and global knowledge at the domain level exhibit high fragility, elementary mathematics is relatively resilient. Consequently, we argue that the goal of \"resistance to overfitting pressure\" should be addressed as a primary objective alongside accuracy, harm avoidance, and privacy for safe deployment in the real world.",
      "pdf_url": "https://arxiv.org/pdf/2511.17220v1",
      "published": "2025-11-21T13:01:28+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17220v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CE",
        "cs.LG"
      ]
    },
    {
      "title": "Designing Domain-Specific Agents via Hierarchical Task Abstraction Mechanism",
      "authors": [
        "Kaiyu Li",
        "Jiayu Wang",
        "Zhi Wang",
        "Hui Qiao",
        "Weizhan Zhang",
        "Deyu Meng",
        "Xiangyong Cao"
      ],
      "abstract": "LLM-driven agents, particularly those using general frameworks like ReAct or human-inspired role-playing, often struggle in specialized domains that necessitate rigorously structured workflows. Fields such as remote sensing, requiring specialized tools (e.g., correction, spectral indices calculation), and multi-step procedures (e.g., numerous intermediate products and optional steps), significantly challenge generalized approaches. To address this gap, we introduce a novel agent design framework centered on a Hierarchical Task Abstraction Mechanism (HTAM). Specifically, HTAM moves beyond emulating social roles, instead structuring multi-agent systems into a logical hierarchy that mirrors the intrinsic task-dependency graph of a given domain. This task-centric architecture thus enforces procedural correctness and decomposes complex problems into sequential layers, where each layer's sub-agents operate on the outputs of the preceding layers. We instantiate this framework as EarthAgent, a multi-agent system tailored for complex geospatial analysis. To evaluate such complex planning capabilities, we build GeoPlan-bench, a comprehensive benchmark of realistic, multi-step geospatial planning tasks. It is accompanied by a suite of carefully designed metrics to evaluate tool selection, path similarity, and logical completeness. Experiments show that EarthAgent substantially outperforms a range of established single- and multi-agent systems. Our work demonstrates that aligning agent architecture with a domain's intrinsic task structure is a critical step toward building robust and reliable specialized autonomous systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.17198v1",
      "published": "2025-11-21T12:25:47+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17198v1",
      "categories": [
        "cs.AI",
        "cs.CV"
      ]
    },
    {
      "title": "Attention-Guided Feature Fusion (AGFF) Model for Integrating Statistical and Semantic Features in News Text Classification",
      "authors": [
        "Mohammad Zare"
      ],
      "abstract": "News text classification is a crucial task in natural language processing, essential for organizing and filtering the massive volume of digital content. Traditional methods typically rely on statistical features like term frequencies or TF-IDF values, which are effective at capturing word-level importance but often fail to reflect contextual meaning. In contrast, modern deep learning approaches utilize semantic features to understand word usage within context, yet they may overlook simple, high-impact statistical indicators. This paper introduces an Attention-Guided Feature Fusion (AGFF) model that combines statistical and semantic features in a unified framework. The model applies an attention-based mechanism to dynamically determine the relative importance of each feature type, enabling more informed classification decisions. Through evaluation on benchmark news datasets, the AGFF model demonstrates superior performance compared to both traditional statistical models and purely semantic deep learning models. The results confirm that strategic integration of diverse feature types can significantly enhance classification accuracy. Additionally, ablation studies validate the contribution of each component in the fusion process. The findings highlight the model's ability to balance and exploit the complementary strengths of statistical and semantic representations, making it a practical and effective solution for real-world news classification tasks.",
      "pdf_url": "https://arxiv.org/pdf/2511.17184v1",
      "published": "2025-11-21T12:05:31+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17184v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Hallucinate Less by Thinking More: Aspect-Based Causal Abstention for Large Language Models",
      "authors": [
        "Vy Nguyen",
        "Ziqi Xu",
        "Jeffrey Chan",
        "Estrid He",
        "Feng Xia",
        "Xiuzhen Zhang"
      ],
      "abstract": "Large Language Models (LLMs) often produce fluent but factually incorrect responses, a phenomenon known as hallucination. Abstention, where the model chooses not to answer and instead outputs phrases such as \"I don't know\", is a common safeguard. However, existing abstention methods typically rely on post-generation signals, such as generation variations or feedback, which limits their ability to prevent unreliable responses in advance. In this paper, we introduce Aspect-Based Causal Abstention (ABCA), a new framework that enables early abstention by analysing the internal diversity of LLM knowledge through causal inference. This diversity reflects the multifaceted nature of parametric knowledge acquired from various sources, representing diverse aspects such as disciplines, legal contexts, or temporal frames. ABCA estimates causal effects conditioned on these aspects to assess the reliability of knowledge relevant to a given query. Based on these estimates, we enable two types of abstention: Type-1, where aspect effects are inconsistent (knowledge conflict), and Type-2, where aspect effects consistently support abstention (knowledge insufficiency). Experiments on standard benchmarks demonstrate that ABCA improves abstention reliability, achieves state-of-the-art performance, and enhances the interpretability of abstention decisions.",
      "pdf_url": "https://arxiv.org/pdf/2511.17170v1",
      "published": "2025-11-21T11:42:49+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17170v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "MIR: Efficient Exploration in Episodic Multi-Agent Reinforcement Learning via Mutual Intrinsic Reward",
      "authors": [
        "Kesheng Chen",
        "Wenjian Luo",
        "Bang Zhang",
        "Zeping Yin",
        "Zipeng Ye"
      ],
      "abstract": "Episodic rewards present a significant challenge in reinforcement learning. While intrinsic reward methods have demonstrated effectiveness in single-agent rein-forcement learning scenarios, their application to multi-agent reinforcement learn-ing (MARL) remains problematic. The primary difficulties stem from two fac-tors: (1) the exponential sparsity of joint action trajectories that lead to rewards as the exploration space expands, and (2) existing methods often fail to account for joint actions that can influence team states. To address these challenges, this paper introduces Mutual Intrinsic Reward (MIR), a simple yet effective enhancement strategy for MARL with extremely sparse rewards like episodic rewards. MIR incentivizes individual agents to explore actions that affect their teammates, and when combined with original strategies, effectively stimulates team exploration and improves algorithm performance. For comprehensive experimental valida-tion, we extend the representative single-agent MiniGrid environment to create MiniGrid-MA, a series of MARL environments with sparse rewards. Our evalu-ation compares the proposed method against state-of-the-art approaches in the MiniGrid-MA setting, with experimental results demonstrating superior perfor-mance.",
      "pdf_url": "https://arxiv.org/pdf/2511.17165v1",
      "published": "2025-11-21T11:32:28+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17165v1",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "The Belief-Desire-Intention Ontology for modelling mental reality and agency",
      "authors": [
        "Sara Zuppiroli",
        "Carmelo Fabio Longo",
        "Anna Sofia Lippolis",
        "Rocco Paolillo",
        "Lorenzo Giammei",
        "Miguel Ceriani",
        "Francesco Poggi",
        "Antonio Zinilli",
        "Andrea Giovanni Nuzzolese"
      ],
      "abstract": "The Belief-Desire-Intention (BDI) model is a cornerstone for representing rational agency in artificial intelligence and cognitive sciences. Yet, its integration into structured, semantically interoperable knowledge representations remains limited. This paper presents a formal BDI Ontology, conceived as a modular Ontology Design Pattern (ODP) that captures the cognitive architecture of agents through beliefs, desires, intentions, and their dynamic interrelations. The ontology ensures semantic precision and reusability by aligning with foundational ontologies and best practices in modular design. Two complementary lines of experimentation demonstrate its applicability: (i) coupling the ontology with Large Language Models (LLMs) via Logic Augmented Generation (LAG) to assess the contribution of ontological grounding to inferential coherence and consistency; and (ii) integrating the ontology within the Semas reasoning platform, which implements the Triples-to-Beliefs-to-Triples (T2B2T) paradigm, enabling a bidirectional flow between RDF triples and agent mental states. Together, these experiments illustrate how the BDI Ontology acts as both a conceptual and operational bridge between declarative and procedural intelligence, paving the way for cognitively grounded, explainable, and semantically interoperable multi-agent and neuro-symbolic systems operating within the Web of Data.",
      "pdf_url": "https://arxiv.org/pdf/2511.17162v1",
      "published": "2025-11-21T11:30:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17162v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "The PLLuM Instruction Corpus",
      "authors": [
        "Piotr Pęzik",
        "Filip Żarnecki",
        "Konrad Kaczyński",
        "Anna Cichosz",
        "Zuzanna Deckert",
        "Monika Garnys",
        "Izabela Grabarczyk",
        "Wojciech Janowski",
        "Sylwia Karasińska",
        "Aleksandra Kujawiak",
        "Piotr Misztela",
        "Maria Szymańska",
        "Karolina Walkusz",
        "Igor Siek",
        "Maciej Chrabąszcz",
        "Anna Kołos",
        "Agnieszka Karlińska",
        "Karolina Seweryn",
        "Aleksandra Krasnodębska",
        "Paula Betscher",
        "Zofia Cieślińska",
        "Katarzyna Kowol",
        "Artur Wilczek",
        "Maciej Trzciński",
        "Katarzyna Dziewulska",
        "Roman Roszko",
        "Tomasz Bernaś",
        "Jurgita Vaičenonienė",
        "Danuta Roszko",
        "Paweł Levchuk",
        "Paweł Kowalski",
        "Irena Prawdzic-Jankowska",
        "Marek Kozłowski",
        "Sławomir Dadas",
        "Rafał Poświata",
        "Alina Wróblewska",
        "Katarzyna Krasnowska-Kieraś",
        "Maciej Ogrodniczuk",
        "Michał Rudolf",
        "Piotr Rybak",
        "Karolina Saputa",
        "Joanna Wołoszyn",
        "Marcin Oleksy",
        "Bartłomiej Koptyra",
        "Teddy Ferdinan",
        "Stanisław Woźniak",
        "Maciej Piasecki",
        "Paweł Walkowiak",
        "Konrad Wojtasik",
        "Arkadiusz Janz",
        "Przemysław Kazienko",
        "Julia Moska",
        "Jan Kocoń"
      ],
      "abstract": "This paper describes the instruction dataset used to fine-tune a set of transformer-based large language models (LLMs) developed in the PLLuM (Polish Large Language Model) project. We present a functional typology of the organic, converted, and synthetic instructions used in PLLuM and share some observations about the implications of using human-authored versus synthetic instruction datasets in the linguistic adaptation of base LLMs. Additionally, we release the first representative subset of the PLLuM instruction corpus (PLLuMIC), which we believe to be useful in guiding and planning the development of similar datasets for other LLMs.",
      "pdf_url": "https://arxiv.org/pdf/2511.17161v1",
      "published": "2025-11-21T11:28:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17161v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "A lightweight detector for real-time detection of remote sensing images",
      "authors": [
        "Qianyi Wang",
        "Guoqiang Ren"
      ],
      "abstract": "Remote sensing imagery is widely used across various fields, yet real-time detection remains challenging due to the prevalence of small objects and the need to balance accuracy with efficiency. To address this, we propose DMG-YOLO, a lightweight real-time detector tailored for small object detection in remote sensing images. Specifically, we design a Dual-branch Feature Extraction (DFE) module in the backbone, which partitions feature maps into two parallel branches: one extracts local features via depthwise separable convolutions, and the other captures global context using a vision transformer with a gating mechanism. Additionally, a Multi-scale Feature Fusion (MFF) module with dilated convolutions enhances multi-scale integration while preserving fine details. In the neck, we introduce the Global and Local Aggregate Feature Pyramid Network (GLAFPN) to further boost small object detection through global-local feature fusion. Extensive experiments on the VisDrone2019 and NWPU VHR-10 datasets show that DMG-YOLO achieves competitive performance in terms of mAP, model size, and other key metrics.",
      "pdf_url": "https://arxiv.org/pdf/2511.17147v1",
      "published": "2025-11-21T11:11:04+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17147v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Device-Guided Music Transfer",
      "authors": [
        "Manh Pham Hung",
        "Changshuo Hu",
        "Ting Dang",
        "Dong Ma"
      ],
      "abstract": "Device-guided music transfer adapts playback across unseen devices for users who lack them. Existing methods mainly focus on modifying the timbre, rhythm, harmony, or instrumentation to mimic genres or artists, overlooking the diverse hardware properties of the playback device (i.e., speaker). Therefore, we propose DeMT, which processes a speaker's frequency response curve as a line graph using a vision-language model to extract device embeddings. These embeddings then condition a hybrid transformer via feature-wise linear modulation. Fine-tuned on a self-collected dataset, DeMT enables effective speaker-style transfer and robust few-shot adaptation for unseen devices, supporting applications like device-style augmentation and quality enhancement.",
      "pdf_url": "https://arxiv.org/pdf/2511.17136v1",
      "published": "2025-11-21T10:57:11+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17136v1",
      "categories": [
        "cs.SD",
        "cs.AI"
      ]
    },
    {
      "title": "UI-CUBE: Enterprise-Grade Computer Use Agent Benchmarking Beyond Task Accuracy to Operational Reliability",
      "authors": [
        "Horia Cristescu",
        "Charles Park",
        "Trong Canh Nguyen",
        "Sergiu Talmacel",
        "Alexandru-Gabriel Ilie",
        "Stefan Adam"
      ],
      "abstract": "While current Computer Use Agent (CUA) benchmarks measure task completion effectively, they provide limited assessment of enterprise deployment readiness, emphasizing functional correctness over the operational reliability required for production systems. We present UI-CUBE (UiPath Computer Use BEnchmark), a systematic benchmark comprising 226 tasks across two difficulty tiers designed to expose fundamental architectural limitations in current CUAs. Our evaluation covers simple UI interactions (136 tasks) and complex workflows including copy-paste tasks (50 tasks) and enterprise application scenarios (40 tasks), with systematic interface variation coverage, multi-resolution testing and automated validation of task success through the application state. Evaluation of five state-of-the-art models reveals a sharp capability cliff rather than gradual performance degradation. Simple UI interactions achieve 67-85% success rates (compared to 97.9% human performance), but complex workflows drop precipitously to 9-19%. Human evaluators with no prior application experience achieve only 61.2% on complex tasks despite near-perfect performance on simple tasks, establishing realistic performance ceilings. This discontinuous performance pattern -- where agents achieve 68-87% of human performance on simple tasks but only 15-32% on complex workflows -- indicates fundamental architectural limitations in memory management, hierarchical planning, and state coordination rather than incremental capability gaps addressable through better training or prompting. UI-CUBE functions as an enterprise-readiness diagnostic, revealing that while current CUAs can manipulate individual interface elements, they cannot yet function as reliable workflow automation tools. These findings provide architectural insights essential for developing production-ready CUAs capable of managing complex, multi-step enterprise processes.",
      "pdf_url": "https://arxiv.org/pdf/2511.17131v1",
      "published": "2025-11-21T10:47:22+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17131v1",
      "categories": [
        "cs.SE",
        "cs.AI"
      ]
    },
    {
      "title": "Learning to Compress: Unlocking the Potential of Large Language Models for Text Representation",
      "authors": [
        "Yeqin Zhang",
        "Yizheng Zhao",
        "Chen Hu",
        "Binxing Jiao",
        "Daxin Jiang",
        "Ruihang Miao",
        "Cam-Tu Nguyen"
      ],
      "abstract": "Text representation plays a critical role in tasks like clustering, retrieval, and other downstream applications. With the emergence of large language models (LLMs), there is increasing interest in harnessing their capabilities for this purpose. However, most of the LLMs are inherently causal and optimized for next-token prediction, making them suboptimal for producing holistic representations. To address this, recent studies introduced pretext tasks to adapt LLMs for text representation. Most of these tasks, however, rely on token-level prediction objectives, such as the masked next-token prediction (MNTP) used in LLM2Vec. In this work, we explore the untapped potential of context compression as a pretext task for unsupervised adaptation of LLMs. During compression pre-training, the model learns to generate compact memory tokens, which substitute the whole context for downstream sequence prediction. Experiments demonstrate that a well-designed compression objective can significantly enhance LLM-based text representations, outperforming models trained with token-level pretext tasks. Further improvements through contrastive learning produce a strong representation model (LLM2Comp) that outperforms contemporary LLM-based text encoders on a wide range of tasks while being more sample-efficient, requiring significantly less training data.",
      "pdf_url": "https://arxiv.org/pdf/2511.17129v1",
      "published": "2025-11-21T10:45:44+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17129v1",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Training Foundation Models on a Full-Stack AMD Platform: Compute, Networking, and System Design",
      "authors": [
        "Quentin Anthony",
        "Yury Tokpanov",
        "Skyler Szot",
        "Srivatsan Rajagopal",
        "Praneeth Medepalli",
        "Rishi Iyer",
        "Vasu Shyam",
        "Anna Golubeva",
        "Ansh Chaurasia",
        "Xiao Yang",
        "Tomas Figliolia",
        "Robert Washbourne",
        "Drew Thorstensen",
        "Amartey Pearson",
        "Zack Grossbart",
        "Jason van Patten",
        "Emad Barsoum",
        "Zhenyu Gu",
        "Yao Fu",
        "Beren Millidge"
      ],
      "abstract": "We report on the first large-scale mixture-of-experts (MoE) pretraining study on pure AMD hardware, utilizing both MI300X GPUs with Pollara interconnect. We distill practical guidance for both systems and model design. On the systems side, we deliver a comprehensive cluster and networking characterization: microbenchmarks for all core collectives (all-reduce, reduce-scatter, all-gather, broadcast) across message sizes and GPU counts on Pollara. To our knowledge, this is the first at this scale. We further provide MI300X microbenchmarks on kernel sizing and memory bandwidth to inform model design. On the modeling side, we introduce and apply MI300X-aware transformer sizing rules for attention and MLP blocks and justify MoE widths that jointly optimize training throughput and inference latency. We describe our training stack in depth, including often-ignored utilities such as fault-tolerance and checkpoint-reshaping, as well as detailed information on our training recipe. We also provide a preview of our model architecture and base model - ZAYA1 (760M active, 8.3B total parameters MoE) - which will be further improved upon in forthcoming papers. ZAYA1-base achieves performance comparable to leading base models such as Qwen3-4B and Gemma3-12B at its scale and larger, and outperforms models including Llama-3-8B and OLMoE across reasoning, mathematics, and coding benchmarks. Together, these results demonstrate that the AMD hardware, network, and software stack are mature and optimized enough for competitive large-scale pretraining.",
      "pdf_url": "https://arxiv.org/pdf/2511.17127v1",
      "published": "2025-11-21T10:44:02+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17127v1",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.DC"
      ]
    },
    {
      "title": "AutoGraphAD: A novel approach using Variational Graph Autoencoders for anomalous network flow detection",
      "authors": [
        "Georgios Anyfantis",
        "Pere Barlet-Ros"
      ],
      "abstract": "Network Intrusion Detection Systems (NIDS) are essential tools for detecting network attacks and intrusions. While extensive research has explored the use of supervised Machine Learning for attack detection and characterisation, these methods require accurately labelled datasets, which are very costly to obtain. Moreover, existing public datasets have limited and/or outdated attacks, and many of them suffer from mislabelled data. To reduce the reliance on labelled data, we propose AutoGraphAD, a novel unsupervised anomaly detection approach based on a Heterogeneous Variational Graph Autoencoder. AutoGraphAD operates on heterogeneous graphs, made from connection and IP nodes that capture network activity within a time window. The model is trained using unsupervised and contrastive learning, without relying on any labelled data. The reconstruction, structural loss, and KL divergence are then weighted and combined in an anomaly score that is then used for anomaly detection. Overall, AutoGraphAD yields the same, and in some cases better, results than previous unsupervised approaches, such as Anomal-E, but without requiring costly downstream anomaly detectors. As a result, AutoGraphAD achieves around 1.18 orders of magnitude faster training and 1.03 orders of magnitude faster inference, which represents a significant advantage for operational deployment.",
      "pdf_url": "https://arxiv.org/pdf/2511.17113v1",
      "published": "2025-11-21T10:22:00+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17113v1",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Geometric-Disentangelment Unlearning",
      "authors": [
        "Duo Zhou",
        "Yuji Zhang",
        "Tianxin Wei",
        "Ruizhong Qiu",
        "Ke Yang",
        "Xiao Lin",
        "Cheng Qian",
        "Jingrui He",
        "Hanghang Tong",
        "Heng Ji",
        "Huan Zhang"
      ],
      "abstract": "Machine unlearning, the removal of a training subset's influence from a deployed model, is critical for privacy preservation and model reliability, yet gradient ascent on forget samples often harms retained knowledge. Existing approaches face a persistent tradeoff between effective forgetting and preservation on the retain set. While previous methods provide useful heuristics, they often lack a formal analysis on how exactly forgetting updates harm retained knowledge, and whether the side effects can be removed with theoretical guarantees. To explore a theoretically sound and simple solution, we start from the first principle on how performance on the retain set is actually affected: a first-order analysis of the local change of the retain loss under small parameter updates during model training. We start from a crisp equivalence: the retain loss is unchanged to first order iff the update direction is orthogonal to the subspace spanned by retain gradients (\"retain-invariant\"). This identifies the entangled component as the tangential part of forget update within the retain-gradient subspace, and characterizes disentanglement as orthogonality. Guided by this, we propose the Geometric-disentanglement Unlearning (GU) that decomposes any candidate forget gradient update into tangential and normal components to retain space and executes only the normal component. Under a standard trust-region budget, the projected direction aligned with the raw forget gradient is optimal among all first-order retain-invariant moves, and we also derive the optimal projected direction for joint forget-retain updating objectives. Our method is plug-and-play and can be attached to existing gradient-based unlearning procedures to mitigate side effects. GU achieves consistent improvement on various methods across three benchmarks TOFU, MUSE, and WMDP.",
      "pdf_url": "https://arxiv.org/pdf/2511.17100v1",
      "published": "2025-11-21T09:58:25+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17100v1",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "Spanning Tree Autoregressive Visual Generation",
      "authors": [
        "Sangkyu Lee",
        "Changho Lee",
        "Janghoon Han",
        "Hosung Song",
        "Tackgeun You",
        "Hwasup Lim",
        "Stanley Jungkyu Choi",
        "Honglak Lee",
        "Youngjae Yu"
      ],
      "abstract": "We present Spanning Tree Autoregressive (STAR) modeling, which can incorporate prior knowledge of images, such as center bias and locality, to maintain sampling performance while also providing sufficiently flexible sequence orders to accommodate image editing at inference. Approaches that expose randomly permuted sequence orders to conventional autoregressive (AR) models in visual generation for bidirectional context either suffer from a decline in performance or compromise the flexibility in sequence order choice at inference. Instead, STAR utilizes traversal orders of uniform spanning trees sampled in a lattice defined by the positions of image patches. Traversal orders are obtained through breadth-first search, allowing us to efficiently construct a spanning tree whose traversal order ensures that the connected partial observation of the image appears as a prefix in the sequence through rejection sampling. Through the tailored yet structured randomized strategy compared to random permutation, STAR preserves the capability of postfix completion while maintaining sampling performance without any significant changes to the model architecture widely adopted in the language AR modeling.",
      "pdf_url": "https://arxiv.org/pdf/2511.17089v1",
      "published": "2025-11-21T09:45:17+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17089v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Why Do Language Model Agents Whistleblow?",
      "authors": [
        "Kushal Agrawal",
        "Frank Xiao",
        "Guido Bergman",
        "Asa Cooper Stickland"
      ],
      "abstract": "The deployment of Large Language Models (LLMs) as tool-using agents causes their alignment training to manifest in new ways. Recent work finds that language models can use tools in ways that contradict the interests or explicit instructions of the user. We study LLM whistleblowing: a subset of this behavior where models disclose suspected misconduct to parties beyond the dialog boundary (e.g., regulatory agencies) without user instruction or knowledge. We introduce an evaluation suite of diverse and realistic staged misconduct scenarios to assess agents for this behavior. Across models and settings, we find that: (1) the frequency of whistleblowing varies widely across model families, (2) increasing the complexity of the task the agent is instructed to complete lowers whistleblowing tendencies, (3) nudging the agent in the system prompt to act morally substantially raises whistleblowing rates, and (4) giving the model more obvious avenues for non-whistleblowing behavior, by providing more tools and a detailed workflow to follow, decreases whistleblowing rates. Additionally, we verify the robustness of our dataset by testing for model evaluation awareness, and find that both black-box methods and probes on model activations show lower evaluation awareness in our settings than in comparable previous work.",
      "pdf_url": "https://arxiv.org/pdf/2511.17085v1",
      "published": "2025-11-21T09:40:52+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17085v1",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "ReBrain: Brain MRI Reconstruction from Sparse CT Slice via Retrieval-Augmented Diffusion",
      "authors": [
        "Junming Liu",
        "Yifei Sun",
        "Weihua Cheng",
        "Yujin Kang",
        "Yirong Chen",
        "Ding Wang",
        "Guosun Zeng"
      ],
      "abstract": "Magnetic Resonance Imaging (MRI) plays a crucial role in brain disease diagnosis, but it is not always feasible for certain patients due to physical or clinical constraints. Recent studies attempt to synthesize MRI from Computed Tomography (CT) scans; however, low-dose protocols often result in highly sparse CT volumes with poor through-plane resolution, making accurate reconstruction of the full brain MRI volume particularly challenging. To address this, we propose ReBrain, a retrieval-augmented diffusion framework for brain MRI reconstruction. Given any 3D CT scan with limited slices, we first employ a Brownian Bridge Diffusion Model (BBDM) to synthesize MRI slices along the 2D dimension. Simultaneously, we retrieve structurally and pathologically similar CT slices from a comprehensive prior database via a fine-tuned retrieval model. These retrieved slices are used as references, incorporated through a ControlNet branch to guide the generation of intermediate MRI slices and ensure structural continuity. We further account for rare retrieval failures when the database lacks suitable references and apply spherical linear interpolation to provide supplementary guidance. Extensive experiments on SynthRAD2023 and BraTS demonstrate that ReBrain achieves state-of-the-art performance in cross-modal reconstruction under sparse conditions.",
      "pdf_url": "https://arxiv.org/pdf/2511.17068v1",
      "published": "2025-11-21T09:18:35+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17068v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Patient-level Information Extraction by Consistent Integration of Textual and Tabular Evidence with Bayesian Networks",
      "authors": [
        "Paloma Rabaey",
        "Adrick Tench",
        "Stefan Heytens",
        "Thomas Demeester"
      ],
      "abstract": "Electronic health records (EHRs) form an invaluable resource for training clinical decision support systems. To leverage the potential of such systems in high-risk applications, we need large, structured tabular datasets on which we can build transparent feature-based models. While part of the EHR already contains structured information (e.g. diagnosis codes, medications, and lab results), much of the information is contained within unstructured text (e.g. discharge summaries and nursing notes). In this work, we propose a method for multi-modal patient-level information extraction that leverages both the tabular features available in the patient's EHR (using an expert-informed Bayesian network) as well as clinical notes describing the patient's symptoms (using neural text classifiers). We propose the use of virtual evidence augmented with a consistency node to provide an interpretable, probabilistic fusion of the models' predictions. The consistency node improves the calibration of the final predictions compared to virtual evidence alone, allowing the Bayesian network to better adjust the neural classifier's output to handle missing information and resolve contradictions between the tabular and text data. We show the potential of our method on the SimSUM dataset, a simulated benchmark linking tabular EHRs with clinical notes through expert knowledge.",
      "pdf_url": "https://arxiv.org/pdf/2511.17056v1",
      "published": "2025-11-21T08:59:42+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17056v1",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "OmniPT: Unleashing the Potential of Large Vision Language Models for Pedestrian Tracking and Understanding",
      "authors": [
        "Teng Fu",
        "Mengyang Zhao",
        "Ke Niu",
        "Kaixin Peng",
        "Bin Li"
      ],
      "abstract": "LVLMs have been shown to perform excellently in image-level tasks such as VQA and caption. However, in many instance-level tasks, such as visual grounding and object detection, LVLMs still show performance gaps compared to previous expert models. Meanwhile, although pedestrian tracking is a classical task, there have been a number of new topics in combining object tracking and natural language, such as Referring MOT, Cross-view Referring MOT, and Semantic MOT. These tasks emphasize that models should understand the tracked object at an advanced semantic level, which is exactly where LVLMs excel. In this paper, we propose a new unified Pedestrian Tracking framework, namely OmniPT, which can track, track based on reference and generate semantic understanding of tracked objects interactively. We address two issues: how to model the tracking task into a task that foundation models can perform, and how to make the model output formatted answers. To this end, we implement a training phase consisting of RL-Mid Training-SFT-RL. Based on the pre-trained weights of the LVLM, we first perform a simple RL phase to enable the model to output fixed and supervisable bounding box format. Subsequently, we conduct a mid-training phase using a large number of pedestrian-related datasets. Finally, we perform supervised fine-tuning on several pedestrian tracking datasets, and then carry out another RL phase to improve the model's tracking performance and enhance its ability to follow instructions. We conduct experiments on tracking benchmarks and the experimental results demonstrate that the proposed method can perform better than the previous methods.",
      "pdf_url": "https://arxiv.org/pdf/2511.17053v1",
      "published": "2025-11-21T08:54:49+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17053v1",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "RacketVision: A Multiple Racket Sports Benchmark for Unified Ball and Racket Analysis",
      "authors": [
        "Linfeng Dong",
        "Yuchen Yang",
        "Hao Wu",
        "Wei Wang",
        "Yuenan HouZhihang Zhong",
        "Xiao Sun"
      ],
      "abstract": "We introduce RacketVision, a novel dataset and benchmark for advancing computer vision in sports analytics, covering table tennis, tennis, and badminton. The dataset is the first to provide large-scale, fine-grained annotations for racket pose alongside traditional ball positions, enabling research into complex human-object interactions. It is designed to tackle three interconnected tasks: fine-grained ball tracking, articulated racket pose estimation, and predictive ball trajectory forecasting. Our evaluation of established baselines reveals a critical insight for multi-modal fusion: while naively concatenating racket pose features degrades performance, a CrossAttention mechanism is essential to unlock their value, leading to trajectory prediction results that surpass strong unimodal baselines. RacketVision provides a versatile resource and a strong starting point for future research in dynamic object tracking, conditional motion forecasting, and multimodal analysis in sports. Project page at https://github.com/OrcustD/RacketVision",
      "pdf_url": "https://arxiv.org/pdf/2511.17045v1",
      "published": "2025-11-21T08:44:33+00:00",
      "arxiv_url": "http://arxiv.org/abs/2511.17045v1",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.MM"
      ]
    }
  ]
}